{"format": "graph-model", "generatedBy": "2.17.1", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "input_2:0": {"name": "input_2:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}, "outputs": {"dense": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "677"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/dense/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "677"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5551"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/embedding/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/embedding/NotEqual/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "677"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/embedding_1/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/embedding_1/NotEqual/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose_2/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "677"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/model/embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown", "input_1", "StatefulPartitionedCall/model/embedding/embedding_lookup/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/model/embedding/NotEqual", "op": "NotEqual", "input": ["input_1", "StatefulPartitionedCall/model/embedding/NotEqual/y"], "attr": {"T": {"type": "DT_INT32"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/model/embedding_1/embedding_lookup", "op": "GatherV2", "input": ["unknown_0", "input_2", "StatefulPartitionedCall/model/embedding_1/embedding_lookup/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/model/embedding_1/NotEqual", "op": "NotEqual", "input": ["input_2", "StatefulPartitionedCall/model/embedding_1/NotEqual/y"], "attr": {"T": {"type": "DT_INT32"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/model/lstm/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/embedding/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/model/embedding/embedding_lookup", "StatefulPartitionedCall/model/lstm/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/embedding/NotEqual", "StatefulPartitionedCall/model/lstm/PartitionedCall/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/model/embedding_1/embedding_lookup", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/embedding_1/NotEqual", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/lstm/Shape", "StatefulPartitionedCall/model/lstm/strided_slice/stack", "StatefulPartitionedCall/model/lstm/strided_slice/stack_1", "StatefulPartitionedCall/model/lstm/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/transpose", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_1/stack", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_1/stack_1", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/transpose", "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/ExpandDims", "StatefulPartitionedCall/model/lstm/PartitionedCall/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice_1/stack", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice_1/stack_1", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/ExpandDims", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/model/lstm/strided_slice", "StatefulPartitionedCall/model/lstm/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/model/lstm/strided_slice", "StatefulPartitionedCall/model/lstm/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/Shape", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/transpose_1", "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_BOOL"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_BOOL"}]}]}]}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/Shape", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose_1", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_BOOL"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_BOOL"}]}]}]}}, {"name": "StatefulPartitionedCall/model/lstm/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/model/lstm/zeros/packed", "StatefulPartitionedCall/model/lstm/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/model/lstm/zeros_1/packed", "StatefulPartitionedCall/model/lstm/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/model/lstm/zeros", "StatefulPartitionedCall/model/lstm/Read_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_1", "StatefulPartitionedCall/model/lstm/Read/ReadVariableOp", "StatefulPartitionedCall/model/lstm/PartitionedCall/MatMul_1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/add", "StatefulPartitionedCall/model/lstm/Read_2/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/split", "op": "Split", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/split/split_dim", "StatefulPartitionedCall/model/lstm/PartitionedCall/BiasAdd"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/Sigmoid_1", "StatefulPartitionedCall/model/lstm/zeros_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/Sigmoid", "StatefulPartitionedCall/model/lstm/PartitionedCall/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/mul", "StatefulPartitionedCall/model/lstm/PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/Sigmoid_2", "StatefulPartitionedCall/model/lstm/PartitionedCall/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/zeros_like", "op": "ZerosLike", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while", "op": "StatelessWhile", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/maximum_iterations", "StatefulPartitionedCall/model/lstm/PartitionedCall/time", "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1", "StatefulPartitionedCall/model/lstm/PartitionedCall/zeros_like", "StatefulPartitionedCall/model/lstm/zeros", "StatefulPartitionedCall/model/lstm/zeros_1", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice", "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor", "StatefulPartitionedCall/model/lstm/Read/ReadVariableOp", "StatefulPartitionedCall/model/lstm/Read_1/ReadVariableOp", "StatefulPartitionedCall/model/lstm/Read_2/ReadVariableOp"], "attr": {"cond": {"func": {"name": "__inference_while_cond_77799_2694"}}, "_lower_using_switch_merge": {"b": false}, "_num_original_outputs": {"i": "13"}, "parallel_iterations": {"i": "32"}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "body": {"func": {"name": "__inference_while_body_77800_9697"}}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "256"}]}, {"dim": [{"size": "-1"}, {"size": "256"}]}, {"dim": [{"size": "-1"}, {"size": "256"}]}, {}, {}, {}, {"dim": [{"size": "256"}, {"size": "1024"}]}, {"dim": [{"size": "256"}, {"size": "1024"}]}, {"dim": [{"size": "1024"}]}]}}, "_read_only_resource_inputs": {"list": {}}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while:5", "StatefulPartitionedCall/model/lstm_1/Read_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice_1", "StatefulPartitionedCall/model/lstm_1/Read/ReadVariableOp", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/MatMul_1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/add", "StatefulPartitionedCall/model/lstm_1/Read_2/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/split", "op": "Split", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/split/split_dim", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/BiasAdd"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/Sigmoid_1", "StatefulPartitionedCall/model/lstm/PartitionedCall/while:6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/Sigmoid", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/mul", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/Sigmoid_2", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/zeros_like", "op": "ZerosLike", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while", "op": "StatelessWhile", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/loop_counter", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/maximum_iterations", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/time", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2_1", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/zeros_like", "StatefulPartitionedCall/model/lstm/PartitionedCall/while:5", "StatefulPartitionedCall/model/lstm/PartitionedCall/while:6", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor", "StatefulPartitionedCall/model/lstm_1/Read/ReadVariableOp", "StatefulPartitionedCall/model/lstm_1/Read_1/ReadVariableOp", "StatefulPartitionedCall/model/lstm_1/Read_2/ReadVariableOp"], "attr": {"cond": {"func": {"name": "__inference_while_cond_79364_15713"}}, "_lower_using_switch_merge": {"b": false}, "_num_original_outputs": {"i": "13"}, "parallel_iterations": {"i": "32"}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "body": {"func": {"name": "__inference_while_body_79365_8872"}}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "256"}]}, {"dim": [{"size": "-1"}, {"size": "256"}]}, {"dim": [{"size": "-1"}, {"size": "256"}]}, {}, {}, {}, {"dim": [{"size": "256"}, {"size": "1024"}]}, {"dim": [{"size": "256"}, {"size": "1024"}]}, {"dim": [{"size": "1024"}]}]}}, "_read_only_resource_inputs": {"list": {}}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while:3", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose_2", "op": "Transpose", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose_2/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose_2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/dense/Tensordot/Shape", "StatefulPartitionedCall/model/dense/Tensordot/axes", "StatefulPartitionedCall/model/dense/Tensordot/GatherV2_1/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/dense/Tensordot/Shape", "StatefulPartitionedCall/model/dense/Tensordot/free", "StatefulPartitionedCall/model/dense/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/model/dense/Tensordot/GatherV2_1", "StatefulPartitionedCall/model/dense/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/model/dense/Tensordot/GatherV2", "StatefulPartitionedCall/model/dense/Tensordot/Const"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model/dense/Tensordot/GatherV2", "StatefulPartitionedCall/model/dense/Tensordot/Const_2", "StatefulPartitionedCall/model/dense/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model/dense/Tensordot/Prod", "StatefulPartitionedCall/model/dense/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose_2", "StatefulPartitionedCall/model/dense/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model/dense/Tensordot/Reshape", "StatefulPartitionedCall/model/dense/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model/dense/Tensordot/MatMul", "StatefulPartitionedCall/model/dense/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/dense/Tensordot", "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/dense/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_while_body_79365_8872", "inputArg": [{"name": "while_while_loop_counter", "type": "DT_INT32"}, {"name": "while_while_maximum_iterations", "type": "DT_INT32"}, {"name": "while_placeholder", "type": "DT_INT32"}, {"name": "while_placeholder_1", "type": "DT_VARIANT"}, {"name": "while_placeholder_2", "type": "DT_FLOAT"}, {"name": "while_placeholder_3", "type": "DT_FLOAT"}, {"name": "while_placeholder_4", "type": "DT_FLOAT"}, {"name": "while_strided_slice_0", "type": "DT_INT32"}, {"name": "while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor_0", "type": "DT_VARIANT"}, {"name": "while_tensorarrayv2read_1_tensorlistgetitem_tensorarrayunstack_1_tensorlistfromtensor_0", "type": "DT_VARIANT"}, {"name": "while_matmul_kernel_0", "type": "DT_FLOAT"}, {"name": "while_matmul_1_recurrent_kernel_0", "type": "DT_FLOAT"}, {"name": "while_biasadd_bias_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "while_identity", "type": "DT_INT32"}, {"name": "while_identity_1", "type": "DT_INT32"}, {"name": "while_identity_2", "type": "DT_INT32"}, {"name": "while_identity_3", "type": "DT_VARIANT"}, {"name": "while_identity_4", "type": "DT_FLOAT"}, {"name": "while_identity_5", "type": "DT_FLOAT"}, {"name": "while_identity_6", "type": "DT_FLOAT"}, {"name": "while_strided_slice", "type": "DT_INT32"}, {"name": "while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor", "type": "DT_VARIANT"}, {"name": "while_tensorarrayv2read_1_tensorlistgetitem_tensorarrayunstack_1_tensorlistfromtensor", "type": "DT_VARIANT"}, {"name": "while_matmul_kernel", "type": "DT_FLOAT"}, {"name": "while_matmul_1_recurrent_kernel", "type": "DT_FLOAT"}, {"name": "while_biasadd_bias", "type": "DT_FLOAT"}]}, "nodeDef": [{"name": "__inference_while_body_79365_8872/while/add_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_79365_8872/while/TensorArrayV2Read_1/TensorListGetItem/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_79365_8872/while/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_79365_8872/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_79365_8872/while/add_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "while/MatMul_1", "op": "MatMul", "input": ["while_placeholder_3", "while_matmul_1_recurrent_kernel_0"], "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "while/add_2", "op": "AddV2", "input": ["while_placeholder", "__inference_while_body_79365_8872/while/add_2/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "while/TensorArrayV2Read_1/TensorListGetItem", "op": "TensorListGetItem", "input": ["while_tensorarrayv2read_1_tensorlistgetitem_tensorarrayunstack_1_tensorlistfromtensor_0", "while_placeholder", "__inference_while_body_79365_8872/while/TensorArrayV2Read_1/TensorListGetItem/element_shape:output:0"], "attr": {"element_dtype": {"type": "DT_BOOL"}}}, {"name": "while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor_0", "while_placeholder", "__inference_while_body_79365_8872/while/TensorArrayV2Read/TensorListGetItem/element_shape:output:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "while/add_3", "op": "AddV2", "input": ["while_while_loop_counter", "__inference_while_body_79365_8872/while/add_3/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "while/MatMul", "op": "MatMul", "input": ["while/TensorArrayV2Read/TensorListGetItem:item:0", "while_matmul_kernel_0"], "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "while/add", "op": "AddV2", "input": ["while/MatMul:product:0", "while/MatMul_1:product:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/BiasAdd", "op": "BiasAdd", "input": ["while/add:z:0", "while_biasadd_bias_0"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "while/split", "op": "Split", "input": ["__inference_while_body_79365_8872/while/split/split_dim:output:0", "while/BiasAdd:output:0"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "while/Sigmoid", "op": "Sigmoid", "input": ["while/split:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/Sigmoid_1", "op": "Sigmoid", "input": ["while/split:output:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/Tanh", "op": "Tanh", "input": ["while/split:output:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/Sigmoid_2", "op": "Sigmoid", "input": ["while/split:output:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/mul", "op": "Mul", "input": ["while/Sigmoid_1:y:0", "while_placeholder_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/mul_1", "op": "Mul", "input": ["while/Sigmoid:y:0", "while/Tanh:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/add_1", "op": "AddV2", "input": ["while/mul:z:0", "while/mul_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/Tanh_1", "op": "Tanh", "input": ["while/add_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/SelectV2_2", "op": "SelectV2", "input": ["while/TensorArrayV2Read_1/TensorListGetItem:item:0", "while/add_1:z:0", "while_placeholder_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/mul_2", "op": "Mul", "input": ["while/Sigmoid_2:y:0", "while/Tanh_1:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/SelectV2", "op": "SelectV2", "input": ["while/TensorArrayV2Read_1/TensorListGetItem:item:0", "while/mul_2:z:0", "while_placeholder_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/SelectV2_1", "op": "SelectV2", "input": ["while/TensorArrayV2Read_1/TensorListGetItem:item:0", "while/mul_2:z:0", "while_placeholder_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["while_placeholder_1", "while_placeholder", "while/SelectV2:output:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "resize_if_index_out_of_bounds": {"b": false}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}], "ret": {"while_identity_4": "while/SelectV2:output:0", "while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor": "while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor_0", "while_strided_slice": "while_strided_slice_0", "while_identity_1": "while_while_maximum_iterations", "while_matmul_kernel": "while_matmul_kernel_0", "while_identity_6": "while/SelectV2_2:output:0", "while_biasadd_bias": "while_biasadd_bias_0", "while_matmul_1_recurrent_kernel": "while_matmul_1_recurrent_kernel_0", "while_identity_5": "while/SelectV2_1:output:0", "while_identity_2": "while/add_2:z:0", "while_identity": "while/add_3:z:0", "while_tensorarrayv2read_1_tensorlistgetitem_tensorarrayunstack_1_tensorlistfromtensor": "while_tensorarrayv2read_1_tensorlistgetitem_tensorarrayunstack_1_tensorlistfromtensor_0", "while_identity_3": "while/TensorArrayV2Write/TensorListSetItem:output_handle:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "argAttr": {"5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "256"}]}]}}}}, "11": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "256"}, {"size": "1024"}]}]}}, "_user_specified_name": {"s": "cmVjdXJyZW50X2tlcm5lbA=="}}}, "9": {"attr": {"_output_shapes": {"list": 