{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"inputs_1:0": {"name": "inputs_1:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "20"}]}}, "inputs:0": {"name": "inputs:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "20"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "73"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/add_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Cast_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "39"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack_1/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_2/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "73"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_2/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_2/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_2/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "73"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_dense_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "73"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "20"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inputs_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "20"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/Less", "op": "Less", "input": ["inputs", "StatefulPartitionedCall/functional_1/embedding_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/add", "op": "AddV2", "input": ["inputs", "StatefulPartitionedCall/functional_1/embedding_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/NotEqual_1", "op": "NotEqual", "input": ["inputs", "StatefulPartitionedCall/functional_1/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_2/Less", "op": "Less", "input": ["inputs_1", "StatefulPartitionedCall/functional_1/embedding_1_2/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_2/add", "op": "AddV2", "input": ["inputs_1", "StatefulPartitionedCall/functional_1/embedding_1_2/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/functional_1/embedding_1/Less", "StatefulPartitionedCall/functional_1/embedding_1/add", "inputs"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_1/NotEqual_1", "StatefulPartitionedCall/functional_1/encoder_lstm_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_2/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/functional_1/embedding_1_2/Less", "StatefulPartitionedCall/functional_1/embedding_1_2/add", "inputs_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_1/embedding_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/functional_1/embedding_1/SelectV2", "StatefulPartitionedCall/functional_1/embedding_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/ExpandDims", "StatefulPartitionedCall/functional_1/encoder_lstm_1/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_2/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_1/embedding_1_2/GatherV2/ReadVariableOp", "StatefulPartitionedCall/functional_1/embedding_1_2/SelectV2", "StatefulPartitionedCall/functional_1/embedding_1_2/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_1/embedding_1/GatherV2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/functional_1/embedding_1/GatherV2", "StatefulPartitionedCall/functional_1/encoder_lstm_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack_1/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/transpose_1", "StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack_1/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_BOOL"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_BOOL"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/functional_1/embedding_1_2/GatherV2", "StatefulPartitionedCall/functional_1/decoder_lstm_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/Shape", "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice/stack", "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice/stack_1", "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/transpose", "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice_2/stack", "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice_2/stack_1", "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/transpose", "StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/functional_1/decoder_lstm_1/transpose", "StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice", "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice", "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros/packed", "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_1/packed", "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros", "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Cast_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/add_1/ReadVariableOp", "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/add_1", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice_2", "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/add"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/split", "op": "Split", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/split/split_dim", "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/add_1"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Sigmoid_1", "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Sigmoid", "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/mul", "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Sigmoid_2", "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_like", "op": "ZerosLike", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while", "op": "While", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/loop_counter", "StatefulPartitionedCall/functional_1/encoder_lstm_1/Max", "StatefulPartitionedCall/functional_1/encoder_lstm_1/time", "StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayV2_1", "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_like", "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros", "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_1", "StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack/TensorListFromTensor", "StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack_1/TensorListFromTensor", "unknown_1", "unknown_2", "unknown_3"], "attr": {"_has_manual_control_dependencies": {"b": true}, "cond": {"func": {"name": "__inference_functional_1_encoder_lstm_1_while_cond_138237_frozen_794"}}, "_lower_using_switch_merge": {"b": false}, "parallel_iterations": {"i": "32"}, "_num_original_outputs": {"i": "12"}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_VARIANT", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "body": {"func": {"name": "__inference_functional_1_encoder_lstm_1_while_body_138238_frozen_793"}}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "256"}]}, {"dim": [{"size": "-1"}, {"size": "256"}]}, {"dim": [{"size": "-1"}, {"size": "256"}]}, {}, {}, {"dim": [{"size": "256"}, {"size": "1024"}]}, {"dim": [{"size": "256"}, {"size": "1024"}]}, {"dim": [{"size": "1024"}]}]}}, "_read_only_resource_inputs": {"list": {"i": ["9", "10", "11"]}}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/while", "op": "While", "input": ["StatefulPartitionedCall/functional_1/decoder_lstm_1/while/loop_counter", "StatefulPartitionedCall/functional_1/decoder_lstm_1/Max", "StatefulPartitionedCall/functional_1/decoder_lstm_1/time", "StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayV2_1", "StatefulPartitionedCall/functional_1/encoder_lstm_1/while:5", "StatefulPartitionedCall/functional_1/encoder_lstm_1/while:6", "StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayUnstack/TensorListFromTensor", "unknown_4", "unknown_5", "unknown_6"], "attr": {"_has_manual_control_dependencies": {"b": true}, "cond": {"func": {"name": "__inference_functional_1_decoder_lstm_1_while_cond_138388_frozen_796"}}, "_lower_using_switch_merge": {"b": false}, "_num_original_outputs": {"i": "10"}, "parallel_iterations": {"i": "32"}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "body": {"func": {"name": "__inference_functional_1_decoder_lstm_1_while_body_138389_frozen_795"}}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "256"}]}, {"dim": [{"size": "-1"}, {"size": "256"}]}, {}, {"dim": [{"size": "256"}, {"size": "1024"}]}, {"dim": [{"size": "256"}, {"size": "1024"}]}, {"dim": [{"size": "1024"}]}]}}, "_read_only_resource_inputs": {"list": {"i": ["7", "8", "9"]}}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/functional_1/decoder_lstm_1/while:3", "StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "20"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/functional_1/decoder_lstm_1/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_dense_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_1/decoder_lstm_1/transpose_1", "StatefulPartitionedCall/functional_1/decoder_dense_1/Cast/ReadVariableOp"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_dense_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/decoder_dense_1/MatMul", "StatefulPartitionedCall/functional_1/decoder_dense_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_dense_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_1/decoder_dense_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_1/decoder_dense_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_functional_1_encoder_lstm_1_while_cond_138237_frozen_794", "inputArg": [{"name": "functional_1_encoder_lstm_1_while_functional_1_encoder_lstm_1_while_loop_counter", "type": "DT_INT32"}, {"name": "functional_1_encoder_lstm_1_while_functional_1_encoder_lstm_1_max", "type": "DT_INT32"}, {"name": "functional_1_encoder_lstm_1_while_placeholder", "type": "DT_INT32"}, {"name": "functional_1_encoder_lstm_1_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "functional_1_encoder_lstm_1_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "functional_1_encoder_lstm_1_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "functional_1_encoder_lstm_1_while_placeholder_4", "type": "DT_FLOAT"}, {"name": "functional_1_encoder_lstm_1_while_functional_1_encoder_lstm_1_while_cond_138237___redundant_placeholder0", "type": "DT_VARIANT"}, {"name": "functional_1_encoder_lstm_1_while_functional_1_encoder_lstm_1_while_cond_138237___redundant_placeholder1", "type": "DT_VARIANT"}, {"name": "functional_1_encoder_lstm_1_while_functional_1_encoder_lstm_1_while_cond_138237___redundant_placeholder2", "type": "DT_FLOAT"}, {"name": "functional_1_encoder_lstm_1_while_functional_1_encoder_lstm_1_while_cond_138237___redundant_placeholder3", "type": "DT_FLOAT"}, {"name": "functional_1_encoder_lstm_1_while_functional_1_encoder_lstm_1_while_cond_138237___redundant_placeholder4", "type": "DT_FLOAT"}], "outputArg": [{"name": "functional_1_encoder_lstm_1_while_identity", "type": "DT_BOOL"}]}, "nodeDef": [{"name": "__inference_functional_1_encoder_lstm_1_while_cond_138237_frozen_794/functional_1/encoder_lstm_1/while/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "functional_1/encoder_lstm_1/while/Less_1", "op": "Less", "input": ["functional_1_encoder_lstm_1_while_functional_1_encoder_lstm_1_while_loop_counter", "functional_1_encoder_lstm_1_while_functional_1_encoder_lstm_1_max"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "functional_1/encoder_lstm_1/while/Less", "op": "Less", "input": ["functional_1_encoder_lstm_1_while_placeholder", "__inference_functional_1_encoder_lstm_1_while_cond_138237_frozen_794/functional_1/encoder_lstm_1/while/Less/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "functional_1/encoder_lstm_1/while/LogicalAnd", "op": "LogicalAnd", "input": ["functional_1/encoder_lstm_1/while/Less_1:z:0", "functional_1/encoder_lstm_1/while/Less:z:0"]}], "ret": {"functional_1_encoder_lstm_1_while_identity": "functional_1/encoder_lstm_1/while/LogicalAnd:z:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "argAttr": {"0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}, "_user_specified_name": {"s": "ZnVuY3Rpb25hbF8xL2VuY29kZXJfbHN0bV8xL3doaWxlL2xvb3BfY291bnRlcg=="}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}, "_user_specified_name": {"s": "ZnVuY3Rpb25hbF8xL2VuY29kZXJfbHN0bV8xL01heA=="}}}, "7": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "256"}]}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "256"}]}]}}}}, "8": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "256"}]}]}}}}}}, {"signature": {"name": "__inference_functional_1_decoder_lstm_1_while_body_138389_frozen_795", "inputArg": [{"name": "functional_1_decoder_lstm_1_while_functional_1_decoder_lstm_1_while_loop_counter", "type": "DT_INT32"}, {"name": "functional_1_decoder_lstm_1_while_functional_1_decoder_lstm_1_max", "type": "DT_INT32"}, {"name": "functional_1_decoder_lstm_1_while_placeholder", "type": "DT_INT32"}, {"name": "functional_1_decoder_lstm_1_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "functional_1_decoder_lstm_1_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "functional_1_decoder_lstm_1_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "functional_1_decoder_lstm_1_while_tensorarrayv2read_tensorlistgetitem_functional_1_decoder_lstm_1_tensorarrayunstack_tensorlistfromtensor_0", "type": "DT_VARIANT"}, {"name": "functional_1_decoder_lstm_1_while_lstm_cell_1_cast_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "functional_1_decoder_lstm_1_while_lstm_cell_1_cast_1_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "functional_1_decoder_lstm_1_while_lstm_cell_1_add_1_readvariableop_resource_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "functional_1_decoder_lstm_1_while_identity", "type": "DT_INT32"}, {"name": "functional_1_decoder_lstm_1_while_identity_1", "type": "DT_INT32"}, {"name": "functional_1_decoder_lstm_1_while_identity_2", "type": "DT_INT32"}, {"name": "functional_1_decoder_lstm_1_while_identity_3", "type": "DT_VARIANT"}, {"name": "functional_1_decoder_lstm_1_while_identity_4", "type": "DT_FLOAT"}, {"name": "functional_1_decoder_lstm_1_while_identity_5", "type": "DT_FLOAT"}, {"name": "functional_1_decoder_lstm_1_while_tensorarrayv2read_tensorlistgetitem_functional_1_decoder_lstm_1_tensorarrayunstack_tensorlistfromtensor", "type": "DT_VARIANT"}, {"name": "functional_1_decoder_lstm_1_while_lstm_cell_1_cast_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "functional_1_decoder_lstm_1_while_lstm_cell_1_cast_1_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "functional_1_decoder_lstm_1_while_lstm_cell_1_add_1_readvariableop_resource", "type": "DT_FLOAT"}], "isStateful": true, "controlOutput": ["functional_1/decoder_lstm_1/while/lstm_cell_1/Cast/ReadVariableOp", "functional_1/decoder_lstm_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "functional_1/decoder_lstm_1/while/lstm_cell_1/add_1/ReadVariableOp"]}, "nodeDef": [{"name": "__inference_functional_1_decoder_lstm_1_while_body_138389_frozen_795/functional_1/decoder_lstm_1/while/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_functional_1_decoder_lstm_1_while_body_138389_frozen_795/functional_1/decoder_lstm_1/while/lstm_cell_1/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_functional_1_decoder_lstm_1_while_body_138389_frozen_795/functional_1/decoder_lstm_1/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_functional_1_decoder_lstm_1_while_body_138389_frozen_795/functional_1/decoder_lstm_1/while/add_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "functional_1/decoder_lstm_1/while/lstm_cell_1/Cast/ReadVariableOp", "op": "Identity", "input": ["functional_1_decoder_lstm_1_while_lstm_cell_1_cast_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "functional_1/decoder_lstm_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "op": "Identity", "input": ["functional_1_decoder_lstm_1_while_lstm_cell_1_cast_1_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "functional_1/decoder_lstm_1/while/lstm_cell_1/add_1/ReadVariableOp", "op": "Identity", "input": ["functional_1_decoder_lstm_1_while_lstm_cell_1_add_1_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "functional_1/decoder_lstm_1/while/add", "op": "AddV2", "input": ["functional_1_decoder_lstm_1_while_placeholder", "__inference_functional_1_decoder_lstm_1_while_body_138389_frozen_795/functional_1/decoder_lstm_1/while/add/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "functional_1/decoder_lstm_1/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["functional_1_decoder_lstm_1_while_tensorarrayv2read_tensorlistgetitem_functional_1_decoder_lstm_1_tensorarrayunstack_tensorlistfromtensor_0", "functional_1_decoder_lstm_1_while_placeholder", "__inference_functional_1_decoder_lstm_1_while_body_138389_frozen_795/functional_1/decoder_lstm_1/while/TensorArrayV2Read/TensorListGetItem/element_shape:output:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "functional_1/decoder_lstm_1/while/add_1", "op": "AddV2", "input": ["functional_1_decoder_lstm_1_while_functional_1_decoder_lstm_1_while_loop_counter", "__inference_functional_1_decoder_lstm_1_while_body_138389_frozen_795/functional_1/decoder_lstm_1/while/add_1/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "functional_1/decoder_lstm_1/while/lstm_cell_1/MatMul_1", "op": "MatMul", "input": ["functional_1_decoder_lstm_1_while_placeholder_2", "functional_1/decoder_lstm_1/while/lstm_cell_1/Cast_1/ReadVariableOp:output:0"], "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "functional_1/decoder_lstm_1/while/NoOp", "op": "NoOp", "input": ["^functional_1/decoder_lstm_1/while/lstm_cell_1/Cast/ReadVariableOp", "^functional_1/decoder_lstm_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "^functional_1/decoder_lstm_1/while/lstm_cell_1/add_1/ReadVariableOp"]}, {"name": "functional_1/decoder_lstm_1/while/lstm_cell_1/MatMul", "op": "MatMul", "input": ["functional_1/decoder_lstm_1/while/TensorArrayV2Read/TensorListGetItem:item:0", "functional_1/decoder_lstm_1/while/lstm_cell_1/Cast/ReadVariableOp:output:0"], "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "functional_1/decoder_lstm_1/while/Identity_1", "op": "Identity", "input": ["functional_1_decoder_lstm_1_while_functional_1_decoder_lstm_1_max", "^functional_1/decoder_lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "functional_1/decoder_lstm_1/while/Identity_2", "op": "Identity", "input": ["functional_1/decoder_lstm_1/while/add:z:0", "^functional_1/decoder_lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "functional_1/decoder_lstm_1/while/Identity", "op": "Identity", "input": ["functional_1/decoder_lstm_1/while/add_1:z:0", "^functional_1/decoder_lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "functional_1/decoder_lstm_1/while/lstm_cell_1/add", "op": "AddV2", "input": ["functional_1/decoder_lstm_1/while/lstm_cell_1/MatMul:product:0", "functional_1/decoder_lstm_1/while/lstm_cell_1/MatMul_1:product:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "functional_1/decoder_lstm_1/while/lstm_cell_1/add_1", "op": "AddV2", "input": ["functional_1/decoder_lstm_1/while/lstm_cell_1/add:z:0", "functional_1/decoder_lstm_1/while/lstm_cell_1/add_1/ReadVariableOp:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "functional_1/decoder_lstm_1/while/lstm_cell_1/split", "op": "Split", "input": ["__inference_functional_1_decoder_lstm_1_while_body_138389_frozen_795/functional_1/decoder_lstm_1/while/lstm_cell_1/split/split_dim:output:0", "functional_1/decoder_lstm_1/while/lstm_cell_1/add_1:z:0"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "functional_1/decoder_lstm_1/while/lstm_cell_1/Sigmoid", "op": "Sigmoid", "input": ["functional_1/decoder_lstm_1/while/lstm_cell_1/split:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "functional_1/decoder_lstm_1/while/lstm_cell_1/Sigmoid_1", "op": "Sigmoid", "input": ["functional_1/decoder_lstm_1/while/lstm_cell_1/split:output:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "functional_1/decoder_lstm_1/while/lstm_cell_1/Tanh", "op": "Tanh", "input": ["functional_1/decoder_lstm_1/while/lstm_cell_1/split:output:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "functional_1/decoder_lstm_1/while/lstm_cell_1/Sigmoid_2", "op": "Sigmoid", "input": ["functional_1/decoder_lstm_1/while/lstm_cell_1/split:output:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "functional_1/decoder_lstm_1/while/lstm_cell_1/mul", "op": "Mul", "input": ["functional_1/decoder_lstm_1/while/lstm_cell_1/Sigmoid_1:y:0", "functional_1_decoder_lstm_1_while_placeholder_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "functional_1/decoder_lstm_1/while/lstm_cell_1/mul_1", "op": "Mul", "input": ["functional_1/decoder_lstm_1/while/lstm_cell_1/Sigmoid:y:0", "functional_1/decoder_lstm_1/while/lstm_cell_1/Tanh:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "functional_1/decoder_lstm_1/while/lstm_cell_1/add_2", "op": "AddV2", "input": ["functional_1/decoder_lstm_1/while/lstm_cell_1/mul:z:0", "functional_1/decoder_lstm_1/while/lstm_cell_1/mul_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "functional_1/decoder_lstm_1/while/lstm_cell_1/Tanh_1", "op": "Tanh", "input": ["functional_1/decoder_lstm_1/while/lstm_cell_1/add_2:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "functional_1/decoder_lstm_1/while/Identity_5", "op": "Identity", "input": ["functional_1/decoder_lstm_1/while/lstm_cell_1/add_2:z:0", "^functional_1/decoder_lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "functional_1/decoder_lstm_1/while/lstm_cell_1/mul_2", "op": "Mul", "input": ["functional_1/decoder_lstm_1/while/lstm_cell_1/Sigmoid_2:y:0", "functional_1/decoder_lstm_1/while/lstm_cell_1/Tanh_1:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "functional_1/decoder_lstm_1/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["functional_1_decoder_lstm_1_while_placeholder_1", "functional_1_decoder_lstm_1_while_placeholder", "functional_1/decoder_lstm_1/while/lstm_cell_1/mul_2:z:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "resize_if_index_out_of_bounds": {"b": false}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "functional_1/decoder_lstm_1/while/Identity_4", "op": "Identity", "input": ["functional_1/decoder_lstm_1/while/lstm_cell_1/mul_2:z:0", "^functional_1/decoder_lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "functional_1/decoder_lstm_1/while/Identity_3", "op": "Identity", "input": ["functional_1/decoder_lstm_1/while/TensorArrayV2Write/TensorListSetItem:output_handle:0", "^functional_1/decoder_lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_VARIANT"}}}], "ret": {"functional_1_decoder_lstm_1_while_identity_1": "functional_1/decoder_lstm_1/while/Identity_1:output:0", "functional_1_decoder_lstm_1_while_identity_5": "functional_1/decoder_lstm_1/while/Identity_5:output:0", "functional_1_decoder_lstm_1_while_lstm_cell_1_cast_1_readvariableop_resource": "functional_1_decoder_lstm_1_while_lstm_cell_1_cast_1_readvariableop_resource_0", "functional_1_decoder_lstm_1_while_identity_3": "functional_1/decoder_lstm_1/while/Identity_3:output:0", "functional_1_decoder_lstm_1_while_lstm_cell_1_add_1_readvariableop_resource": "functional_1_decoder_lstm_1_while_lstm_cell_1_add_1_readvariableop_resource_0", "functional_1_decoder_lstm_1_while_identity": "functional_1/decoder_lstm_1/while/Identity:output:0", "functional_1_decoder_lstm_1_while_lstm_cell_1_cast_readvariableop_resource": "functional_1_decoder_lstm_1_while_lstm_cell_1_cast_readvariableop_resource_0", "functional_1_decoder_lstm_1_while_identity_2": "functional_1/decoder_lstm_1/while/Identity_2:output:0", "functional_1_decoder_lstm_1_while_identity_4": "functional_1/decoder_lstm_1/while/Identity_4:output:0", "functional_1_decoder_lstm_1_while_tensorarrayv2read_tensorlistgetitem_functional_1_decoder_lstm_1_tensorarrayunstack_tensorlistfromtensor": "functional_1_decoder_lstm_1_while_tensorarrayv2read_tensorlistgetitem_functional_1_decoder_lstm_1_tensorarrayunstack_tensorlistfromtensor_0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "controlRet": {"functional_1/decoder_lstm_1/while/lstm_cell_1/add_1/ReadVariableOp": "functional_1/decoder_lstm_1/while/lstm_cell_1/add_1/ReadVariableOp", "functional_1/decoder_lstm_1/while/lstm_cell_1/Cast/ReadVariableOp": "functional_1/decoder_lstm_1/while/lstm_cell_1/Cast/ReadVariableOp", "functional_1/decoder_lstm_1/while/lstm_cell_1/Cast_1/ReadVariableOp": "functional_1/decoder_lstm_1/while/lstm_cell_1/Cast_1/ReadVariableOp"}, "argAttr": {"9": {"attr": {"_user_specified_name": {"s": "cmVzb3VyY2U="}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}, "_user_specified_name": {"s": "ZnVuY3Rpb25hbF8xL2RlY29kZXJfbHN0bV8xL3doaWxlL2xvb3BfY291bnRlcg=="}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}, "_user_specified_name": {"s": "ZnVuY3Rpb25hbF8xL2RlY29kZXJfbHN0bV8xL01heA=="}}}, "7": {"attr": {"_user_specified_name": {"s": "cmVzb3VyY2U="}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}, "_user_specified_name": {"s": "ZnVuY3Rpb25hbF8xL2RlY29kZXJfbHN0bV8xL1RlbnNvckFycmF5VW5zdGFjay9UZW5zb3JMaXN0RnJvbVRlbnNvcg=="}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "256"}]}]}}}}, "8": {"attr": {"_user_specified_name": {"s": "cmVzb3VyY2U="}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "256"}]}]}}}}}}, {"signature": {"name": "__inference_functional_1_encoder_lstm_1_while_body_138238_frozen_793", "inputArg": [{"name": "functional_1_encoder_lstm_1_while_functional_1_encoder_lstm_1_while_loop_counter", "type": "DT_INT32"}, {"name": "functional_1_encoder_lstm_1_while_functional_1_encoder_lstm_1_max", "type": "DT_INT32"}, {"name": "functional_1_encoder_lstm_1_while_placeholder", "type": "DT_INT32"}, {"name": "functional_1_encoder_lstm_1_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "functional_1_encoder_lstm_1_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "functional_1_encoder_lstm_1_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "functional_1_encoder_lstm_1_while_placeholder_4", "type": "DT_FLOAT"}, {"name": "functional_1_encoder_lstm_1_while_tensorarrayv2read_tensorlistgetitem_functional_1_encoder_lstm_1_tensorarrayunstack_tensorlistfromtensor_0", "type": "DT_VARIANT"}, {"name": "functional_1_encoder_lstm_1_while_tensorarrayv2read_1_tensorlistgetitem_functional_1_encoder_lstm_1_tensorarrayunstack_1_tensorlistfromtensor_0", "type": "DT_VARIANT"}, {"name": "functional_1_encoder_lstm_1_while_lstm_cell_1_cast_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "functional_1_encoder_lstm_1_while_lstm_cell_1_cast_1_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "functional_1_encoder_lstm_1_while_lstm_cell_1_add_1_readvariableop_resource_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "functional_1_encoder_lstm_1_while_identity", "type": "DT_INT32"}, {"name": "functional_1_encoder_lstm_1_while_identity_1", "type": "DT_INT32"}, {"name": "functional_1_encoder_lstm_1_while_identity_2", "type": "DT_INT32"}, {"name": "functional_1_encoder_lstm_1_while_identity_3", "type": "DT_VARIANT"}, {"name": "functional_1_encoder_lstm_1_while_identity_4", "type": "DT_FLOAT"}, {"name": "functional_1_encoder_lstm_1_while_identity_5", "type": "DT_FLOAT"}, {"name": "functional_1_encoder_lstm_1_while_identity_6", "type": "DT_FLOAT"}, {"name": "functional_1_encoder_lstm_1_while_tensorarrayv2read_tensorlistgetitem_functional_1_encoder_lstm_1_tensorarrayunstack_tensorlistfromtensor", "type": "DT_VARIANT"}, {"name": "functional_1_encoder_lstm_1_while_tensorarrayv2read_1_tensorlistgetitem_functional_1_encoder_lstm_1_tensorarrayunstack_1_tensorlistfromtensor", "type": "DT_VARIANT"}, {"name": "functional_1_encoder_lstm_1_while_lstm_cell_1_cast_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "functional_1_encoder_lstm_1_while_lstm_cell_1_cast_1_readvariableop_resource", "type": "DT_FLOAT"}, {"name": 