{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"inputs_1:0": {"name": "inputs_1:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "20"}]}}, "inputs:0": {"name": "inputs:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "20"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "73"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "73"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_dense_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "73"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_2/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "73"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_2/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_2/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_2/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack_1/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/add_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Cast_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "39"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "20"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inputs_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "20"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_1/NotEqual_1", "op": "NotEqual", "input": ["inputs", "StatefulPartitionedCall/functional_1/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/Less", "op": "Less", "input": ["inputs", "StatefulPartitionedCall/functional_1/embedding_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/add", "op": "AddV2", "input": ["inputs", "StatefulPartitionedCall/functional_1/embedding_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_2/Less", "op": "Less", "input": ["inputs_1", "StatefulPartitionedCall/functional_1/embedding_1_2/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_2/add", "op": "AddV2", "input": ["inputs_1", "StatefulPartitionedCall/functional_1/embedding_1_2/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_1/NotEqual_1", "StatefulPartitionedCall/functional_1/encoder_lstm_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/functional_1/embedding_1/Less", "StatefulPartitionedCall/functional_1/embedding_1/add", "inputs"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_2/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/functional_1/embedding_1_2/Less", "StatefulPartitionedCall/functional_1/embedding_1_2/add", "inputs_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/ExpandDims", "StatefulPartitionedCall/functional_1/encoder_lstm_1/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_1/embedding_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/functional_1/embedding_1/SelectV2", "StatefulPartitionedCall/functional_1/embedding_1/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_2/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_1/embedding_1_2/GatherV2/ReadVariableOp", "StatefulPartitionedCall/functional_1/embedding_1_2/SelectV2", "StatefulPartitionedCall/functional_1/embedding_1_2/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack_1/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/transpose_1", "StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack_1/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_BOOL"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_BOOL"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_1/embedding_1/GatherV2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/functional_1/embedding_1/GatherV2", "StatefulPartitionedCall/functional_1/encoder_lstm_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/functional_1/embedding_1_2/GatherV2", "StatefulPartitionedCall/functional_1/decoder_lstm_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/Shape", "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice/stack", "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice/stack_1", "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/transpose", "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice_2/stack", "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice_2/stack_1", "StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/transpose", "StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/functional_1/decoder_lstm_1/transpose", "StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice", "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice", "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_1/packed", "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_1/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros/packed", "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros", "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Cast_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/add_1/ReadVariableOp", "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/add_1", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/strided_slice_2", "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/add"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/split", "op": "Split", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/split/split_dim", "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/add_1"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Sigmoid_1", "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Sigmoid", "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/mul", "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Sigmoid_2", "StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_like", "op": "ZerosLike", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/lstm_cell_1/mul_2"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/LoopControlInputs/_28", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack_1/TensorListFromTensor", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayV2_1", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_like", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack/TensorListFromTensor"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_22", "op": "Enter", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_1", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xL2VuY29kZXJfbHN0bV8xL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_24", "op": "Enter", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack_1/TensorListFromTensor", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xL2VuY29kZXJfbHN0bV8xL3doaWxl"}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_17", "op": "Enter", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/Max", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xL2VuY29kZXJfbHN0bV8xL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_19", "op": "Enter", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayV2_1", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xL2VuY29kZXJfbHN0bV8xL3doaWxl"}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_16", "op": "Enter", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/loop_counter", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xL2VuY29kZXJfbHN0bV8xL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_20", "op": "Enter", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_like", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xL2VuY29kZXJfbHN0bV8xL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_21", "op": "Enter", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xL2VuY29kZXJfbHN0bV8xL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_23", "op": "Enter", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xL2VuY29kZXJfbHN0bV8xL3doaWxl"}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_18", "op": "Enter", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/time", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xL2VuY29kZXJfbHN0bV8xL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_25", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_4", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xL2VuY29kZXJfbHN0bV8xL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_26", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_5", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xL2VuY29kZXJfbHN0bV8xL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_27", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_6", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xL2VuY29kZXJfbHN0bV8xL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_35", "op": "Merge", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_22", "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/next_iteration/_65"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_37", "op": "Merge", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_24", "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/next_iteration/_67"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_30", "op": "Merge", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_17", "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/next_iteration/_60"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_32", "op": "Merge", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_19", "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/next_iteration/_62"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_29", "op": "Merge", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_16", "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/next_iteration/_59"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_33", "op": "Merge", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_20", "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/next_iteration/_63"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_34", "op": "Merge", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_21", "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/next_iteration/_64"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_36", "op": "Merge", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_23", "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/next_iteration/_66"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_31", "op": "Merge", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_18", "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/next_iteration/_61"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/functional_1/encoder_lstm_1/while/cond/_14/input_control_node/_112", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_25", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_26", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_27", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_29", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_30", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_31", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_32", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_33", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_34", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_35", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_36", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_37"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/cond/_14/functional_1/encoder_lstm_1/while/Less_1", "op": "Less", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_29", "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_30", "^Func/StatefulPartitionedCall/functional_1/encoder_lstm_1/while/cond/_14/input_control_node/_112"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/cond/_14/functional_1/encoder_lstm_1/while/Less/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_1/encoder_lstm_1/while/cond/_14/input_control_node/_112"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/cond/_14/functional_1/encoder_lstm_1/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_31", "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/cond/_14/functional_1/encoder_lstm_1/while/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/cond/_14/functional_1/encoder_lstm_1/while/LogicalAnd", "op": "LogicalAnd", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/cond/_14/functional_1/encoder_lstm_1/while/Less_1", "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/cond/_14/functional_1/encoder_lstm_1/while/Less"]}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/LoopCond/_38", "op": "LoopCond", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/cond/_14/functional_1/encoder_lstm_1/while/LogicalAnd"]}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/Max_switch/_40", "op": "Switch", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_30", "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/LoopCond/_38"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayV2_1_switch/_42", "op": "Switch", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_32", "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/LoopCond/_38"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/while/loop_counter_switch/_39", "op": "Switch", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_29", "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/LoopCond/_38"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_like_switch/_43", "op": "Switch", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_33", "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/LoopCond/_38"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack_1/TensorListFromTensor_switch/_47", "op": "Switch", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_37", "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/LoopCond/_38"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack/TensorListFromTensor_switch/_46", "op": "Switch", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_36", "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/LoopCond/_38"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/time_switch/_41", "op": "Switch", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_31", "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/LoopCond/_38"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_switch/_44", "op": "Switch", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_34", "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/LoopCond/_38"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_1_switch/_45", "op": "Switch", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/merge/_35", "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/LoopCond/_38"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/exit/_50", "op": "Exit", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/Max_switch/_40"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/exit/_52", "op": "Exit", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayV2_1_switch/_42"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/exit/_49", "op": "Exit", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/while/loop_counter_switch/_39"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/loop_body_control/_48", "op": "Identity", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/while/loop_counter_switch/_39:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/exit/_53", "op": "Exit", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_like_switch/_43"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/exit/_57", "op": "Exit", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack_1/TensorListFromTensor_switch/_47"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/exit/_56", "op": "Exit", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack/TensorListFromTensor_switch/_46"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/exit/_51", "op": "Exit", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/time_switch/_41"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/exit/_54", "op": "Exit", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_switch/_44"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/exit/_55", "op": "Exit", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_1_switch/_45"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/functional_1/encoder_lstm_1/while/body/_15/input_control_node/_126", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/Max_switch/_40", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack/TensorListFromTensor_switch/_46", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayUnstack_1/TensorListFromTensor_switch/_47", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/TensorArrayV2_1_switch/_42", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/time_switch/_41", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/loop_body_control/_48", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_1_switch/_45", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_like_switch/_43", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/zeros_switch/_44", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_25", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_26", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_27"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/decoder_lstm_1/while/LoopControlInputs/_80", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/functional_1/decoder_lstm_1/TensorArrayV2_1", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/exit/_54", "^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/exit/_55"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/body/_15/functional_1/encoder_lstm_1/while/TensorArrayV2Write/TensorListSetItem/index", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_1/encoder_lstm_1/while/body/_15/input_control_node/_126"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/body/_15/functional_1/encoder_lstm_1/while/add_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_1/encoder_lstm_1/while/body/_15/input_control_node/_126"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/body/_15/functional_1/encoder_lstm_1/while/TensorArrayV2Read_1/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_1/encoder_lstm_1/while/body/_15/input_control_node/_126"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/body/_15/functional_1/encoder_lstm_1/while/lstm_cell_1/split/split_dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_1/encoder_lstm_1/while/body/_15/input_control_node/_126"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/body/_15/functional_1/encoder_lstm_1/while/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_1/encoder_lstm_1/while/body/_15/input_control_node/_126"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/functional_1/encoder_lstm_1/while/body/_15/input/_129", "op": "Identity", "input": ["StatefulPartitionedCall/functional_1/encoder_lstm_1/while/StatefulPartitionedCall/functional_1/encoder_lstm_1/time_switch/_41:1", "^Func/StatefulPartitionedCall/functional_1/encoder_lstm_1/while/body/_15/input_control_node/_126"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/body/_15/functional_1/encoder_lstm_1/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_1/encoder_lstm_1/while/body/_15/input_control_node/_126"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/body/_15/functional_1/encoder_lstm_1/while/lstm_cell_1/Cast/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_25", "^Func/StatefulPartitionedCall/functional_1/encoder_lstm_1/while/body/_15/input_control_node/_126"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/encoder_lstm_1/while/body/_15/functional_1/encoder_lstm_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/functional_1/encoder_lstm_1/while/enter/_26", "^Func/StatefulPartitionedCall/functional_1/encoder_lstm_1/while/body/_15/input_control_node/_126"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": 