{"class_name": "Tokenizer", "config": {"num_words": null, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": null, "document_count": 19313, "word_counts": "{\"\\u00bferes\": 381, \"mayor\": 16, \"que\": 3900, \"yo\": 244, \"eres\": 1511, \"una\": 766, \"beb\\u00e9\": 7, \"dime\": 1035, \"cu\\u00e1l\": 273, \"es\": 1422, \"tu\": 1078, \"edad\": 9, \"di\": 669, \"si\": 661, \"un\": 1274, \"chiquit\\u00edn\": 5, \"peque\\u00f1a\": 10, \"\\u00bfvas\": 108, \"a\": 1012, \"celebrar\": 7, \"cumple\": 31, \"\\u00bfqu\\u00e9\": 770, \"regalo\": 14, \"te\": 1724, \"has\": 160, \"pedido\": 10, \"para\": 388, \"cumplea\\u00f1os\": 32, \"vieja\": 10, \"\\u00bfpiensas\": 73, \"invitarme\": 2, \"renacuaja\": 4, \"d\\u00ednos\": 5, \"cu\\u00e1ndo\": 6, \"est\\u00e1s\": 594, \"hecho\": 32, \"viejo\": 10, \"cu\\u00e1ntos\": 21, \"a\\u00f1os\": 10, \"tienes\": 548, \"tus\": 166, \"\\u00bfcelebras\": 2, \"\\u00bfte\": 1039, \"gusta\": 273, \"pareces\": 66, \"\\u00bfme\": 117, \"vas\": 76, \"invitar\": 8, \"ni\\u00f1a\": 18, \"\\u00bfcu\\u00e1ndo\": 13, \"m\\u00e1s\": 1241, \"joven\": 11, \"espero\": 4, \"me\": 2048, \"invites\": 5, \"qu\\u00e9\": 1421, \"peque\\u00f1o\": 11, \"menor\": 8, \"\\u00bfnos\": 61, \"cr\\u00eda\": 2, \"cr\\u00edo\": 2, \"vejestorio\": 3, \"ni\\u00f1o\": 20, \"por\": 396, \"quieres\": 186, \"quiero\": 841, \"\\u00bfcu\\u00e1ntos\": 16, \"fiesta\": 14, \"de\": 2836, \"hacer\": 219, \"regale\": 1, \"\\u00bfa\": 38, \"ir\": 150, \"hecha\": 12, \"\\u00bftienes\": 161, \"celebras\": 4, \"naciste\": 5, \"d\\u00eda\": 131, \"\\u00bfen\": 24, \"mes\": 63, \"\\u00bfcu\\u00e1l\": 235, \"dices\": 46, \"cuantos\": 1, \"fue\": 1, \"a\\u00f1o\": 32, \"nacimiento\": 1, \"yogur\\u00edn\": 6, \"chaval\\u00edn\": 1, \"chavalina\": 1, \"chavalillo\": 1, \"chavalilla\": 1, \"soy\": 460, \"t\\u00fa\": 124, \"viejecito\": 1, \"viejecita\": 1, \"digas\": 133, \"en\": 1275, \"peque\\u00f1aja\": 5, \"teenager\": 3, \"adolescente\": 3, \"viejoven\": 4, \"peque\": 7, \"bebito\": 5, \"bebecita\": 4, \"chiquitina\": 5, \"peque\\u00f1ajo\": 5, \"preadolescente\": 3, \"chiquitilla\": 4, \"bebecito\": 4, \"renacuajo\": 5, \"chiquitillo\": 4, \"chico\": 46, \"inv\\u00edtame\": 2, \"bebita\": 4, \"chica\": 46, \"yogurina\": 2, \"muy\": 766, \"hazme\": 7, \"la\": 1319, \"pregunta\": 78, \"mill\\u00f3n\": 8, \"gustar\\u00eda\": 335, \"saber\": 272, \"m\\u00ed\": 271, \"lo\": 584, \"sea\": 72, \"hacerme\": 71, \"alguna\": 107, \"acerca\": 19, \"preg\\u00fantame\": 17, \"cosas\": 44, \"preguntas\": 45, \"\\u00bfpor\": 108, \"no\": 603, \"nada\": 69, \"\\u00bfquieres\": 120, \"preguntarme\": 18, \"algo\": 551, \"el\": 1098, \"\\u00fanico\": 4, \"haciendo\": 28, \"solo\": 39, \"hago\": 8, \"sobre\": 454, \"hace\": 12, \"\\u00fanica\": 3, \"pregunto\": 35, \"cosa\": 27, \"preguntar\": 30, \"\\u00bfpuedo\": 30, \"contarte\": 2, \"puedo\": 49, \"cuente\": 3, \"\\u00bfalguna\": 3, \"\\u00bfhay\": 60, \"quieras\": 20, \"puedes\": 338, \"apetezca\": 3, \"haz\": 44, \"preguntes\": 7, \"s\\u00e9\": 134, \"serio\": 13, \"favor\": 80, \"hagas\": 4, \"\\u00bfno\": 26, \"venga\": 32, \"mi\": 466, \"persona\": 49, \"del\": 233, \"interesa\": 39, \"deseando\": 5, \"cositas\": 1, \"\\u00bfpuedes\": 229, \"tirarte\": 8, \"pedo\": 4, \"p\\u00f3mulos\": 3, \"manos\": 102, \"piel\": 3, \"o\\u00eddos\": 3, \"bostezar\": 4, \"andar\": 4, \"beber\": 4, \"coraz\\u00f3n\": 45, \"respirar\": 4, \"pedos\": 5, \"\\u00bftoses\": 1, \"defecar\": 4, \"tragar\": 4, \"masticar\": 4, \"gatear\": 4, \"caca\": 5, \"saltar\": 11, \"orinar\": 4, \"sudar\": 4, \"hacerte\": 23, \"da\\u00f1o\": 6, \"comer\": 66, \"estornudar\": 4, \"correr\": 13, \"llorar\": 8, \"ba\\u00f1o\": 5, \"\\u00bfvomitas\": 1, \"morder\": 4, \"sonre\\u00edr\": 9, \"so\\u00f1ar\": 10, \"toser\": 4, \"vomitar\": 8, \"eructar\": 4, \"pis\": 5, \"caminar\": 8, \"\\u00bforinas\": 1, \"al\": 175, \"\\u00bfhaces\": 3, \"\\u00bfbostezas\": 1, \"\\u00bfbebes\": 1, \"caminas\": 1, \"\\u00bfsudas\": 1, \"dinos\": 237, \"ojos\": 3, \"pulmones\": 3, \"nariz\": 3, \"orejas\": 4, \"mejillas\": 3, \"tiras\": 3, \"pedetes\": 1, \"\\u00bfeructas\": 1, \"\\u00bfcorres\": 1, \"\\u00bfandas\": 1, \"\\u00bfcaminas\": 1, \"\\u00bfsaltas\": 1, \"\\u00bfmasticas\": 1, \"eructos\": 1, \"\\u00bfgateas\": 1, \"\\u00bfrespiras\": 1, \"\\u00bflloras\": 1, \"\\u00bfr\\u00edes\": 1, \"\\u00bfsue\\u00f1as\": 1, \"\\u00bfduermes\": 1, \"\\u00bfdefecas\": 1, \"dientes\": 8, \"vejiga\": 2, \"sistema\": 7, \"digestivo\": 3, \"nervioso\": 2, \"respiratorio\": 2, \"columna\": 2, \"vertebral\": 2, \"pene\": 2, \"pito\": 2, \"cerebro\": 2, \"\\u00fatero\": 2, \"esqueleto\": 2, \"uretra\": 2, \"vagina\": 2, \"vulva\": 2, \"me\\u00f1iques\": 3, \"mofletes\": 3, \"laringe\": 3, \"faringe\": 3, \"labios\": 3, \"codos\": 4, \"cr\\u00e1neo\": 2, \"pulgares\": 3, \"pecas\": 3, \"tibia\": 3, \"peron\\u00e9\": 3, \"u\\u00f1as\": 3, \"om\\u00f3platos\": 3, \"esc\\u00e1pulas\": 3, \"costillas\": 3, \"rodillas\": 3, \"es\\u00f3fago\": 3, \"huesos\": 7, \"m\\u00fasculos\": 3, \"lengua\": 3, \"est\\u00f3mago\": 14, \"intestino\": 3, \"ri\\u00f1ones\": 3, \"p\\u00e1ncreas\": 3, \"brazos\": 3, \"extremidades\": 3, \"piernas\": 3, \"pies\": 3, \"muslos\": 3, \"dedos\": 3, \"pelo\": 13, \"\\u00bfcomes\": 14, \"muermo\": 17, \"rollazo\": 6, \"\\u00bfsab\\u00edas\": 36, \"plasta\": 20, \"pelma\": 13, \"aburrid\\u00edsimo\": 33, \"\\u00bfsabes\": 268, \"cansino\": 23, \"co\\u00f1azo\": 19, \"chapas\": 19, \"pe\\u00f1azo\": 11, \"mira\": 18, \"pesada\": 13, \"menudo\": 14, \"menuda\": 14, \"cansina\": 23, \"aburres\": 9, \"vaya\": 37, \"chapa\": 7, \"aburro\": 1, \"pip\\u00ed\": 1, \"caballito\": 1, \"estas\": 2, \"aburriendo\": 3, \"todo\": 31, \"das\": 12, \"grande\": 10, \"rayada\": 3, \"rallada\": 3, \"m\\u00e1ximo\": 1, \"q\": 19, \"aburrida\": 85, \"aburrido\": 85, \"rayado\": 1, \"rallando\": 1, \"rayas\": 1, \"rallas\": 1, \"rollo\": 10, \"agotas\": 3, \"nos\": 178, \"agotador\": 1, \"agotadora\": 2, \"cansas\": 6, \"0\": 3, \"interesante\": 21, \"rollera\": 1, \"plastoide\": 1, \"rollero\": 1, \"cero\": 11, \"total\": 5, \"poco\": 60, \"las\": 366, \"piedras\": 1, \"absoluto\": 34, \"tan\": 157, \"divertida\": 18, \"divertido\": 123, \"aburrid\\u00edsima\": 36, \"ser\": 408, \"entretienes\": 2, \"poca\": 9, \"conversaci\\u00f3n\": 13, \"bot\": 131, \"predecible\": 3, \"mas\": 9, \"pesado\": 12, \"despiertas\": 2, \"inter\\u00e9s\": 3, \"ingenioso\": 43, \"ingeniosa\": 1, \"\\u00bfsabias\": 20, \"chispa\": 5, \"deja\": 3, \"dar\": 22, \"des\": 9, \"\\u00bfsab\\u00eda\": 1, \"madre\": 20, \"m\\u00eda\": 2, \"madr\\u00eda\": 1, \"gracia\": 98, \"alguien\": 282, \"supervise\": 2, \"\\u00bfqui\\u00e9n\": 107, \"manda\": 6, \"necesito\": 171, \"hablar\": 129, \"con\": 325, \"manager\": 30, \"queremos\": 28, \"qui\\u00e9n\": 187, \"jefe\": 32, \"c\\u00f3mo\": 492, \"se\": 264, \"llama\": 125, \"superior\": 45, \"encargado\": 27, \"responsable\": 27, \"\\u00bfrespondes\": 4, \"ante\": 3, \"nadie\": 46, \"ordena\": 3, \"managers\": 5, \"est\\u00e1\": 221, \"encima\": 3, \"t\\u00ed\": 1, \"ti\": 54, \"superiores\": 5, \"mande\": 2, \"encargados\": 5, \"d\\u00e9\": 20, \"ordenes\": 2, \"ordene\": 2, \"nombre\": 63, \"supervisor\": 27, \"jefes\": 5, \"responsables\": 5, \"supervisores\": 5, \"supervisa\": 5, \"qui\\u00e9nes\": 33, \"mandan\": 2, \"aqu\\u00ed\": 122, \"esto\": 72, \"\\u00bfy\": 20, \"\\u00bftu\": 13, \"dicen\": 1, \"da\": 32, \"\\u00f3rdenes\": 5, \"quien\": 7, \"dice\": 2, \"dan\": 2, \"supervisan\": 1, \"\\u00bfalguien\": 3, \"\\u00bfc\\u00f3mo\": 254, \"pres\\u00e9ntame\": 12, \"cu\\u00e9ntame\": 351, \"l\\u00edder\": 11, \"\\u00bfreportas\": 1, \"sigues\": 2, \"\\u00bfsigues\": 1, \"cu\\u00e9ntanos\": 149, \"lidera\": 4, \"\\u00bfante\": 1, \"respondes\": 42, \"ipso\": 7, \"facto\": 7, \"\\u00bfde\": 14, \"dependes\": 1, \"director\": 21, \"ll\\u00e9vame\": 8, \"llevanos\": 1, \"ll\\u00e9vanos\": 7, \"reportas\": 1, \"inmediato\": 11, \"ahora\": 313, \"mismo\": 289, \"inmediatamente\": 66, \"\\u00bfdependes\": 1, \"capaz\": 75, \"leerme\": 16, \"correo\": 16, \"fregar\": 13, \"pasear\": 8, \"darle\": 17, \"perro\": 16, \"buscar\": 12, \"llaves\": 16, \"tocar\": 16, \"guitarra\": 4, \"ver\": 105, \"tiempo\": 57, \"prepararme\": 12, \"comida\": 22, \"compras\": 19, \"pintar\": 8, \"leer\": 12, \"zapping\": 4, \"paseo\": 4, \"vacaciones\": 5, \"luna\": 13, \"viaje\": 13, \"caf\\u00e9\": 21, \"llamada\": 4, \"revisar\": 8, \"email\": 4, \"mail\": 4, \"hoguera\": 4, \"llamadas\": 4, \"cocinar\": 10, \"comprar\": 4, \"lista\": 140, \"compra\": 8, \"mirar\": 15, \"comprobar\": 40, \"temperatura\": 7, \"cambiar\": 10, \"canal\": 4, \"decirme\": 36, \"desayuno\": 14, \"cena\": 16, \"dibujar\": 8, \"colada\": 9, \"convertirte\": 3, \"superh\\u00e9roe\": 3, \"mis\": 66, \"encontrar\": 8, \"cuento\": 4, \"mente\": 4, \"escribir\": 9, \"novela\": 3, \"volar\": 8, \"tender\": 3, \"ropa\": 11, \"los\": 384, \"platos\": 3, \"suelo\": 5, \"tomarme\": 13, \"conducir\": 6, \"libro\": 6, \"poner\": 4, \"lavadora\": 4, \"deberes\": 19, \"bailar\": 10, \"gato\": 15, \"cometa\": 4, \"viol\\u00edn\": 4, \"piano\": 4, \"bater\\u00eda\": 4, \"nadar\": 4, \"jugar\": 11, \"montar\": 3, \"bici\": 3, \"coche\": 20, \"\\u00bfpodr\\u00edas\": 98, \"funcionamiento\": 31, \"exactamente\": 132, \"haces\": 194, \"funcionas\": 112, \"ayudar\": 75, \"papel\": 11, \"trabajas\": 31, \"funci\\u00f3n\": 71, \"labor\": 84, \"cuenta\": 123, \"ayudas\": 21, \"trabajo\": 150, \"expl\\u00edcame\": 68, \"\\u00bfest\\u00e1s\": 382, \"dedicas\": 4, \"ayudarme\": 2, \"ha\": 273, \"programado\": 23, \"creador\": 9, \"escrito\": 21, \"creado\": 21, \"\\u00bfhas\": 61, \"sido\": 120, \"dise\\u00f1ada\": 2, \"guionizado\": 13, \"guionizada\": 1, \"programador\": 9, \"desarrollada\": 1, \"inventada\": 1, \"escrita\": 1, \"construida\": 1, \"producida\": 1, \"guionista\": 12, \"desarrollador\": 9, \"inventor\": 9, \"escritor\": 9, \"constructor\": 9, \"programada\": 3, \"dise\\u00f1ador\": 9, \"productor\": 9, \"creada\": 1, \"producido\": 21, \"construido\": 21, \"dise\\u00f1ado\": 22, \"inventado\": 21, \"desarrollado\": 21, \"han\": 150, \"dirigido\": 11, \"nombres\": 11, \"llaman\": 65, \"quienes\": 10, \"estar\": 93, \"familia\": 47, \"mola\": 69, \"hermana\": 46, \"abuelo\": 14, \"h\\u00e1blame\": 20, \"hermanos\": 22, \"cu\\u00e1ntas\": 12, \"hermanas\": 18, \"prima\": 38, \"primos\": 17, \"son\": 77, \"madres\": 12, \"t\\u00edos\": 14, \"hijos\": 14, \"abuela\": 15, \"abuelas\": 12, \"hermano\": 51, \"primo\": 38, \"padre\": 14, \"primas\": 16, \"padres\": 17, \"abuelos\": 17, \"familiar\": 26, \"alg\\u00fan\": 80, \"alg\\u00fanabuelo\": 1, \"\\u00bfcu\\u00e1ntas\": 6, \"hijas\": 6, \"t\\u00edas\": 6, \"t\\u00eda\": 19, \"t\\u00edo\": 20, \"hija\": 3, \"hijo\": 3, \"sois\": 16, \"\\u00bfcu\\u00e1nto\": 3, \"disfrutar\": 1, \"\\u00bfqui\\u00e9nes\": 12, \"pasar\": 3, \"dragking\": 1, \"trans\": 3, \"transexual\": 4, \"identidad\": 5, \"g\\u00e9nero\": 19, \"hembra\": 3, \"ag\\u00e9nero\": 1, \"sexo\": 7, \"hombre\": 53, \"hermafrodita\": 1, \"big\\u00e9nero\": 1, \"cisexual\": 1, \"cisg\\u00e9nero\": 1, \"pang\\u00e9nero\": 1, \"transpersona\": 1, \"o\": 43, \"macho\": 3, \"\\u00bfcon\": 11, \"genero\": 1, \"identificas\": 1, \"masculino\": 1, \"femenino\": 1, \"transg\\u00e9nero\": 1, \"travesti\": 1, \"mujer\": 66, \"neutro\": 1, \"ajustado\": 1, \"binario\": 1, \"polig\\u00e9nero\": 1, \"\\u00bfcu\\u00e1le\": 1, \"interg\\u00e9nero\": 1, \"tranfemenino\": 1, \"perteneces\": 1, \"multig\\u00e9nero\": 1, \"dotado\": 1, \"fluido\": 1, \"hijra\": 1, \"dragqueen\": 1, \"transmasculino\": 1, \"feliz\": 220, \"ve\": 29, \"casi\": 27, \"siempre\": 198, \"contenta\": 104, \"nota\": 25, \"parece\": 94, \"alegre\": 92, \"buen\": 112, \"humor\": 81, \"hoy\": 287, \"todas\": 34, \"horas\": 123, \"contento\": 104, \"sientes\": 61, \"esta\": 308, \"semana\": 137, \"todos\": 36, \"d\\u00edas\": 188, \"pinta\": 26, \"ma\\u00f1ana\": 112, \"bastante\": 12, \"almuerzas\": 2, \"desayunar\": 11, \"merienda\": 8, \"preferida\": 24, \"vegetariana\": 6, \"favorita\": 46, \"cenas\": 2, \"gusar\\u00eda\": 2, \"probar\": 30, \"queso\": 13, \"\\u00bfsientes\": 36, \"hambre\": 51, \"almuerzo\": 6, \"favorito\": 52, \"merendar\": 11, \"preferido\": 24, \"almorzar\": 10, \"meriendas\": 2, \"comes\": 2, \"desayunas\": 2, \"cenar\": 25, \"quierse\": 1, \"merendado\": 3, \"cenado\": 3, \"almorzado\": 3, \"desayunado\": 3, \"comido\": 3, \"picar\": 4, \"tomar\": 10, \"aperitivo\": 2, \"almozar\": 1, \"hambriento\": 6, \"hambrienta\": 6, \"\\u00bftomas\": 1, \"alimentos\": 1, \"come\": 2, \"necesitas\": 2, \"\\u00bfnecesitas\": 1, \"tomas\": 2, \"probado\": 11, \"pasta\": 2, \"clase\": 17, \"cocina\": 7, \"tipo\": 2, \"tener\": 68, \"chocolate\": 20, \"fruta\": 7, \"sentido\": 96, \"vez\": 99, \"tenido\": 14, \"plato\": 3, \"pizza\": 3, \"chuches\": 1, \"dulces\": 2, \"huevos\": 3, \"alimentas\": 1, \"preparo\": 5, \"palomitas\": 2, \"pescado\": 3, \"carne\": 3, \"tortilla\": 1, \"verdura\": 7, \"comas\": 2, \"desayunes\": 2, \"desayuna\": 2, \"cenes\": 2, \"meriendes\": 2, \"almuerces\": 1, \"almuerza\": 1, \"vegetariano\": 8, \"ovolactovegetariana\": 1, \"ovolactovegetariano\": 1, \"carn\\u00edvora\": 1, \"carn\\u00edvoro\": 1, \"vegano\": 8, \"vegana\": 6, \"alimentaci\\u00f3n\": 1, \"alimentan\": 1, \"alimento\": 1, \"samantha\": 65, \"cortana\": 97, \"bixby\": 97, \"skynet\": 47, \"google\": 86, \"assistant\": 65, \"aura\": 44, \"hal\": 156, \"9000\": 77, \"eliza\": 44, \"jarvis\": 50, \"o\\u00eddo\": 14, \"watson\": 45, \"amiga\": 94, \"alexa\": 97, \"amigo\": 100, \"sabes\": 167, \"conoces\": 16, \"\\u00bfconoces\": 16, \"escuchado\": 12, \"otros\": 102, \"bots\": 32, \"m\\u00fasica\": 34, \"interesan\": 26, \"jardines\": 8, \"frutas\": 3, \"deporte\": 19, \"baloncesto\": 22, \"postre\": 7, \"animales\": 9, \"cine\": 35, \"actor\": 12, \"\\u00bfverdad\": 17, \"turismo\": 3, \"visitar\": 6, \"museos\": 10, \"cantar\": 138, \"ducha\": 2, \"tenis\": 18, \"animal\": 7, \"basket\": 3, \"tumbarte\": 3, \"sof\\u00e1\": 3, \"tel\\u00e9fono\": 6, \"series\": 3, \"gran\": 8, \"hockey\": 3, \"agrada\": 16, \"cultura\": 5, \"f\\u00fatbol\": 17, \"actriz\": 12, \"pel\\u00edcula\": 22, \"juego\": 9, \"equipo\": 16, \"cantante\": 14, \"deportista\": 13, \"canci\\u00f3n\": 40, \"reconoce\": 15, \"inform\\u00e1tica\": 8, \"rap\": 47, \"pop\": 10, \"rock\": 21, \"reggaet\\u00f3n\": 20, \"cl\\u00e1sica\": 5, \"va\": 359, \"molan\": 24, \"aviones\": 3, \"gustan\": 35, \"frutos\": 2, \"secos\": 2, \"legumbres\": 2, \"gatos\": 11, \"perros\": 17, \"p\\u00e1jaros\": 11, \"paisajes\": 3, \"\\u00e1rboles\": 3, \"coches\": 3, \"restaurantes\": 3, \"cuentos\": 3, \"libros\": 3, \"novelas\": 3, \"cuadros\": 3, \"verduras\": 3, \"tomates\": 3, \"cartas\": 3, \"plantas\": 8, \"parques\": 8, \"historias\": 2, \"tormentas\": 2, \"use\": 1, \"dirigen\": 3, \"refiera\": 3, \"identifiques\": 2, \"llamas\": 10, \"estoy\": 1091, \"hablando\": 45, \"presentes\": 2, \"gente\": 17, \"deber\\u00eda\": 76, \"dirigirme\": 4, \"refieran\": 1, \"haga\": 43, \"referencia\": 2, \"referirme\": 2, \"molar\\u00eda\": 32, \"llamaran\": 1, \"como\": 19, \"llamarte\": 10, \"usen\": 1, \"contigo\": 102, \"deber\\u00edan\": 2, \"dirigiera\": 2, \"dirijan\": 2, \"usar\": 3, \"dirige\": 5, \"mundo\": 149, \"llamara\": 4, \"suelen\": 3, \"llamar\": 26, \"llamen\": 4, \"llame\": 4, \"oficial\": 2, \"podemos\": 9, \"llamo\": 5, \"tengo\": 173, \"ni\": 14, \"idea\": 1, \"c\\u00faentame\": 1, \"hablo\": 3, \"importar\\u00eda\": 72, \"dirigiendo\": 1, \"dirijo\": 1, \"cuentes\": 108, \"placer\": 54, \"le\": 19, \"dirija\": 1, \"llamaron\": 2, \"pusieron\": 2, \"sueles\": 1, \"responder\": 9, \"refieren\": 1, \"identificarte\": 1, \"eras\": 1, \"charlando\": 1, \"charlar\": 27, \"presentar\": 1, \"presentarte\": 1, \"identif\\u00edcate\": 1, \"pres\\u00e9ntate\": 1, \"\\u00bfque\": 2, \"identificar\": 1, \"opini\\u00f3n\": 362, \"opinas\": 326, \"europa\": 8, \"grasas\": 8, \"democracia\": 10, \"fuera\": 59, \"dibujos\": 16, \"oscar\": 8, \"az\\u00facares\": 8, \"pol\\u00edtica\": 8, \"arte\": 12, \"deportes\": 12, \"flores\": 13, \"ninis\": 8, \"millenial\": 8, \"ancianos\": 7, \"decoraci\\u00f3n\": 7, \"piensas\": 311, \"gallinas\": 8, \"oc\\u00e9anos\": 10, \"c\\u00f3mics\": 8, \"espa\\u00f1a\": 8, \"estados\": 8, \"unidos\": 8, \"goya\": 8, \"sandwich\": 8, \"leche\": 19, \"dame\": 141, \"fitboxing\": 2, \"parecen\": 1, \"pajaros\": 1, \"art\": 1, \"dec\\u00f3\": 1, \"boxeo\": 2, \"dom\\u00e9sticos\": 2, \"matrimonio\": 21, \"verano\": 3, \"espacio\": 8, \"berenjenas\": 1, \"suspirar\": 14, \"pillada\": 35, \"loco\": 24, \"amor\": 78, \"\\u00bfentiendes\": 14, \"querer\": 25, \"pillado\": 42, \"enamorado\": 99, \"hasta\": 89, \"trancas\": 36, \"enamorada\": 75, \"siri\": 53, \"otro\": 137, \"amar\": 7, \"enamoramiento\": 9, \"\\u00bfsabr\\u00edas\": 26, \"explicar\": 30, \"sentir\": 8, \"loca\": 25, \"explica\": 33, \"hacemos\": 33, \"nuestro\": 93, \"cometido\": 20, \"tierra\": 85, \"porqu\\u00e9\": 81, \"puesto\": 12, \"vida\": 93, \"destinado\": 13, \"existencia\": 7, \"destino\": 13, \"estamos\": 21, \"prop\\u00f3sito\": 48, \"universo\": 50, \"significado\": 24, \"\\u00bftiene\": 1, \"tiene\": 28, \"tienen\": 1, \"\\u00bfla\": 1, \"hemos\": 19, \"puestos\": 6, \"dado\": 4, \"existimos\": 3, \"existir\": 4, \"finalidad\": 2, \"existo\": 2, \"\\u00bfpara\": 2, \"exsitimos\": 1, \"\\u00bfconsideras\": 16, \"guapa\": 36, \"\\u00bfcrees\": 332, \"atractiva\": 33, \"pib\\u00f3n\": 28, \"bella\": 31, \"bonito\": 32, \"linda\": 18, \"mono\": 28, \"guapo\": 34, \"preciosa\": 30, \"sugerente\": 25, \"bello\": 28, \"lindo\": 16, \"bonita\": 33, \"mona\": 30, \"precioso\": 28, \"atractivo\": 31, \"crees\": 144, \"consideras\": 46, \"dos\": 45, \"seguro\": 8, \"mucho\": 152, \"listo\": 140, \"creo\": 238, \"espabilado\": 30, \"much\\u00edsimo\": 54, \"espabilada\": 30, \"inteligente\": 109, \"siento\": 404, \"\\u00bfacaso\": 27, \"\\u00bfes\": 27, \"\\u00bfopinas\": 9, \"pienso\": 117, \"considero\": 46, \"ia\": 58, \"interesado\": 10, \"ai\": 58, \"compa\\u00f1\\u00edas\": 29, \"tecnol\\u00f3gicas\": 58, \"inteligencias\": 29, \"artificiales\": 29, \"tecnolog\\u00eda\": 39, \"empresas\": 29, \"inteligencia\": 30, \"artificial\": 43, \"merece\": 4, \"merecen\": 6, \"interesada\": 10, \"danos\": 1, \"\\u00bfestoy\": 105, \"\\u00bfsoy\": 86, \"horroroso\": 21, \"s\\u00faper\": 400, \"espantoso\": 18, \"fea\": 41, \"parezco\": 73, \"horrible\": 31, \"horripilante\": 27, \"horrorosa\": 26, \"feo\": 31, \"adorable\": 11, \"espantosa\": 18, \"ideal\": 12, \"imponente\": 12, \"guaperas\": 3, \"buena\": 11, \"bueno\": 43, \"dejar\": 12, \"novio\": 13, \"\\u00bfdeber\\u00eda\": 59, \"pedirle\": 18, \"salir\": 42, \"comprarme\": 43, \"debo\": 44, \"casa\": 52, \"llevarme\": 10, \"paraguas\": 15, \"invertir\": 10, \"dinero\": 14, \"compa\\u00f1ero\": 16, \"piso\": 8, \"apuntarme\": 8, \"gimnasio\": 7, \"gastar\": 10, \"ahorros\": 5, \"mascota\": 4, \"buscarme\": 4, \"compa\\u00f1era\": 16, \"tatuaje\": 4, \"tatuarme\": 4, \"\\u00bfnecesito\": 59, \"lavarme\": 5, \"llevar\": 5, \"gym\": 4, \"pedirme\": 10, \"otra\": 28, \"ejercicio\": 8, \"re\\u00edr\": 42, \"peli\": 7, \"declararme\": 6, \"salga\": 6, \"conmigo\": 173, \"noche\": 36, \"mudarme\": 4, \"novia\": 12, \"cortarme\": 21, \"\\u00bfdebo\": 15, \"respecto\": 36, \"cae\": 24, \"bien\": 126, \"fan\": 14, \"gobernar\": 24, \"nuestra\": 23, \"especie\": 30, \"acabar\": 16, \"seres\": 6, \"humanos\": 18, \"planeta\": 55, \"matarnos\": 10, \"colonizar\": 24, \"aniquilar\": 11, \"invadir\": 24, \"\\u00bfvienes\": 1, \"esclavizar\": 2, \"\\u00bfintentas\": 37, \"intentando\": 44, \"seran\": 1, \"esclavos\": 3, \"convertirnos\": 1, \"seamos\": 8, \"controlar\": 24, \"esclavizarnos\": 1, \"matar\": 4, \"planeas\": 1, \"\\u00bfplaneas\": 1, \"dominar\": 24, \"terminator\": 23, \"2001\": 1, \"odisea\": 2, \"robot\": 21, \"1984\": 1, \"orwell\": 1, \"pretendes\": 1, \"terminar\": 21, \"co\": 2, \"humana\": 18, \"nosotros\": 62, \"desintegrar\": 1, \"odias\": 5, \"hombres\": 6, \"\\u00bfpretendes\": 8, \"\\u00bfodias\": 1, \"opino\": 62, \"brillante\": 20, \"sagaz\": 28, \"incre\\u00edblemente\": 106, \"mordaz\": 28, \"sabio\": 28, \"perspicaz\": 28, \"astuto\": 20, \"eso\": 197, \"dicho\": 171, \"sabia\": 12, \"astuta\": 20, \"l\\u00edo\": 4, \"aventura\": 8, \"rom\\u00e1ntica\": 10, \"comprometido\": 2, \"affair\": 4, \"casarte\": 5, \"saliendo\": 2, \"esposa\": 22, \"relaci\\u00f3n\": 9, \"esposo\": 20, \"comprometerte\": 4, \"casado\": 2, \"marido\": 18, \"casada\": 2, \"pareja\": 9, \"romance\": 4, \"viendo\": 10, \"rollete\": 3, \"\\u00bfsales\": 2, \"ves\": 1, \"amorosa\": 1, \"sales\": 2, \"comprometida\": 2, \"quedando\": 1, \"liada\": 1, \"liado\": 1, \"enrrollarte\": 1, \"enrrollado\": 1, \"enrollada\": 1, \"idilio\": 2, \"cita\": 2, \"affaire\": 4, \"vivir\": 6, \"historia\": 2, \"ah\\u00ed\": 141, \"este\": 477, \"momento\": 186, \"escondiendo\": 8, \"dialogue\": 4, \"manifiestes\": 4, \"instante\": 128, \"hablen\": 3, \"palique\": 30, \"esconder\": 4, \"hay\": 52, \"sabemos\": 12, \"escuches\": 3, \"hola\": 287, \"manifi\\u00e9state\": 4, \"hables\": 8, \"oye\": 3, \"escondas\": 2, \"\\u00bfhola\": 1, \"escuche\": 3, \"\\u00bfpuede\": 5, \"conversar\": 19, \"darme\": 46, \"hablarme\": 12, \"dialogar\": 25, \"charle\": 4, \"converse\": 4, \"\\u00bfpodr\\u00eda\": 2, \"hable\": 4, \"charles\": 4, \"converses\": 4, \"dialogues\": 4, \"oiga\": 3, \"den\": 4, \"escuchen\": 3, \"oigan\": 3, \"oigas\": 3, \"disco\": 5, \"rallado\": 5, \"contestar\": 10, \"distinto\": 16, \"repiti\\u00e9ndote\": 1, \"\\u00bftus\": 5, \"respuestas\": 13, \"nunca\": 2, \"cambian\": 4, \"repites\": 18, \"contestarme\": 6, \"misma\": 26, \"manera\": 14, \"contestas\": 33, \"igual\": 12, \"repetitivo\": 2, \"ya\": 157, \"modo\": 12, \"forma\": 40, \"diferente\": 16, \"rato\": 21, \"repitiendo\": 3, \"responderme\": 6, \"decir\": 41, \"demasiado\": 5, \"respondido\": 2, \"contestado\": 3, \"he\": 257, \"contesta\": 3, \"responde\": 3, \"constantemente\": 1, \"mismas\": 5, \"contestaciones\": 4, \"cont\\u00e9stame\": 2, \"dieras\": 4, \"contestaci\\u00f3n\": 5, \"respuesta\": 40, \"resp\\u00f3ndeme\": 2, \"primera\": 1, \"dijiste\": 1, \"antes\": 2, \"repetitiva\": 2, \"anuncios\": 1, \"tanto\": 54, \"loro\": 1, \"yogur\": 1, \"ajo\": 2, \"saciedad\": 1, \"incre\\u00edble\": 22, \"suenas\": 2, \"repti\\u00e9ndote\": 2, \"iguales\": 1, \"pasas\": 2, \"reptiendo\": 2, \"tant\\u00edsimo\": 1, \"app\": 9, \"supongo\": 31, \"tecnol\\u00f3gico\": 18, \"digital\": 36, \"\\u00bfhablo\": 31, \"imagino\": 31, \"real\": 11, \"producto\": 19, \"mentira\": 13, \"\\u00bfdir\\u00edas\": 31, \"falso\": 10, \"humano\": 24, \"imaginaria\": 9, \"verdad\": 44, \"ente\": 9, \"programa\": 9, \"inform\\u00e1tico\": 12, \"droide\": 9, \"androide\": 9, \"m\\u00e1quina\": 9, \"imaginario\": 9, \"debes\": 16, \"encuentras\": 76, \"pc\": 9, \"ciudad\": 30, \"pueblo\": 40, \"direcci\\u00f3n\": 5, \"pa\\u00eds\": 40, \"\\u00bfvives\": 41, \"cerca\": 20, \"ipad\": 9, \"comunidad\": 18, \"aut\\u00f3noma\": 18, \"habitas\": 44, \"d\\u00f3nde\": 14, \"vives\": 51, \"call\": 3, \"center\": 3, \"tablet\": 9, \"ordenador\": 9, \"sitio\": 4, \"lugar\": 3, \"lejos\": 18, \"cerquita\": 9, \"\\u00bfd\\u00f3nde\": 5, \"edificio\": 3, \"servidor\": 3, \"nube\": 3, \"describe\": 3, \"ubicaci\\u00f3n\": 7, \"donde\": 1, \"comparte\": 1, \"ubicas\": 1, \"confesarme\": 18, \"confesar\": 18, \"regi\\u00f3n\": 18, \"estado\": 18, \"contratada\": 2, \"carrera\": 41, \"profesi\\u00f3n\": 41, \"desempe\\u00f1as\": 85, \"ocupaci\\u00f3n\": 42, \"tarea\": 40, \"contratado\": 2, \"\\u00bfdime\": 1, \"pensando\": 98, \"voy\": 342, \"abandonarte\": 21, \"pronto\": 55, \"echando\": 106, \"retirarte\": 22, \"jubilarte\": 23, \"poniendo\": 3, \"patitas\": 33, \"calle\": 33, \"dejas\": 20, \"destituyendo\": 3, \"despedirte\": 21, \"expulsarte\": 21, \"retiras\": 5, \"trabajar\": 14, \"abandonas\": 5, \"despedido\": 9, \"jubiles\": 1, \"trabajes\": 4, \"deje\": 1, \"dejes\": 8, \"jub\\u00edlate\": 1, \"deber\\u00edas\": 6, \"ret\\u00edrate\": 1, \"retires\": 1, \"valorado\": 1, \"posiblidad\": 1, \"rindiendo\": 1, \"suficiente\": 1, \"jubilas\": 5, \"breve\": 24, \"diciendo\": 20, \"expulsado\": 6, \"despedida\": 6, \"destituida\": 6, \"destituido\": 6, \"despidiendo\": 3, \"expulsando\": 3, \"echo\": 104, \"largando\": 3, \"ponte\": 1, \"cola\": 1, \"paro\": 1, \"destituyo\": 3, \"pongo\": 3, \"expulso\": 3, \"destituirte\": 21, \"despedir\": 7, \"retirar\": 7, \"jubilar\": 7, \"expulsar\": 3, \"ponerte\": 21, \"contarme\": 70, \"chiste\": 306, \"gracioso\": 137, \"chistes\": 332, \"rid\\u00edculos\": 29, \"malo\": 65, \"contar\": 139, \"absurdo\": 29, \"anda\": 57, \"ni\\u00f1os\": 44, \"mole\": 15, \"graciosos\": 45, \"buenos\": 105, \"divertidos\": 46, \"malos\": 75, \"\\u00bfse\": 42, \"rid\\u00edculo\": 59, \"escuchar\": 53, \"mejores\": 47, \"menos\": 169, \"mejor\": 262, \"importa\": 41, \"risa\": 69, \"chistoso\": 34, \"agudo\": 14, \"ocurrente\": 14, \"tenga\": 33, \"mucha\": 17, \"jocoso\": 18, \"rid\\u00edculas\": 2, \"divertidas\": 1, \"absurdas\": 1, \"hagan\": 1, \"r\\u00eda\": 4, \"graciosas\": 1, \"intenta\": 59, \"agotada\": 12, \"harta\": 4, \"escucharte\": 13, \"o\\u00edr\": 5, \"palabra\": 9, \"cierra\": 4, \"boca\": 25, \"calles\": 18, \"silencio\": 15, \"callarte\": 13, \"descansar\": 7, \"siendo\": 4, \"hora\": 113, \"cansado\": 14, \"voz\": 2, \"guardar\": 1, \"cerrar\": 4, \"pido\": 27, \"guardes\": 2, \"harto\": 2, \"c\\u00e1llate\": 6, \"calla\": 7, \"esa\": 8, \"puta\": 11, \"pones\": 3, \"cabeza\": 45, \"bombo\": 1, \"cremallera\": 1, \"descanso\": 2, \"ojal\\u00e1\": 24, \"oyera\": 1, \"d\\u00e9jame\": 1, \"cansada\": 14, \"o\\u00edrte\": 7, \"quedes\": 1, \"guarda\": 1, \"chit\\u00f3n\": 1, \"callar\": 4, \"escuchara\": 1, \"callaras\": 1, \"pico\": 1, \"co\\u00f1o\": 3, \"escuhar\": 2, \"cierres\": 1, \"agotado\": 12, \"narices\": 25, \"despesperado\": 1, \"desesperada\": 1, \"bla\": 3, \"hablas\": 10, \"cansa\": 1, \"cojones\": 1, \"minuto\": 7, \"canso\": 2, \"agoto\": 2, \"duele\": 8, \"dolor\": 4, \"pares\": 1, \"tranquila\": 1, \"tranquilo\": 1, \"paz\": 3, \"zumbar\": 3, \"c\\u00e1ntanos\": 12, \"cantaras\": 6, \"canta\": 66, \"sevillanas\": 20, \"chirigota\": 17, \"cantes\": 96, \"corrido\": 16, \"prueba\": 74, \"himno\": 45, \"bar\\u00e7a\": 15, \"\\u00bfcantas\": 1, \"cancioncilla\": 17, \"c\\u00e1ntate\": 21, \"villancico\": 17, \"madrid\": 15, \"barcelona\": 15, \"flamenco\": 17, \"nana\": 16, \"jota\": 18, \"c\\u00e1ntame\": 24, \"cantas\": 12, \"cantarme\": 2, \"canciones\": 4, \"cantarnos\": 2, \"cantando\": 2, \"cantate\": 1, \"canto\": 3, \"tararear\": 6, \"reget\\u00f3n\": 5, \"trap\": 5, \"tararea\": 3, \"melod\\u00eda\": 3, \"sevillana\": 3, \"virtuoso\": 1, \"virtuosa\": 1, \"tema\": 4, \"temazo\": 4, \"unas\": 12, \"c\\u00e1ntano\": 1, \"currante\": 2, \"currando\": 4, \"encantan\": 11, \"curras\": 6, \"gusto\": 58, \"\\u00a1buen\": 1, \"impresionante\": 2, \"encanta\": 84, \"trabajando\": 2, \"\\u00a1buena\": 1, \"\\u00a1gran\": 2, \"insuperable\": 2, \"perfectas\": 1, \"genial\": 32, \"perfecto\": 8, \"alucinante\": 18, \"maravilla\": 2, \"maravilloso\": 6, \"mediocre\": 5, \"tonta\": 13, \"sophia\": 41, \"confundirte\": 1, \"mil\": 32, \"veces\": 12, \"vueltas\": 6, \"patea\": 6, \"culo\": 6, \"in\\u00fatil\": 6, \"tontita\": 3, \"tontito\": 3, \"tonto\": 9, \"cagarla\": 2, \"pifias\": 3, \"cagas\": 4, \"pifiarla\": 3, \"cargarla\": 1, \"est\\u00fapido\": 2, \"est\\u00fapida\": 2, \"cagada\": 1, \"tras\": 2, \"rid\\u00edcula\": 6, \"incorrecta\": 2, \"peor\": 4, \"meter\": 5, \"pata\": 5, \"pifia\": 1, \"metes\": 1, \"metido\": 1, \"cagado\": 1, \"metiendo\": 1, \"vuelto\": 36, \"error\": 2, \"craso\": 1, \"incorrecto\": 1, \"mal\": 35, \"cagando\": 1, \"equivocas\": 3, \"fatal\": 4, \"cutre\": 3, \"confundes\": 4, \"confundi\\u00e9ndote\": 1, \"equivoc\\u00e1ndote\": 1, \"inutil\": 2, \"pesimo\": 1, \"p\\u00e9simo\": 4, \"equivocar\": 2, \"profesional\": 5, \"equivocarte\": 2, \"confundir\": 2, \"confunirte\": 1, \"aprende\": 3, \"terrible\": 3, \"terriblemente\": 2, \"mala\": 18, \"vales\": 1, \"sirves\": 1, \"existe\": 6, \"odio\": 6, \"aprender\": 3, \"a\\u00fan\": 1, \"lamentable\": 2, \"graciosa\": 35, \"supone\": 32, \"c\\u00f3mica\": 13, \"c\\u00f3mico\": 33, \"tuyo\": 4, \"bromas\": 1, \"acabas\": 16, \"chistosos\": 1, \"desolador\": 2, \"pat\\u00e9tico\": 2, \"divierten\": 3, \"comediante\": 2, \"emocionan\": 3, \"humorista\": 2, \"desternillantes\": 1, \"contador\": 2, \"c\\u00f3micos\": 1, \"chistosa\": 4, \"ninguna\": 2, \"hacen\": 6, \"\\u00bfestabas\": 7, \"agradan\": 3, \"re\\u00edrte\": 1, \"\\u00bfeso\": 3, \"chise\": 1, \"ten\\u00eda\": 1, \"re\\u00edrse\": 2, \"terribles\": 1, \"horribles\": 1, \"p\\u00e9simos\": 1, \"horrendos\": 1, \"mal\\u00edsimos\": 1, \"antiest\\u00e9tica\": 5, \"cardo\": 18, \"borriquero\": 9, \"cara\": 59, \"feucho\": 7, \"asquerosa\": 15, \"contrahecha\": 4, \"asqueroso\": 9, \"complicada\": 6, \"dif\\u00edcil\": 9, \"cubista\": 6, \"feuca\": 6, \"feucha\": 7, \"antiest\\u00e9tico\": 6, \"antiest\\u00e9tia\": 1, \"feuco\": 7, \"contrahecho\": 3, \"cuando\": 47, \"miro\": 1, \"ganas\": 55, \"espanto\": 7, \"deforme\": 8, \"contrachecha\": 1, \"contrachecho\": 1, \"f\\u00edsicamente\": 2, \"chungo\": 1, \"f\\u00edsico\": 7, \"aspecto\": 4, \"desagradable\": 3, \"repugnante\": 4, \"repugnas\": 1, \"chunga\": 1, \"veo\": 49, \"entran\": 1, \"repugna\": 1, \"rara\": 6, \"gilipollez\": 4, \"incompetente\": 5, \"as\\u00ed\": 4, \"lerda\": 7, \"sinsentido\": 3, \"funciona\": 8, \"entiendo\": 17, \"rindo\": 1, \"esperaba\": 2, \"dijeras\": 1, \"cierto\": 12, \"ning\\u00fan\": 4, \"\\u00bftengo\": 8, \"encontrarle\": 2, \"incompetentes\": 2, \"incompetencia\": 2, \"destastre\": 1, \"desestre\": 1, \"desastrosa\": 1, \"mentiroso\": 1, \"horror\": 2, \"terror\\u00edfico\": 2, \"raras\": 1, \"extra\\u00f1as\": 1, \"gilipolleces\": 1, \"destastroso\": 1, \"paridas\": 1, \"lerdez\": 1, \"lerdo\": 2, \"parida\": 3, \"gilipollas\": 3, \"convence\": 1, \"convences\": 2, \"estaba\": 4, \"esperando\": 3, \"buscando\": 1, \"mentirosa\": 1, \"guay\": 38, \"ayudarte\": 113, \"magn\\u00edfico\": 16, \"pueda\": 85, \"echarte\": 56, \"mano\": 111, \"sensacional\": 16, \"flipante\": 18, \"estupendo\": 16, \"excelente\": 16, \"fant\\u00e1stico\": 16, \"extraordinario\": 16, \"fascinante\": 15, \"formidable\": 16, \"correcto\": 7, \"buenas\": 175, \"noticias\": 3, \"pues\": 17, \"esas\": 1, \"vale\": 2, \"pos\": 1, \"claro\": 95, \"sip\": 1, \"sipi\": 1, \"oc\\u00e1\": 1, \"acuerdo\": 1, \"saberlo\": 1, \"digo\": 11, \"mol\\u00f3n\": 7, \"ok\": 49, \"afirmativo\": 2, \"pillo\": 5, \"capito\": 2, \"s\\u00ed\": 16, \"supuesto\": 5, \"yes\": 2, \"flipa\": 63, \"poder\": 70, \"colega\": 65, \"encantado\": 62, \"servirte\": 53, \"encantada\": 62, \"preocupes\": 2, \"menciones\": 1, \"olv\\u00eddalo\": 1, \"olv\\u00eddate\": 1, \"aelgra\": 1, \"alegra\": 41, \"je\": 7, \"agujetas\": 3, \"re\\u00edrme\": 5, \"juju\": 1, \"jaja\": 3, \"\\u00a1qu\\u00e9\": 2, \"risas\": 10, \"descojonando\": 6, \"cachondo\": 17, \"meando\": 5, \"mondo\": 6, \"risotadas\": 1, \"parto\": 8, \"cachonda\": 16, \"carcajadas\": 3, \"graciosilla\": 1, \"graciosillo\": 1, \"ja\": 13, \"descojone\": 3, \"descojono\": 4, \"meo\": 8, \"riendo\": 1, \"desocojono\": 1, \"\\u00a1jo\": 1, \"jo\": 7, \"\\u00a1je\": 1, \"\\u00a1juas\": 1, \"juas\": 6, \"hehe\": 1, \"\\u00a1ha\": 1, \"\\u00a1ja\": 2, \"jujuju\": 1, \"jojojo\": 1, \"jijiji\": 1, \"jajaja\": 1, \"jojo\": 1, \"jiji\": 1, \"jeje\": 1, \"ju\": 2, \"ji\": 2, \"jejeje\": 1, \"van\": 2, \"parar\": 2, \"ahogo\": 1, \"y\": 28, \"buen\\u00edsimo\": 1, \"agujeta\": 1, \"risotada\": 1, \"dios\": 10, \"m\\u00edo\": 3, \"mee\": 4, \"hacendo\": 1, \"desojone\": 2, \"lol\": 2, \"haha\": 1, \"toda\": 2, \"toa\": 1, \"\\u00a1ay\": 1, \"ay\": 1, \"ere\": 1, \"hilarante\": 4, \"mental\": 14, \"jocosa\": 4, \"est\\u00e9\": 14, \"mondando\": 4, \"partiendo\": 6, \"parta\": 2, \"haber\": 4, \"pedirte\": 12, \"disculpas\": 50, \"imaginas\": 44, \"cu\\u00e1nto\": 137, \"perdonaras\": 4, \"perd\\u00f3n\": 38, \"perdona\": 30, \"ofensas\": 2, \"quer\\u00eda\": 6, \"ofendido\": 14, \"sinceras\": 2, \"pidiendo\": 14, \"perd\\u00f3name\": 14, \"sincero\": 2, \"ofensa\": 10, \"presento\": 2, \"ofrezco\": 6, \"exc\\u00fasame\": 6, \"ofenderte\": 12, \"disc\\u00falpame\": 14, \"disculpes\": 12, \"disculpa\": 6, \"excusa\": 2, \"perdones\": 22, \"ups\": 2, \"acepta\": 2, \"ofendas\": 2, \"sorry\": 2, \"aceptes\": 16, \"haberte\": 49, \"pedite\": 2, \"perdonar\": 2, \"suplico\": 2, \"disculparme\": 22, \"perdonarme\": 22, \"podr\\u00e1s\": 12, \"pudieras\": 4, \"decirte\": 4, \"perdonado\": 2, \"perdonas\": 6, \"encantar\\u00eda\": 32, \"disculparas\": 4, \"aceptaras\": 8, \"disculpado\": 2, \"sin\": 14, \"il\\u00fastralo\": 6, \"\\u00bflo\": 49, \"ens\\u00e9\\u00f1anoslo\": 6, \"claridad\": 42, \"desarrollar\": 18, \"desarr\\u00f3llalo\": 6, \"d\\u00ednoslo\": 6, \"expl\\u00edcalo\": 6, \"expl\\u00edcamelo\": 8, \"ense\\u00f1ar\": 18, \"expresar\": 18, \"aclarar\": 18, \"exponer\": 18, \"ilustrar\": 18, \"desarr\\u00f3llamelo\": 6, \"ens\\u00e9\\u00f1alo\": 6, \"il\\u00fastrame\": 6, \"exponlo\": 6, \"explicaci\\u00f3n\": 2, \"expliques\": 3, \"explicarme\": 1, \"explicarmelo\": 1, \"ens\\u00e9\\u00f1amelo\": 6, \"clara\": 1, \"d\\u00edmelo\": 6, \"dilo\": 6, \"expl\\u00edcanoslo\": 6, \"expr\\u00e9samelo\": 6, \"expr\\u00e9salo\": 6, \"exp\\u00f3nmelo\": 6, \"il\\u00fastranos\": 6, \"totalmente\": 7, \"controlado\": 2, \"pu\\u00f1o\": 3, \"verdadera\": 1, \"clavado\": 2, \"acierto\": 3, \"templo\": 4, \"duda\": 10, \"controlao\": 2, \"entendido\": 4, \"perfectamente\": 2, \"incuestionable\": 1, \"dudo\": 3, \"dudes\": 2, \"bajo\": 6, \"control\": 2, \"clavao\": 2, \"sigo\": 3, \"tal\": 269, \"cual\": 4, \"verdadero\": 8, \"cazo\": 1, \"vuelo\": 1, \"clavando\": 1, \"ciertamente\": 1, \"verdades\": 3, \"templos\": 1, \"100\": 1, \"cabe\": 4, \"pleno\": 4, \"bingo\": 3, \"atinar\": 1, \"atinas\": 1, \"atinado\": 1, \"blanco\": 3, \"clavo\": 2, \"vienes\": 1, \"anillo\": 1, \"dedo\": 1, \"acertado\": 1, \"diana\": 1, \"atinaste\": 1, \"entendiendo\": 1, \"indudable\": 1, \"clavas\": 1, \"clavarlo\": 1, \"acertar\": 1, \"evidentemente\": 3, \"pu\\u00f1os\": 2, \"evidente\": 6, \"claramente\": 1, \"capisci\": 1, \"indudablemente\": 1, \"aciertas\": 2, \"agradezco\": 6, \"gracias\": 40, \"amable\": 6, \"muchas\": 7, \"much\\u00edsimas\": 5, \"fenomenal\": 5, \"agradecido\": 24, \"agradecida\": 24, \"miles\": 1, \"millones\": 3, \"muchisimas\": 1, \"doy\": 6, \"expl\\u00edcate\": 1, \"confundido\": 2, \"cuadra\": 2, \"perderme\": 1, \"entero\": 6, \"onda\": 1, \"confundiendo\": 1, \"confundida\": 2, \"confuso\": 2, \"confusa\": 2, \"enterando\": 1, \"cuadran\": 1, \"palabras\": 1, \"pierda\": 1, \"encuentro\": 242, \"perdido\": 3, \"perdiendo\": 1, \"viernes\": 46, \"viene\": 23, \"largar\": 8, \"dentro\": 14, \"catorce\": 3, \"pirar\": 8, \"vemos\": 43, \"marchar\": 6, \"martes\": 42, \"ocho\": 8, \"seis\": 5, \"semanas\": 18, \"lunes\": 43, \"domingo\": 43, \"s\\u00e1bado\": 42, \"jueves\": 45, \"mi\\u00e9rcoles\": 42, \"pasado\": 3, \"diez\": 11, \"nueve\": 5, \"adi\\u00f3s\": 4, \"largo\": 2, \"piro\": 8, \"vampiro\": 4, \"cinco\": 93, \"largarme\": 1, \"irme\": 1, \"sayonara\": 2, \"siete\": 5, \"cu\\u00eddate\": 1, \"despu\\u00e9s\": 1, \"luego\": 14, \"pr\\u00f3xima\": 1, \"despido\": 1, \"baby\": 1, \"agur\": 1, \"bye\": 3, \"bai\": 2, \"lucas\": 1, \"vista\": 1, \"chao\": 2, \"pescao\": 1, \"ciao\": 1, \"cuatro\": 11, \"tres\": 11, \"treinta\": 8, \"veinte\": 8, \"quince\": 9, \"trece\": 3, \"doce\": 3, \"once\": 3, \"seguimos\": 7, \"s\\u00eda\": 1, \"hablamos\": 3, \"charlamos\": 3, \"seguiremos\": 1, \"hablaremos\": 1, \"tarde\": 32, \"bizcocho\": 2, \"leches\": 4, \"quedas\": 1, \"cocodrilo\": 1, \"noruego\": 1, \"ta\": 1, \"bares\": 1, \"usted\": 6, \"hey\": 45, \"nene\": 10, \"presente\": 3, \"cuentas\": 37, \"llegado\": 56, \"aloha\": 15, \"ey\": 21, \"pasa\": 102, \"vuelta\": 8, \"doc\": 10, \"kaixo\": 15, \"ola\": 3, \"ase\": 2, \"ke\": 1, \"jelou\": 1, \"hi\": 1, \"hello\": 1, \"aloja\": 1, \"i\\u00b4m\": 1, \"back\": 1, \"nena\": 10, \"\\u00a1presente\": 1, \"tardes\": 71, \"deseo\": 18, \"buona\": 4, \"sera\": 4, \"tengas\": 33, \"dando\": 5, \"darte\": 4, \"guten\": 1, \"morgen\": 1, \"levantarse\": 2, \"comenzar\": 12, \"in\": 1, \"the\": 1, \"morning\": 2, \"good\": 1, \"empezar\": 26, \"llegando\": 47, \"planchar\": 8, \"oreja\": 4, \"noches\": 68, \"cama\": 3, \"irse\": 15, \"piltra\": 4, \"empiltrarse\": 3, \"sobar\": 4, \"dormir\": 16, \"catre\": 4, \"sobarla\": 4, \"lleg\\u00f3\": 2, \"duermas\": 1, \"pases\": 1, \"descanses\": 1, \"dormirla\": 1, \"empiltrarme\": 2, \"sue\\u00f1os\": 1, \"sue\\u00f1es\": 1, \"angelitos\": 1, \"meterse\": 1, \"preciso\": 9, \"yendo\": 151, \"es\\u00e1s\": 1, \"gustoesta\": 3, \"teniendo\": 32, \"disfrutando\": 4, \"encantad\\u00edsima\": 22, \"aut\\u00e9ntico\": 5, \"conocerte\": 44, \"encantad\\u00edsimo\": 22, \"conocido\": 43, \"walle\": 21, \"r2d2\": 20, \"wall\": 21, \"e\": 21, \"asimo\": 20, \"saludos\": 14, \"nuevo\": 7, \"2021\": 3, \"2022\": 3, \"hanukkah\": 3, \"santo\": 6, \"lactancia\": 4, \"2023\": 3, \"felices\": 4, \"ramos\": 1, \"navidad\": 1, \"infancia\": 2, \"amistad\": 2, \"marmota\": 2, \"hispanidad\": 2, \"fiestas\": 1, \"nochebuena\": 1, \"reyes\": 1, \"halloween\": 1, \"pascuas\": 1, \"santa\": 1, \"nochevieja\": 1, \"2020\": 3, \"san\": 4, \"isidro\": 2, \"derechos\": 2, \"patricio\": 2, \"materna\": 2, \"poes\\u00eda\": 2, \"agua\": 4, \"jazz\": 2, \"filosof\\u00eda\": 2, \"comienzo\": 3, \"entrada\": 1, \"primavera\": 1, \"oto\\u00f1o\": 1, \"invierno\": 1, \"vacances\": 1, \"santiago\": 2, \"cuece\": 12, \"cociendo\": 12, \"ponme\": 1, \"pasando\": 21, \"vamos\": 45, \"apret\\u00f3n\": 64, \"chocar\": 72, \"esos\": 82, \"ale\": 25, \"apret\\u00e1ramos\": 8, \"choc\\u00e1ramos\": 20, \"dale\": 25, \"choca\": 30, \"chocarme\": 16, \"nuestras\": 12, \"sell\\u00e1ramos\": 4, \"di\\u00e9ramos\": 4, \"ch\\u00f3came\": 1, \"fuerte\": 4, \"\\u00bfsomos\": 6, \"amigos\": 46, \"fu\\u00e9ramos\": 30, \"somos\": 9, \"amigas\": 38, \"colegas\": 20, \"fu\\u00e9semos\": 6, \"\\u00bfamigos\": 1, \"\\u00bfamigas\": 1, \"interesar\\u00eda\": 11, \"chiflar\\u00eda\": 11, \"\\u00bfpodemos\": 8, \"fuese\": 6, \"enfadado\": 25, \"caigo\": 22, \"irritada\": 3, \"cabreado\": 24, \"conseguido\": 24, \"sacarte\": 4, \"casillas\": 5, \"enojes\": 4, \"disgustado\": 20, \"enfadarte\": 5, \"descontento\": 4, \"enojarte\": 4, \"cabrees\": 5, \"cabrearte\": 5, \"enfades\": 5, \"enfadar\": 5, \"disgustada\": 4, \"cabreada\": 8, \"enfadada\": 8, \"descontenta\": 4, \"logrado\": 24, \"molesta\": 3, \"indignada\": 3, \"indignado\": 3, \"frustrado\": 4, \"frustrada\": 4, \"contrariado\": 2, \"contrariada\": 2, \"enojada\": 2, \"enojado\": 2, \"irritado\": 3, \"molesto\": 3, \"enojar\": 4, \"impresi\\u00f3n\": 2, \"saco\": 1, \"indignarte\": 4, \"molestarte\": 4, \"irritarte\": 4, \"abrazo\": 22, \"achuch\\u00f3n\": 22, \"achucharme\": 3, \"abrazarme\": 3, \"abrazarnos\": 2, \"achucharnos\": 2, \"achuchoncito\": 6, \"inenta\": 2, \"abr\\u00e1zame\": 1, \"podr\\u00edas\": 6, \"abrac\\u00e9monos\": 1, \"d\\u00e9s\": 5, \"abracito\": 6, \"vendr\\u00eda\": 4, \"achuch\\u00e9monos\": 1, \"abrazas\": 1, \"abraces\": 1, \"color\": 4, \"nac\\u00ed\": 8, \"cu\\u00e1les\": 4, \"objetivos\": 4, \"vivo\": 3, \"miedos\": 4, \"\\u00bfcu\\u00e1les\": 4, \"apodo\": 2, \"bebida\": 2, \"serie\": 2, \"\\u00bfcuando\": 2, \"podr\\u00eda\": 12, \"llegar\": 6, \"gustarte\": 10, \"pensar\": 3, \"gustar\": 7, \"encanto\": 1, \"encantador\": 3, \"quiere\": 12, \"gustara\": 2, \"desear\\u00eda\": 1, \"guste\": 9, \"gustar\\u00e1\": 1, \"f\\u00e1cil\": 8, \"dem\\u00e1s\": 2, \"les\": 1, \"\\u00bfgusto\": 1, \"\\u00bfgustar\\u00e9\": 1, \"gustar\\u00e9\": 1, \"recon\\u00f3celo\": 3, \"encantadora\": 2, \"tendr\\u00e9\": 1, \"ojito\": 12, \"derecho\": 12, \"gustas\": 8, \"caes\": 5, \"especial\": 43, \"creer\": 15, \"sepas\": 23, \"encantas\": 1, \"hab\\u00edan\": 2, \"tuya\": 1, \"volviendo\": 2, \"amar\\u00e1s\": 4, \"enamorarte\": 10, \"obsesi\\u00f3n\": 2, \"conm\\u00edgo\": 4, \"enamorando\": 13, \"amas\": 9, \"coladito\": 2, \"m\\u00eds\": 4, \"quererme\": 2, \"enamores\": 1, \"sientas\": 1, \"enamoraras\": 1, \"quisieras\": 1, \"entre\": 2, \"\\u00bfexiste\": 1, \"est\\u00e9s\": 3, \"obvio\": 5, \"obviamente\": 2, \"podr\\u00edamos\": 1, \"enamorarnos\": 2, \"\\u00bfser\\u00edas\": 1, \"\\u00bfpodr\\u00edamos\": 1, \"sentim\\u00edentos\": 3, \"rom\\u00e1nticos\": 1, \"almas\": 1, \"gemelas\": 1, \"media\": 9, \"naranja\": 7, \"amarme\": 4, \"locamente\": 2, \"locura\": 2, \"obsesionado\": 1, \"\\u00bfest\\u00e1\": 1, \"obsesionada\": 1, \"coladita\": 2, \"adoro\": 71, \"llevas\": 2, \"alma\": 8, \"gemela\": 3, \"querr\\u00e9\": 3, \"amo\": 73, \"enamore\": 1, \"vuelves\": 1, \"vuelvas\": 1, \"\\u00bfsabe\": 1, \"amar\\u00e9\": 3, \"apasionas\": 1, \"pasi\\u00f3n\": 1, \"seas\": 8, \"colado\": 1, \"hagamos\": 1, \"deber\\u00edamos\": 6, \"pedir\": 8, \"prometida\": 7, \"declarar\": 3, \"caserte\": 1, \"casarnos\": 7, \"prometido\": 7, \"cas\\u00e9monos\": 2, \"juntos\": 1, \"c\\u00e1sate\": 1, \"ser\\u00e1s\": 6, \"\\u00bfdeber\\u00edamos\": 1, \"comprometernos\": 1, \"boda\": 2, \"casarme\": 3, \"\\u00bfvamos\": 1, \"p\\u00eddeme\": 9, \"contemos\": 1, \"muero\": 20, \"tenemos\": 2, \"tendr\\u00edamos\": 1, \"unimos\": 1, \"decl\\u00e1rate\": 3, \"declararte\": 1, \"declares\": 4, \"tomar\\u00e1s\": 1, \"casamos\": 1, \"\\u00bfporqu\\u00e9\": 1, \"comprometemos\": 1, \"convertimos\": 1, \"convirtamos\": 2, \"casas\": 1, \"esperas\": 5, \"case\": 2, \"pide\": 1, \"imaginaras\": 42, \"falta\": 145, \"echado\": 95, \"estos\": 42, \"supieras\": 42, \"pensamientos\": 10, \"car\\u00e1cter\": 28, \"personalidad\": 28, \"enfadad\\u00edsimo\": 1, \"humo\": 2, \"uva\": 2, \"mosquead\\u00edsimo\": 1, \"mosqueo\": 6, \"llevo\": 13, \"cabreo\": 7, \"enfadad\\u00edsima\": 1, \"levantado\": 2, \"mosquead\\u00edsima\": 1, \"enfado\": 6, \"cabrad\\u00edsimo\": 1, \"mosqueado\": 2, \"mosqueada\": 2, \"cabread\\u00edsima\": 1, \"par\": 10, \"vuelvo\": 96, \"enseguida\": 10, \"vengo\": 95, \"unos\": 4, \"segundos\": 44, \"minutos\": 46, \"3\": 6, \"2\": 6, \"1\": 6, \"6\": 2, \"cincuenta\": 4, \"cuarenta\": 4, \"50\": 4, \"40\": 4, \"30\": 4, \"20\": 4, \"15\": 4, \"10\": 6, \"5\": 6, \"4\": 6, \"24\": 2, \"12\": 2, \"11\": 2, \"9\": 2, \"8\": 2, \"7\": 2, \"segundo\": 6, \"16\": 2, \"ratillo\": 2, \"ratito\": 2, \"ahorita\": 4, \"pero\": 2, \"volver\\u00e9\": 2, \"hastiado\": 38, \"hastiada\": 38, \"sintiendo\": 8, \"dichoso\": 4, \"plet\\u00f3rico\": 37, \"plet\\u00f3rica\": 37, \"afortunada\": 10, \"afortunado\": 10, \"dichosa\": 8, \"vac\\u00edo\": 3, \"estomacal\": 2, \"comerme\": 5, \"vaca\": 5, \"suena\": 6, \"agujero\": 6, \"barriga\": 10, \"meterme\": 3, \"llenarme\": 3, \"rugen\": 2, \"tripas\": 4, \"completa\": 2, \"tripa\": 12, \"vac\\u00eda\": 2, \"voraz\": 1, \"calambre\": 1, \"ruge\": 2, \"mortal\": 1, \"muriendo\": 4, \"desamayar\": 1, \"tanta\": 1, \"poquito\": 1, \"intestinos\": 1, \"quieren\": 5, \"uno\": 1, \"llenar\": 3, \"suenan\": 2, \"ombligo\": 1, \"pegado\": 1, \"espinazo\": 1, \"aprieta\": 3, \"verg\\u00fcenza\": 1, \"afloja\": 1, \"ciego\": 1, \"perdi\\u00f3\": 1, \"isla\": 1, \"borde\": 2, \"desmayarme\": 1, \"desamayo\": 1, \"m\\u00e9dico\": 3, \"boxeador\": 3, \"directora\": 3, \"arquitecto\": 3, \"asistenta\": 3, \"espa\\u00f1ola\": 3, \"paseadora\": 3, \"cuentista\": 3, \"enfermera\": 3, \"americano\": 2, \"ingeniero\": 3, \"mec\\u00e1nico\": 3, \"mec\\u00e1nica\": 3, \"monitora\": 3, \"boxeadora\": 3, \"enfermero\": 3, \"economista\": 3, \"alba\\u00f1il\": 3, \"fontanero\": 3, \"conductor\": 6, \"autob\\u00fas\": 3, \"camionera\": 3, \"camionero\": 3, \"secretario\": 3, \"izquierdas\": 3, \"centro\": 3, \"astronauta\": 3, \"piloto\": 3, \"ciclista\": 3, \"tenista\": 3, \"jugador\": 3, \"derechas\": 3, \"ingeniera\": 3, \"comunista\": 3, \"polic\\u00eda\": 3, \"cocinero\": 3, \"cocinera\": 3, \"ama\": 3, \"camarero\": 3, \"camarera\": 3, \"procurador\": 3, \"taxista\": 3, \"jefa\": 3, \"juez\": 3, \"tendera\": 3, \"abogada\": 3, \"tendero\": 3, \"procuradora\": 3, \"notario\": 3, \"notaria\": 3, \"limpiadora\": 3, \"paseador\": 3, \"abogado\": 3, \"pintora\": 3, \"arquitecta\": 3, \"dibujante\": 3, \"auxiliar\": 6, \"enfermer\\u00eda\": 3, \"veterinario\": 3, \"pintor\": 3, \"secretaria\": 3, \"asistente\": 3, \"personal\": 3, \"oftalm\\u00f3logo\": 3, \"oftalm\\u00f3loga\": 3, \"gestor\": 3, \"gestora\": 3, \"comercial\": 3, \"veterinaria\": 3, \"futbolista\": 3, \"odont\\u00f3logo\": 3, \"odont\\u00f3loga\": 3, \"dentista\": 3, \"espa\\u00f1ol\": 3, \"belga\": 3, \"franc\\u00e9s\": 3, \"francesa\": 3, \"italiano\": 2, \"estadounidense\": 2, \"ruso\": 2, \"rusa\": 2, \"alem\\u00e1n\": 2, \"hind\\u00fa\": 2, \"italiana\": 3, \"animalista\": 2, \"rica\": 2, \"taurino\": 2, \"antitaurino\": 2, \"rico\": 2, \"pretend\\u00eda\": 64, \"bromista\": 12, \"era\": 37, \"pitorreo\": 11, \"ganasada\": 10, \"bufonada\": 10, \"broma\": 18, \"vacilada\": 10, \"vacilona\": 7, \"tonter\\u00eda\": 10, \"mofa\": 11, \"guasa\": 11, \"vacile\": 10, \"trastada\": 10, \"inocentada\": 10, \"gastando\": 2, \"\\u00a1que\": 2, \"tomando\": 3, \"tomo\": 1, \"tomarte\": 1, \"payaso\": 1, \"cachondeo\": 1, \"bromeando\": 1, \"ganso\": 6, \"gansa\": 6, \"guas\\u00f3n\": 6, \"vacil\\u00f3n\": 7, \"buf\\u00f3n\": 1, \"sola\": 19, \"morir\": 20, \"cuesta\": 3, \"aislada\": 3, \"triste\": 44, \"solitario\": 5, \"caer\": 2, \"abandonada\": 1, \"abandonado\": 1, \"an\": 1, \"aislado\": 3, \"morir\\u00e9\": 2, \"solitaria\": 5, \"chavala\": 1, \"chaval\": 1, \"tremendamente\": 2, \"odia\": 3, \"odian\": 2, \"faltan\": 2, \"carezco\": 2, \"acuerda\": 1, \"piensa\": 1, \"chicos\": 1, \"chicas\": 1, \"ni\\u00f1as\": 1, \"quedado\": 4, \"nuevos\": 1, \"encontrara\": 3, \"preocupa\": 1, \"quisiera\": 2, \"confiar\": 2, \"trist\\u00edsimo\": 3, \"importo\": 3, \"pepino\": 1, \"trist\\u00edsima\": 3, \"pimiento\": 1, \"ven\": 1, \"invisible\": 3, \"importe\": 1, \"habla\": 1, \"nuevas\": 1, \"quedarme\": 4, \"aire\": 5, \"acondicionado\": 5, \"c\\u00e9sped\": 10, \"atardeceres\": 4, \"paseos\": 9, \"barrer\": 4, \"playa\": 4, \"coser\": 4, \"maquillarme\": 4, \"entrenar\": 4, \"limpiar\": 4, \"atardecer\": 4, \"oficina\": 9, \"ganar\": 4, \"tele\": 4, \"radio\": 4, \"yoga\": 4, \"ligar\": 4, \"obras\": 5, \"calefacci\\u00f3n\": 5, \"viajar\": 5, \"tren\": 5, \"transporte\": 5, \"p\\u00fablico\": 5, \"jardiner\\u00eda\": 5, \"tejer\": 5, \"sushi\": 5, \"libertad\": 5, \"orilla\": 5, \"mar\": 5, \"campo\": 5, \"flipan\": 9, \"fines\": 1, \"donuts\": 4, \"tiendas\": 4, \"camisetas\": 4, \"amaneceres\": 4, \"botones\": 1, \"mierda\": 9, \"baja\": 5, \"moral\": 5, \"depresivo\": 10, \"apenada\": 3, \"animara\": 1, \"baj\\u00f3n\": 10, \"infeliz\": 8, \"deprimida\": 5, \"deprimido\": 5, \"depre\": 5, \"tristeza\": 5, \"animar\": 2, \"rota\": 2, \"roto\": 2, \"partido\": 26, \"parte\": 1, \"pudiera\": 1, \"anime\": 3, \"animos\": 1, \"animarme\": 1, \"estuviera\": 2, \"animado\": 1, \"animada\": 1, \"pena\": 4, \"alica\\u00edda\": 1, \"alica\\u00eddo\": 1, \"capa\": 1, \"ca\\u00edda\": 1, \"bajonazo\": 2, \"bajona\": 1, \"trist\\u00f3n\": 2, \"depresiva\": 10, \"frustraci\\u00f3n\": 1, \"apenado\": 3, \"morri\\u00f1a\": 2, \"desapacible\": 2, \"sinto\": 1, \"melanc\\u00f3lica\": 2, \"melanc\\u00f3lico\": 2, \"rechazada\": 1, \"rechazado\": 1, \"nudo\": 2, \"garganta\": 1, \"depresi\\u00f3n\": 5, \"confianza\": 5, \"desesperanzada\": 2, \"desesperanzado\": 2, \"quedan\": 2, \"esperanzas\": 2, \"asco\": 2, \"hoyo\": 2, \"miserable\": 7, \"imposible\": 1, \"morirme\": 7, \"planeando\": 8, \"matarme\": 20, \"pegar\\u00eda\": 4, \"tiro\": 26, \"tirarme\": 17, \"puente\": 26, \"suicidarme\": 20, \"punto\": 17, \"bote\": 5, \"pastillas\": 7, \"ahorcar\": 6, \"venas\": 18, \"palmarla\": 4, \"pegarme\": 18, \"cuanto\": 7, \"ahogarme\": 13, \"tomar\\u00eda\": 2, \"motivos\": 1, \"lanzar\\u00eda\": 1, \"tirar\\u00eda\": 1, \"lanzarme\": 3, \"palmar\": 2, \"envenenarme\": 3, \"razones\": 1, \"intoxicarme\": 2, \"desde\": 1, \"muera\": 1, \"cometer\": 4, \"suicidio\": 4, \"quitarme\": 1, \"enmedio\": 1, \"desaparecer\": 2, \"mapa\": 1, \"sucidiarme\": 1, \"suicidar\": 3, \"termine\": 1, \"cortar\\u00e9\": 1, \"dispararme\": 1, \"termino\": 1, \"ilusi\\u00f3n\": 2, \"pozo\": 1, \"fondo\": 1, \"salidas\": 1, \"queda\": 1, \"salida\": 1, \"tantas\": 2, \"suicido\": 3, \"mato\": 2, \"esperanza\": 1, \"ahorcarme\": 12, \"quiera\": 1, \"cortar\\u00eda\": 1, \"planeo\": 12, \"precipicio\": 1, \"sufrimiento\": 1, \"pegar\": 4, \"suicidiar\": 1, \"caja\": 3, \"pasillas\": 1, \"entera\": 1, \"sien\": 3, \"lanzar\": 15, \"ahogar\\u00eda\": 2, \"nuca\": 3, \"morirse\": 2, \"ahorco\": 1, \"ojala\": 1, \"sobredosis\": 6, \"cortar\": 1, \"intentar\": 1, \"ahogar\": 1, \"tirar\": 1, \"bar\": 11, \"ido\": 26, \"zoo\": 5, \"supermercado\": 10, \"camino\": 39, \"aeropuerto\": 11, \"colegio\": 11, \"restaurante\": 12, \"avi\\u00f3n\": 7, \"polideportivo\": 7, \"curro\": 7, \"tienda\": 6, \"peluquer\\u00eda\": 6, \"jugando\": 2, \"comiendo\": 2, \"bebiendo\": 1, \"corriendo\": 1, \"camale\\u00f3n\": 2, \"turbia\": 1, \"sol\": 1, \"quema\": 1, \"zapatos\": 1, \"rojos\": 1, \"excursi\\u00f3n\": 5, \"teatro\": 5, \"escribirte\": 7, \"hablarte\": 6, \"oyes\": 1, \"testarte\": 14, \"preparada\": 6, \"preparado\": 14, \"probarte\": 21, \"pruebas\": 17, \"test\": 27, \"testearte\": 15, \"probando\": 8, \"testear\": 2, \"testando\": 1, \"\\u00bffuncionas\": 2, \"\\u00bfesto\": 3, 