{"class_name": "Tokenizer", "config": {"num_words": null, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": null, "document_count": 19, "word_counts": "{\"hola\": 1, \"\\u00bfc\\u00f3mo\": 2, \"est\\u00e1s\": 2, \"\\u00bfqu\\u00e9\": 4, \"haces\": 1, \"adi\\u00f3s\": 1, \"\\u00bfcu\\u00e1l\": 3, \"es\": 5, \"tu\": 3, \"nombre\": 1, \"d\\u00eda\": 1, \"hoy\": 1, \"cu\\u00e9ntame\": 1, \"un\": 2, \"chiste\": 1, \"\\u00bfd\\u00f3nde\": 1, \"te\": 1, \"gusta\": 1, \"hacer\": 1, \"gracias\": 1, \"buenos\": 1, \"d\\u00edas\": 1, \"buenas\": 1, \"noches\": 1, \"color\": 1, \"favorito\": 1, \"\\u00bfpuedes\": 1, \"ayudarme\": 1, \"funciona\": 1, \"esto\": 1, \"dime\": 1, \"algo\": 1, \"interesante\": 1, \"hora\": 1, \"recomi\\u00e9ndame\": 1, \"libro\": 1, \"comida\": 1, \"favorita\": 1}", "word_docs": "{\"hola\": 1, \"\\u00bfc\\u00f3mo\": 2, \"est\\u00e1s\": 2, \"\\u00bfqu\\u00e9\": 4, \"haces\": 1, \"adi\\u00f3s\": 1, \"es\": 5, \"\\u00bfcu\\u00e1l\": 3, \"tu\": 3, \"nombre\": 1, \"d\\u00eda\": 1, \"hoy\": 1, \"chiste\": 1, \"un\": 2, \"cu\\u00e9ntame\": 1, \"\\u00bfd\\u00f3nde\": 1, \"hacer\": 1, \"gusta\": 1, \"te\": 1, \"gracias\": 1, \"buenos\": 1, \"d\\u00edas\": 1, \"noches\": 1, \"buenas\": 1, \"favorito\": 1, \"color\": 1, \"ayudarme\": 1, \"\\u00bfpuedes\": 1, \"funciona\": 1, \"esto\": 1, \"dime\": 1, \"algo\": 1, \"interesante\": 1, \"hora\": 1, \"recomi\\u00e9ndame\": 1, \"libro\": 1, \"favorita\": 1, \"comida\": 1}", "index_docs": "{\"8\": 1, \"5\": 2, \"6\": 2, \"2\": 4, \"9\": 1, \"10\": 1, \"1\": 5, \"3\": 3, \"4\": 3, \"11\": 1, \"12\": 1, \"13\": 1, \"15\": 1, \"7\": 2, \"14\": 1, \"16\": 1, \"19\": 1, \"18\": 1, \"17\": 1, \"20\": 1, \"21\": 1, \"22\": 1, \"24\": 1, \"23\": 1, \"26\": 1, \"25\": 1, \"28\": 1, \"27\": 1, \"29\": 1, \"30\": 1, \"31\": 1, \"32\": 1, \"33\": 1, \"34\": 1, \"35\": 1, \"36\": 1, \"38\": 1, \"37\": 1}", "index_word": "{\"1\": \"es\", \"2\": \"\\u00bfqu\\u00e9\", \"3\": \"\\u00bfcu\\u00e1l\", \"4\": \"tu\", \"5\": \"\\u00bfc\\u00f3mo\", \"6\": \"est\\u00e1s\", \"7\": \"un\", \"8\": \"hola\", \"9\": \"haces\", \"10\": \"adi\\u00f3s\", \"11\": \"nombre\", \"12\": \"d\\u00eda\", \"13\": \"hoy\", \"14\": \"cu\\u00e9ntame\", \"15\": \"chiste\", \"16\": \"\\u00bfd\\u00f3nde\", \"17\": \"te\", \"18\": \"gusta\", \"19\": \"hacer\", \"20\": \"gracias\", \"21\": \"buenos\", \"22\": \"d\\u00edas\", \"23\": \"buenas\", \"24\": \"noches\", \"25\": \"color\", \"26\": \"favorito\", \"27\": \"\\u00bfpuedes\", \"28\": \"ayudarme\", \"29\": \"funciona\", \"30\": \"esto\", \"31\": \"dime\", \"32\": \"algo\", \"33\": \"interesante\", \"34\": \"hora\", \"35\": \"recomi\\u00e9ndame\", \"36\": \"libro\", \"37\": \"comida\", \"38\": \"favorita\"}", "word_index": "{\"es\": 1, \"\\u00bfqu\\u00e9\": 2, \"\\u00bfcu\\u00e1l\": 3, \"tu\": 4, \"\\u00bfc\\u00f3mo\": 5, \"est\\u00e1s\": 6, \"un\": 7, \"hola\": 8, \"haces\": 9, \"adi\\u00f3s\": 10, \"nombre\": 11, \"d\\u00eda\": 12, \"hoy\": 13, \"cu\\u00e9ntame\": 14, \"chiste\": 15, \"\\u00bfd\\u00f3nde\": 16, \"te\": 17, \"gusta\": 18, \"hacer\": 19, \"gracias\": 20, \"buenos\": 21, \"d\\u00edas\": 22, \"buenas\": 23, \"noches\": 24, \"color\": 25, \"favorito\": 26, \"\\u00bfpuedes\": 27, \"ayudarme\": 28, \"funciona\": 29, \"esto\": 30, \"dime\": 31, \"algo\": 32, \"interesante\": 33, \"hora\": 34, \"recomi\\u00e9ndame\": 35, \"libro\": 36, \"comida\": 37, \"favorita\": 38}"}}