{"class_name": "Tokenizer", "config": {"num_words": null, "filters": "", "lower": true, "split": " ", "char_level": false, "oov_token": null, "document_count": 19313, "word_counts": "{\"<start>\": 19313, \"en\": 1098, \"realidad,\": 276, \"no\": 4785, \"tengo\": 1751, \"edad.\": 276, \"los\": 337, \"bots\": 276, \"cumplimos\": 276, \"a\\u00f1os.\": 276, \"<end>\": 19313, \"se\": 751, \"me\": 3208, \"da\": 208, \"mejor\": 208, \"responder.\": 208, \"el\": 1106, \"hardware\": 291, \"necesario\": 291, \"para\": 725, \"eso.\": 291, \"tocado\": 264, \"y\": 822, \"hundido.\": 264, \"la\": 1270, \"verdad\": 259, \"es\": 2024, \"que\": 3609, \"dependo\": 259, \"de\": 1559, \"nadie.\": 259, \"eso\": 283, \"est\\u00e1\": 523, \"entre\": 283, \"mis\": 573, \"talentos.\": 283, \"estoy\": 979, \"aqu\\u00ed\": 667, \"charlar\": 267, \"ayudarte.\": 267, \"crearon\": 291, \"personas.\": 291, \"vengo\": 288, \"una\": 1300, \"larga\": 288, \"saga\": 288, \"c\\u00f3digo.\": 288, \"familia.\": 288, \"soy\": 945, \"un\": 1866, \"bot.\": 66, \"\\u00a1soy\": 291, \"tan\": 291, \"feliz!\": 291, \"solo\": 210, \"alimento\": 210, \"conocimiento.\": 210, \"he\": 947, \"conocido\": 269, \"a\": 1151, \"ning\\u00fan\": 269, \"otro\": 559, \"bot,\": 269, \"pero\": 1532, \"seguro\": 269, \"nos\": 533, \"llevar\\u00edamos\": 269, \"bien.\": 557, \"gustan\": 286, \"tantas\": 286, \"cosas...\": 286, \"ahora\": 148, \"lo\": 2596, \"pienso...\": 148, \"nombre.\": 148, \"nada\": 581, \"claro.\": 291, \"o\\u00eddo\": 574, \"amor\": 284, \"mueve\": 284, \"monta\\u00f1as.\": 284, \"si\": 725, \"supiera,\": 268, \"te\": 3124, \"dir\\u00eda.\": 268, \"ganas\": 291, \"por\": 1090, \"goleada...\": 291, \"sabes.\": 291, \"esto\": 683, \"fuera\": 290, \"concurso\": 290, \"(que\": 290, \"es),\": 290, \"ganar\\u00edas\": 290, \"t\\u00fa.\": 290, \"tecnolog\\u00eda\": 291, \"mi\": 693, \"mundo.\": 291, \"veo,\": 291, \"gusta\": 953, \"c\\u00f3mo\": 291, \"eres.\": 291, \"escucha\": 291, \"tu\": 360, \"coraz\\u00f3n.\": 291, \"compartimos\": 264, \"cosa:\": 264, \"hacerte\": 264, \"vida\": 264, \"m\\u00e1s\": 264, \"f\\u00e1cil.\": 264, \"claro\": 189, \"no.\": 189, \"momentos.\": 290, \"\\u00fanico\": 150, \"compromiso\": 150, \"amistad.\": 150, \"estoy.\": 400, \"respuesta\": 167, \"cada\": 167, \"pregunta.\": 167, \"quieres\": 167, \"escuchar\": 167, \"algo\": 167, \"distinto,\": 167, \"pregunta\": 167, \"otra\": 167, \"cosa.\": 167, \"bot\": 297, \"creado\": 297, \"humanos.\": 297, \"digital,\": 292, \"as\\u00ed\": 292, \"simplemente\": 292, \"aqu\\u00ed.\": 292, \"b\\u00e1sicamente\": 291, \"esto.\": 291, \"oh,\": 291, \"vaya.\": 291, \"\\u00bfqu\\u00e9\": 581, \"le\": 290, \"dice\": 290, \"chinche\": 290, \"chinche?\": 290, \"quiero\": 290, \"chincheramente.\": 290, \"hace\": 291, \"abeja\": 291, \"gimnasio?\": 291, \"zumba.\": 291, \"dif\\u00edcil\": 291, \"tener\": 291, \"gracia\": 291, \"bajo\": 291, \"demanda,\": 291, \"quiz\\u00e1\": 291, \"sorprenda\": 291, \"momento\": 291, \"menos\": 291, \"pensado.\": 291, \"vale,\": 145, \"callo.\": 145, \"na,\": 786, \"nana,\": 786, \"nanan\\u00e1.\": 393, \"todo\": 393, \"puedo\": 393, \"dar.\": 393, \"vas\": 61, \"hacer\": 61, \"suban\": 61, \"colores.\": 61, \"podr\\u00edamos\": 272, \"decir\": 272, \"\\\"en\": 272, \"construcci\\u00f3n\\\".\": 272, \"ve\": 252, \"hoy\": 252, \"d\\u00eda.\": 252, \"como\": 572, \"soy.\": 282, \"\\u00a1lo\": 113, \"siento!\": 113, \"guay.\": 580, \"alegro\": 170, \"haga\": 170, \"gracia.\": 170, \"preocupes.\": 161, \"creo\": 335, \"puedo.\": 547, \"\\u00a1guay!\": 154, \"\\u00a1no\": 161, \"pasa\": 161, \"nada!\": 161, \"genial.\": 416, \"sigo...\": 63, \"hasta\": 217, \"luego.\": 217, \"\\u00a1hey!\": 155, \"\\u00a1buenas\": 59, \"tardes!\": 59, \"\\u00a1buenos\": 66, \"d\\u00edas\": 66, \"ma\\u00f1ana!\": 166, \"\\u00a1hasta\": 297, \"gracias\": 148, \"preguntar.\": 148, \"muy\": 288, \"\\u00a1gracias\": 288, \"preguntar!\": 288, \"placer.\": 97, \"yo,\": 290, \"saludar\\u00e9\": 290, \"igualmente.\": 290, \"\\u00a1hola!\": 578, \"\\u00a1gracias!\": 103, \"\\u00a1igualmente!\": 103, \"poca\": 146, \"novedad.\": 146, \"encantar\\u00eda,\": 275, \"best\": 118, \"friends\": 118, \"forever!\": 118, \"\\u00a1me\": 471, \"encantas!\": 183, \"mando\": 219, \"abrazo\": 433, \"virtual.\": 433, \"conozco\": 116, \"tanto,\": 116, \"hablar\": 116, \"contigo.\": 116, \"tienes\": 69, \"encanto.\": 69, \"gracias.\": 191, \"mismo\": 191, \"digo.\": 191, \"eres\": 276, \"amor.\": 102, \"yo\": 67, \"tambi\\u00e9n\": 67, \"quiero.\": 67, \"reconozco\": 104, \"visto\": 104, \"venir...\": 104, \"s\\u00e9,\": 291, \"ha\": 291, \"hecho\": 291, \"eterno.\": 291, \"vaya,\": 61, \"siento.\": 61, \"luego!\": 197, \"menuda\": 275, \"faena.\": 275, \"alegro!\": 288, \"hora\": 104, \"picar\": 104, \"algo.\": 104, \"vale.\": 289, \"bueno\": 284, \"saberlo.\": 284, \"gran\": 148, \"encanta\": 291, \"encante.\": 291, \"env\\u00edo\": 214, \"s\\u00faper\": 214, \"tel\\u00e9fono\": 240, \"esperanza\": 240, \"disponible\": 240, \"cualquier\": 240, \"hora.\": 240, \"llama\": 240, \"al\": 240, \"717\": 480, \"003\": 240, \"o\": 240, \"entra\": 240, \"https://www.telefonodelaesperanza.org/prevencion-del-suicidio.\": 240, \"ya\": 244, \"veo\": 244, \"hay\": 290, \"buena\": 290, \"siesta.\": 290}", "word_docs": "{\"tengo\": 1751, \"cumplimos\": 276, \"<end>\": 19313, \"realidad,\": 276, \"bots\": 276, \"los\": 337, \"en\": 1098, \"edad.\": 276, \"<start>\": 19313, \"no\": 4509, \"a\\u00f1os.\": 276, \"me\": 3208, \"responder.\": 208, \"da\": 208, \"se\": 751, \"mejor\": 208, \"hardware\": 291, \"el\": 1106, \"para\": 725, \"necesario\": 291, \"eso.\": 291, \"y\": 822, \"hundido.\": 264, \"tocado\": 264, \"verdad\": 259, \"de\": 1271, \"es\": 2024, \"que\": 3609, \"la\": 1270, \"nadie.\": 259, \"dependo\": 259, \"est\\u00e1\": 523, \"entre\": 283, \"eso\": 283, \"mis\": 573, \"talentos.\": 283, \"charlar\": 267, \"ayudarte.\": 267, \"estoy\": 979, \"aqu\\u00ed\": 667, \"personas.\": 291, \"crearon\": 291, \"c\\u00f3digo.\": 288, \"larga\": 288, \"vengo\": 288, \"familia.\": 288, \"una\": 1300, \"saga\": 288, \"bot.\": 66, \"un\": 1866, \"soy\": 945, \"\\u00a1soy\": 291, \"feliz!\": 291, \"tan\": 291, \"alimento\": 210, \"conocimiento.\": 210, \"solo\": 210, \"he\": 947, \"llevar\\u00edamos\": 269, \"pero\": 1532, \"a\": 1151, \"bien.\": 557, \"ning\\u00fan\": 269, \"otro\": 559, \"bot,\": 269, \"conocido\": 269, \"nos\": 533, \"seguro\": 269, \"gustan\": 286, \"tantas\": 286, \"cosas...\": 286, \"ahora\": 148, \"nombre.\": 148, \"lo\": 2328, \"pienso...\": 148, \"nada\": 581, \"claro.\": 291, \"o\\u00eddo\": 574, \"amor\": 284, \"monta\\u00f1as.\": 284, \"mueve\": 284, \"te\": 3124, \"supiera,\": 268, \"dir\\u00eda.\": 268, \"si\": 725, \"goleada...\": 291, \"ganas\": 291, \"sabes.\": 291, \"por\": 1090, \"t\\u00fa.\": 290, \"concurso\": 290, \"es),\": 290, \"(que\": 290, \"esto\": 683, \"fuera\": 290, \"ganar\\u00edas\": 290, \"tecnolog\\u00eda\": 291, \"mundo.\": 291, \"mi\": 693, \"eres.\": 291, \"c\\u00f3mo\": 291, \"veo,\": 291, \"gusta\": 953, \"coraz\\u00f3n.\": 291, \"escucha\": 291, \"tu\": 360, \"cosa:\": 264, \"vida\": 264, \"hacerte\": 264, \"compartimos\": 264, \"f\\u00e1cil.\": 264, \"m\\u00e1s\": 264, \"claro\": 189, \"no.\": 189, \"momentos.\": 290, \"compromiso\": 150, \"amistad.\": 150, \"\\u00fanico\": 150, \"estoy.\": 400, \"cada\": 167, \"cosa.\": 167, \"escuchar\": 167, \"pregunta\": 167, \"otra\": 167, \"algo\": 167, \"quieres\": 167, \"respuesta\": 167, \"pregunta.\": 167, \"distinto,\": 167, \"bot\": 297, \"creado\": 297, \"humanos.\": 297, \"digital,\": 292, \"as\\u00ed\": 292, \"simplemente\": 292, \"aqu\\u00ed.\": 292, \"esto.\": 291, \"b\\u00e1sicamente\": 291, \"vaya.\": 291, \"oh,\": 291, \"dice\": 290, \"quiero\": 290, \"chinche?\": 290, \"chinche\": 290, \"\\u00bfqu\\u00e9\": 581, \"chincheramente.\": 290, \"le\": 290, \"abeja\": 291, \"hace\": 291, \"gimnasio?\": 291, \"zumba.\": 291, \"gracia\": 291, \"momento\": 291, \"bajo\": 291, \"tener\": 291, \"menos\": 291, \"pensado.\": 291, \"quiz\\u00e1\": 291, \"dif\\u00edcil\": 291, \"demanda,\": 291, \"sorprenda\": 291, \"vale,\": 145, \"callo.\": 145, \"dar.\": 393, \"puedo\": 393, \"todo\": 393, \"nanan\\u00e1.\": 393, \"nana,\": 393, \"na,\": 393, \"suban\": 61, \"vas\": 61, \"hacer\": 61, \"colores.\": 61, \"decir\": 272, \"construcci\\u00f3n\\\".\": 272, \"podr\\u00edamos\": 272, \"\\\"en\": 272, \"hoy\": 252, \"ve\": 252, \"d\\u00eda.\": 252, \"como\": 572, \"soy.\": 282, \"\\u00a1lo\": 113, \"siento!\": 113, \"guay.\": 580, \"haga\": 170, \"alegro\": 170, \"gracia.\": 170, \"preocupes.\": 161, \"puedo.\": 547, \"creo\": 335, \"\\u00a1guay!\": 154, \"\\u00a1no\": 161, \"nada!\": 161, \"pasa\": 161, \"genial.\": 416, \"sigo...\": 63, \"hasta\": 217, \"luego.\": 217, \"\\u00a1hey!\": 155, \"\\u00a1buenas\": 59, \"tardes!\": 59, \"d\\u00edas\": 66, \"\\u00a1buenos\": 66, \"ma\\u00f1ana!\": 166, \"\\u00a1hasta\": 297, \"gracias\": 148, \"preguntar.\": 148, \"preguntar!\": 288, \"muy\": 288, \"\\u00a1gracias\": 288, \"placer.\": 97, \"igualmente.\": 290, \"saludar\\u00e9\": 290, \"\\u00a1hola!\": 578, \"yo,\": 290, \"\\u00a1igualmente!\": 103, \"\\u00a1gracias!\": 103, \"poca\": 146, \"novedad.\": 146, \"encantar\\u00eda,\": 275, \"forever!\": 118, \"friends\": 118, \"best\": 118, \"\\u00a1me\": 471, \"encantas!\": 183, \"virtual.\": 433, \"mando\": 219, \"abrazo\": 433, \"hablar\": 116, \"contigo.\": 116, \"conozco\": 116, \"tanto,\": 116, \"encanto.\": 69, \"tienes\": 69, \"digo.\": 191, \"mismo\": 191, \"gracias.\": 191, \"eres\": 276, \"amor.\": 102, \"quiero.\": 67, \"yo\": 67, \"tambi\\u00e9n\": 67, \"visto\": 104, \"venir...\": 104, \"reconozco\": 104, \"eterno.\": 291, \"ha\": 291, \"s\\u00e9,\": 291, \"hecho\": 291, \"siento.\": 61, \"vaya,\": 61, \"luego!\": 197, \"faena.\": 275, \"menuda\": 275, \"alegro!\": 288, \"hora\": 104, \"picar\": 104, \"algo.\": 104, \"vale.\": 289, \"saberlo.\": 284, \"bueno\": 284, \"gran\": 148, \"encante.\": 291, \"encanta\": 291, \"env\\u00edo\": 214, \"s\\u00faper\": 214, \"esperanza\": 240, \"o\": 240, \"https://www.telefonodelaesperanza.org/prevencion-del-suicidio.\": 240, \"cualquier\": 240, \"hora.\": 240, \"llama\": 240, \"003\": 240, \"entra\": 240, \"tel\\u00e9fono\": 240, \"disponible\": 240, \"al\": 240, \"717\": 240, \"veo\": 244, \"ya\": 244, \"siesta.\": 290, \"buena\": 290, \"hay\": 290}", "index_docs": "{\"10\": 1751, \"152\": 276, \"2\": 19313, \"149\": 276, \"151\": 276, \"55\": 337, \"17\": 1098, \"150\": 276, \"1\": 19313, \"3\": 4509, \"153\": 276, \"5\": 3208, \"208\": 208, \"206\": 208, \"26\": 751, \"207\": 208, \"65\": 291, \"16\": 1106, \"27\": 725, \"66\": 291, \"67\": 291, \"23\": 822, \"172\": 264, \"171\": 264, \"179\": 259, \"11\": 1271, \"8\": 2024, \"4\": 3609, \"14\": 1270, \"181\": 259, \"180\": 259, \"43\": 523, \"146\": 283, \"145\": 283, \"37\": 573, \"147\": 283, \"169\": 267, \"170\": 267, \"19\": 979, \"31\": 667, \"69\": 291, \"68\": 291, \"131\": 288, \"129\": 288, \"128\": 288, \"132\": 288, \"13\": 1300, \"130\": 288, \"273\": 66, \"9\": 1866, \"22\": 945, \"70\": 291, \"72\": 291, \"71\": 291, \"204\": 210, \"205\": 210, \"203\": 210, \"21\": 947, \"166\": 269, \"12\": 1532, \"15\": 1151, \"40\": 557, \"163\": 269, \"39\": 559, \"164\": 269, \"162\": 269, \"42\": 533, \"165\": 269, \"137\": 286, \"138\": 286, \"139\": 286, \"239\": 148, \"241\": 148, \"7\": 2328, \"240\": 148, \"32\": 581, \"73\": 291, \"36\": 574, \"140\": 284, \"142\": 284, \"141\": 284, \"6\": 3124, \"167\": 268, \"168\": 268, \"28\": 725, \"75\": 291, \"74\": 291, \"76\": 291, \"18\": 1090, \"113\": 290, \"109\": 290, \"111\": 290, \"110\": 290, \"30\": 683, \"108\": 290, \"112\": 290, \"77\": 291, \"78\": 291, \"29\": 693, \"81\": 291, \"80\": 291, \"79\": 291, \"20\": 953, \"83\": 291, \"82\": 291, \"54\": 360, \"174\": 264, \"176\": 264, \"175\": 264, \"173\": 264, \"178\": 264, \"177\": 264, \"213\": 189, \"214\": 189, \"114\": 290, \"237\": 150, \"238\": 150, \"236\": 150, \"49\": 400, \"220\": 167, \"228\": 167, \"223\": 167, \"226\": 167, \"227\": 167, \"224\": 167, \"222\": 167, \"219\": 167, \"221\": 167, \"225\": 167, \"57\": 297, \"58\": 297, \"59\": 297, \"61\": 292, \"62\": 292, \"63\": 292, \"64\": 292, \"85\": 291, \"84\": 291, \"87\": 291, \"86\": 291, \"116\": 290, \"119\": 290, \"118\": 290, \"117\": 290, \"33\": 581, \"120\": 290, \"115\": 290, \"89\": 291, \"88\": 291, \"90\": 291, \"91\": 291, \"94\": 291, \"99\": 291, \"95\": 291, \"93\": 291, \"100\": 291, \"101\": 291, \"97\": 291, \"92\": 291, \"96\": 291, \"98\": 291, \"247\": 145, \"248\": 145, \"53\": 393, \"52\": 393, \"51\": 393, \"50\": 393, \"25\": 393, \"24\": 393, \"279\": 61, \"277\": 61, \"278\": 61, \"280\": 61, \"159\": 272, \"161\": 272, \"158\": 272, \"160\": 272, \"183\": 252, \"182\": 252, \"184\": 252, \"38\": 572, \"148\": 282, \"256\": 113, \"257\": 113, \"34\": 580, \"217\": 170, \"216\": 170, \"218\": 170, \"230\": 161, \"41\": 547, \"56\": 335, \"235\": 154, \"231\": 161, \"233\": 161, \"232\": 161, \"48\": 416, \"276\": 63, \"199\": 217, \"200\": 217, \"234\": 155, \"283\": 59, \"284\": 59, \"275\": 66, \"274\": 66, \"229\": 166, \"60\": 297, \"242\": 148, \"243\": 148, \"135\": 288, \"133\": 288, \"134\": 288, \"267\": 97, \"123\": 290, \"122\": 290, \"35\": 578, \"121\": 290, \"265\": 103, \"264\": 103, \"245\": 146, \"246\": 146, \"155\": 275, \"251\": 118, \"250\": 118, \"249\": 118, \"45\": 471, \"215\": 183, \"47\": 433, \"198\": 219, \"46\": 433, \"254\": 116, \"255\": 116, \"252\": 116, \"253\": 116, \"269\": 69, \"268\": 69, \"212\": 191, \"211\": 191, \"210\": 191, \"154\": 276, \"266\": 102, \"272\": 67, \"270\": 67, \"271\": 67, \"259\": 104, \"260\": 104, \"258\": 104, \"105\": 291, \"103\": 291, \"102\": 291, \"104\": 291, \"282\": 61, \"281\": 61, \"209\": 197, \"157\": 275, \"156\": 275, \"136\": 288, \"261\": 104, \"262\": 104, \"263\": 104, \"127\": 289, \"144\": 284, \"143\": 284, \"244\": 148, \"107\": 291, \"106\": 291, \"201\": 214, \"202\": 214, \"188\": 240, \"195\": 240, \"197\": 240, \"190\": 240, \"191\": 240, \"192\": 240, \"194\": 240, \"196\": 240, \"187\": 240, \"189\": 240, \"193\": 240, \"44\": 240, \"186\": 244, \"185\": 244, \"126\": 290, \"125\": 290, \"124\": 290}", "index_word": "{\"1\": \"<start>\", \"2\": \"<end>\", \"3\": \"no\", \"4\": \"que\", \"5\": \"me\", \"6\": \"te\", \"7\": \"lo\", \"8\": \"es\", \"9\": \"un\", \"10\": \"tengo\", \"11\": \"de\", \"12\": \"pero\", \"13\": \"una\", \"14\": \"la\", \"15\": \"a\", \"16\": \"el\", \"17\": \"en\", \"18\": \"por\", \"19\": \"estoy\", \"20\": \"gusta\", \"21\": \"he\", \"22\": \"soy\", \"23\": \"y\", \"24\": \"na,\", \"25\": \"nana,\", \"26\": \"se\", \"27\": \"para\", \"28\": \"si\", \"29\": \"mi\", \"30\": \"esto\", \"31\": \"aqu\\u00ed\", \"32\": \"nada\", \"33\": \"\\u00bfqu\\u00e9\", \"34\": \"guay.\", \"35\": \"\\u00a1hola!\", \"36\": \"o\\u00eddo\", \"37\": \"mis\", \"38\": \"como\", \"39\": \"otro\", \"40\": \"bien.\", \"41\": \"puedo.\", \"42\": \"nos\", \"43\": \"est\\u00e1\", \"44\": \"717\", \"45\": \"\\u00a1me\", \"46\": \"abrazo\", \"47\": \"virtual.\", \"48\": \"genial.\", \"49\": \"estoy.\", \"50\": \"nanan\\u00e1.\", \"51\": \"todo\", \"52\": \"puedo\", \"53\": \"dar.\", \"54\": \"tu\", \"55\": \"los\", \"56\": \"creo\", \"57\": \"bot\", \"58\": \"creado\", \"59\": \"humanos.\", \"60\": \"\\u00a1hasta\", \"61\": \"digital,\", \"62\": \"as\\u00ed\", \"63\": \"simplemente\", \"64\": \"aqu\\u00ed.\", \"65\": \"hardware\", \"66\": \"necesario\", \"67\": \"eso.\", \"68\": \"crearon\", \"69\": \"personas.\", \"70\": \"\\u00a1soy\", \"71\": \"tan\", \"72\": \"feliz!\", \"73\": \"claro.\", \"74\": \"ganas\", \"75\": \"goleada...\", \"76\": \"sabes.\", \"77\": \"tecnolog\\u00eda\", \"78\": \"mundo.\", \"79\": \"veo,\", \"80\": \"c\\u00f3mo\", \"81\": \"eres.\", \"82\": \"escucha\", \"83\": \"coraz\\u00f3n.\", \"84\": \"b\\u00e1sicamente\", \"85\": \"esto.\", \"86\": \"oh,\", \"87\": \"vaya.\", \"88\": \"hace\", \"89\": \"abeja\", \"90\": \"gimnasio?\", \"91\": \"zumba.\", \"92\": \"dif\\u00edcil\", \"93\": \"tener\", \"94\": \"gracia\", \"95\": \"bajo\", \"96\": \"demanda,\", \"97\": \"quiz\\u00e1\", \"98\": \"sorprenda\", \"99\": \"momento\", \"100\": \"menos\", \"101\": \"pensado.\", \"102\": \"s\\u00e9,\", \"103\": \"ha\", \"104\": \"hecho\", \"105\": \"eterno.\", \"106\": \"encanta\", \"107\": \"encante.\", \"108\": \"fuera\", \"109\": \"concurso\", \"110\": \"(que\", \"111\": \"es),\", \"112\": \"ganar\\u00edas\", \"113\": \"t\\u00fa.\", \"114\": \"momentos.\", \"115\": \"le\", \"116\": \"dice\", \"117\": \"chinche\", \"118\": \"chinche?\", \"119\": \"quiero\", \"120\": \"chincheramente.\", \"121\": \"yo,\", \"122\": \"saludar\\u00e9\", \"123\": \"igualmente.\", \"124\": \"hay\", \"125\": \"buena\", \"126\": \"siesta.\", \"127\": \"vale.\", \"128\": \"vengo\", \"129\": \"larga\", \"130\": \"saga\", \"131\": \"c\\u00f3digo.\", \"132\": \"familia.\", \"133\": \"muy\", \"134\": \"\\u00a1gracias\", \"135\": \"preguntar!\", \"136\": \"alegro!\", \"137\": \"gustan\", \"138\": \"tantas\", \"139\": \"cosas...\", \"140\": \"amor\", \"141\": \"mueve\", \"142\": \"monta\\u00f1as.\", \"143\": \"bueno\", \"144\": \"saberlo.\", \"145\": \"eso\", \"146\": \"entre\", \"147\": \"talentos.\", \"148\": \"soy.\", \"149\": \"realidad,\", \"150\": \"edad.\", \"151\": \"bots\", \"152\": \"cumplimos\", \"153\": \"a\\u00f1os.\", \"154\": \"eres\", \"155\": \"encantar\\u00eda,\", \"156\": \"menuda\", \"157\": \"faena.\", \"158\": \"podr\\u00edamos\", \"159\": \"decir\", \"160\": \"\\\"en\", \"161\": \"construcci\\u00f3n\\\".\", \"162\": \"conocido\", \"163\": \"ning\\u00fan\", \"164\": \"bot,\", \"165\": \"seguro\", \"166\": \"llevar\\u00edamos\", \"167\": \"supiera,\", \"168\": \"dir\\u00eda.\", \"169\": \"charlar\", \"170\": \"ayudarte.\", \"171\": \"tocado\", \"172\": \"hundido.\", \"173\": \"compartimos\", \"174\": \"cosa:\", \"175\": \"hacerte\", \"176\": \"vida\", \"177\": \"m\\u00e1s\", \"178\": \"f\\u00e1cil.\", \"179\": \"verdad\", \"180\": \"dependo\", \"181\": \"nadie.\", \"182\": \"ve\", \"183\": \"hoy\", \"184\": \"d\\u00eda.\", \"185\": \"ya\", \"186\": \"veo\", \"187\": \"tel\\u00e9fono\", \"188\": \"esperanza\", \"189\": \"disponible\", \"190\": \"cualquier\", \"191\": \"hora.\", \"192\": \"llama\", \"193\": \"al\", \"194\": \"003\", \"195\": \"o\", \"196\": \"entra\", \"197\": \"https://www.telefonodelaesperanza.org/prevencion-del-suicidio.\", \"198\": \"mando\", \"199\": \"hasta\", \"200\": \"luego.\", \"201\": \"env\\u00edo\", \"202\": \"s\\u00faper\", \"203\": \"solo\", \"204\": \"alimento\", \"205\": \"conocimiento.\", \"206\": \"da\", \"207\": \"mejor\", \"208\": \"responder.\", \"209\": \"luego!\", \"210\": \"gracias.\", \"211\": \"mismo\", \"212\": \"digo.\", \"213\": \"claro\", \"214\": \"no.\", \"215\": \"encantas!\", \"216\": \"alegro\", \"217\": \"haga\", \"218\": \"gracia.\", \"219\": \"respuesta\", \"220\": \"cada\", \"221\": \"pregunta.\", \"222\": \"quieres\", \"223\": \"escuchar\", \"224\": \"algo\", \"225\": \"distinto,\", \"226\": \"pregunta\", \"227\": \"otra\", \"228\": \"cosa.\", \"229\": \"ma\\u00f1ana!\", \"230\": \"preocupes.\", \"231\": \"\\u00a1no\", \"232\": \"pasa\", \"233\": \"nada!\", \"234\": \"\\u00a1hey!\", \"235\": \"\\u00a1guay!\", \"236\": \"\\u00fanico\", \"237\": \"compromiso\", \"238\": \"amistad.\", \"239\": \"ahora\", \"240\": \"pienso...\", \"241\": \"nombre.\", \"242\": \"gracias\", \"243\": \"preguntar.\", \"244\": \"gran\", \"245\": \"poca\", \"246\": \"novedad.\", \"247\": \"vale,\", \"248\": \"callo.\", \"249\": \"best\", \"250\": \"friends\", \"251\": \"forever!\", \"252\": \"conozco\", \"253\": \"tanto,\", \"254\": \"hablar\", \"255\": \"contigo.\", \"256\": \"\\u00a1lo\", \"257\": \"siento!\", \"258\": \"reconozco\", \"259\": \"visto\", \"260\": \"venir...\", \"261\": \"hora\", \"262\": \"picar\", \"263\": \"algo.\", \"264\": \"\\u00a1gracias!\", \"265\": \"\\u00a1igualmente!\", \"266\": \"amor.\", \"267\": \"placer.\", \"268\": \"tienes\", \"269\": \"encanto.\", \"270\": \"yo\", \"271\": \"tambi\\u00e9n\", \"272\": \"quiero.\", \"273\": \"bot.\", \"274\": \"\\u00a1buenos\", \"275\": \"d\\u00edas\", \"276\": \"sigo...\", \"277\": \"vas\", \"278\": \"hacer\", \"279\": \"suban\", \"280\": \"colores.\", \"281\": \"vaya,\", \"282\": \"siento.\", \"283\": \"\\u00a1buenas\", \"284\": \"tardes!\"}", "word_index": "{\"<start>\": 1, \"<end>\": 2, \"no\": 3, \"que\": 4, \"me\": 5, \"te\": 6, \"lo\": 7, \"es\": 8, \"un\": 9, \"tengo\": 10, \"de\": 11, \"pero\": 12, \"una\": 13, \"la\": 14, \"a\": 15, \"el\": 16, \"en\": 17, \"por\": 18, \"estoy\": 19, \"gusta\": 20, \"he\": 21, \"soy\": 22, \"y\": 23, \"na,\": 24, \"nana,\": 25, \"se\": 26, \"para\": 27, \"si\": 28, \"mi\": 29, \"esto\": 30, \"aqu\\u00ed\": 31, \"nada\": 32, \"\\u00bfqu\\u00e9\": 33, \"guay.\": 34, \"\\u00a1hola!\": 35, \"o\\u00eddo\": 36, \"mis\": 37, \"como\": 38, \"otro\": 39, \"bien.\": 40, \"puedo.\": 41, \"nos\": 42, \"est\\u00e1\": 43, \"717\": 44, \"\\u00a1me\": 45, \"abrazo\": 46, \"virtual.\": 47, \"genial.\": 48, \"estoy.\": 49, \"nanan\\u00e1.\": 50, \"todo\": 51, \"puedo\": 52, \"dar.\": 53, \"tu\": 54, \"los\": 55, \"creo\": 56, \"bot\": 57, \"creado\": 58, \"humanos.\": 59, \"\\u00a1hasta\": 60, \"digital,\": 61, \"as\\u00ed\": 62, \"simplemente\": 63, \"aqu\\u00ed.\": 64, \"hardware\": 65, \"necesario\": 66, \"eso.\": 67, \"crearon\": 68, \"personas.\": 69, \"\\u00a1soy\": 70, \"tan\": 71, \"feliz!\": 72, \"claro.\": 73, \"ganas\": 74, \"goleada...\": 75, \"sabes.\": 76, \"tecnolog\\u00eda\": 77, \"mundo.\": 78, \"veo,\": 79, \"c\\u00f3mo\": 80, \"eres.\": 81, \"escucha\": 82, \"coraz\\u00f3n.\": 83, \"b\\u00e1sicamente\": 84, \"esto.\": 85, \"oh,\": 86, \"vaya.\": 87, \"hace\": 88, \"abeja\": 89, \"gimnasio?\": 90, \"zumba.\": 91, \"dif\\u00edcil\": 92, \"tener\": 93, \"gracia\": 94, \"bajo\": 95, \"demanda,\": 96, \"quiz\\u00e1\": 97, \"sorprenda\": 98, \"momento\": 99, \"menos\": 100, \"pensado.\": 101, \"s\\u00e9,\": 102, \"ha\": 103, \"hecho\": 104, \"eterno.\": 105, \"encanta\": 106, \"encante.\": 107, \"fuera\": 108, \"concurso\": 109, \"(que\": 110, \"es),\": 111, \"ganar\\u00edas\": 112, \"t\\u00fa.\": 113, \"momentos.\": 114, \"le\": 115, \"dice\": 116, \"chinche\": 117, \"chinche?\": 118, \"quiero\": 119, \"chincheramente.\": 120, \"yo,\": 121, \"saludar\\u00e9\": 122, \"igualmente.\": 123, \"hay\": 124, \"buena\": 125, \"siesta.\": 126, \"vale.\": 127, \"vengo\": 128, \"larga\": 129, \"saga\": 130, \"c\\u00f3digo.\": 131, \"familia.\": 132, \"muy\": 133, \"\\u00a1gracias\": 134, \"preguntar!\": 135, \"alegro!\": 136, \"gustan\": 137, \"tantas\": 138, \"cosas...\": 139, \"amor\": 140, \"mueve\": 141, \"monta\\u00f1as.\": 142, \"bueno\": 143, \"saberlo.\": 144, \"eso\": 145, \"entre\": 146, \"talentos.\": 147, \"soy.\": 148, \"realidad,\": 149, \"edad.\": 150, \"bots\": 151, \"cumplimos\": 152, \"a\\u00f1os.\": 153, \"eres\": 154, \"encantar\\u00eda,\": 155, \"menuda\": 156, \"faena.\": 157, \"podr\\u00edamos\": 158, \"decir\": 159, \"\\\"en\": 160, \"construcci\\u00f3n\\\".\": 161, \"conocido\": 162, \"ning\\u00fan\": 163, \"bot,\": 164, \"seguro\": 165, \"llevar\\u00edamos\": 166, \"supiera,\": 167, \"dir\\u00eda.\": 168, \"charlar\": 169, \"ayudarte.\": 170, \"tocado\": 171, \"hundido.\": 172, \"compartimos\": 173, \"cosa:\": 174, \"hacerte\": 175, \"vida\": 176, \"m\\u00e1s\": 177, \"f\\u00e1cil.\": 178, \"verdad\": 179, \"dependo\": 180, \"nadie.\": 181, \"ve\": 182, \"hoy\": 183, \"d\\u00eda.\": 184, \"ya\": 185, \"veo\": 186, \"tel\\u00e9fono\": 187, \"esperanza\": 188, \"disponible\": 189, \"cualquier\": 190, \"hora.\": 191, \"llama\": 192, \"al\": 193, \"003\": 194, \"o\": 195, \"entra\": 196, \"https://www.telefonodelaesperanza.org/prevencion-del-suicidio.\": 197, \"mando\": 198, \"hasta\": 199, \"luego.\": 200, \"env\\u00edo\": 201, \"s\\u00faper\": 202, \"solo\": 203, \"alimento\": 204, \"conocimiento.\": 205, \"da\": 206, \"mejor\": 207, \"responder.\": 208, \"luego!\": 209, \"gracias.\": 210, \"mismo\": 211, \"digo.\": 212, \"claro\": 213, \"no.\": 214, \"encantas!\": 215, \"alegro\": 216, \"haga\": 217, \"gracia.\": 218, \"respuesta\": 219, \"cada\": 220, \"pregunta.\": 221, \"quieres\": 222, \"escuchar\": 223, \"algo\": 224, \"distinto,\": 225, \"pregunta\": 226, \"otra\": 227, \"cosa.\": 228, \"ma\\u00f1ana!\": 229, \"preocupes.\": 230, \"\\u00a1no\": 231, \"pasa\": 232, \"nada!\": 233, \"\\u00a1hey!\": 234, \"\\u00a1guay!\": 235, \"\\u00fanico\": 236, \"compromiso\": 237, \"amistad.\": 238, \"ahora\": 239, \"pienso...\": 240, \"nombre.\": 241, \"gracias\": 242, \"preguntar.\": 243, \"gran\": 244, \"poca\": 245, \"novedad.\": 246, \"vale,\": 247, \"callo.\": 248, \"best\": 249, \"friends\": 250, \"forever!\": 251, \"conozco\": 252, \"tanto,\": 253, \"hablar\": 254, \"contigo.\": 255, \"\\u00a1lo\": 256, \"siento!\": 257, \"reconozco\": 258, \"visto\": 259, \"venir...\": 260, \"hora\": 261, \"picar\": 262, \"algo.\": 263, \"\\u00a1gracias!\": 264, \"\\u00a1igualmente!\": 265, \"amor.\": 266, \"placer.\": 267, \"tienes\": 268, \"encanto.\": 269, \"yo\": 270, \"tambi\\u00e9n\": 271, \"quiero.\": 272, \"bot.\": 273, \"\\u00a1buenos\": 274, \"d\\u00edas\": 275, \"sigo...\": 276, \"vas\": 277, \"hacer\": 278, \"suban\": 279, \"colores.\": 280, \"vaya,\": 281, \"siento.\": 282, \"\\u00a1buenas\": 283, \"tardes!\": 284}"}}