{"class_name": "Tokenizer", "config": {"num_words": null, "filters": "", "lower": true, "split": " ", "char_level": false, "oov_token": null, "document_count": 20230, "word_counts": "{\"<start>\": 20230, \"\\u00a1todo\": 30, \"bien,\": 34, \"gracias!\": 30, \"\\u00bfy\": 76, \"t\\u00fa?\": 60, \"<end>\": 20230, \"\\u00a1s\\u00ed,\": 14, \"me\": 3382, \"encanta!\": 6, \"\\u00bfa\": 22, \"ti?\": 28, \"\\u00a1vaya,\": 8, \"espero\": 18, \"que\": 3789, \"descanses\": 4, \"pronto!\": 6, \"\\u00a1qu\\u00e9\": 184, \"bien!\": 62, \"alegra\": 4, \"escuchar\": 175, \"eso.\": 295, \"qu\\u00e9\": 60, \"mal!\": 4, \"\\u00bfte\": 12, \"gustar\\u00eda\": 98, \"hacer\": 97, \"algo\": 223, \"para\": 807, \"distraerte?\": 4, \"\\u00a1oye,\": 4, \"suerte!\": 6, \"\\u00bfqu\\u00e9\": 659, \"te\": 3210, \"apetece\": 4, \"comer?\": 6, \"s\\u00ed,\": 34, \"encanta.\": 2, \"gustan\": 300, \"muchas,\": 2, \"pero\": 1610, \"hoy\": 258, \"podr\\u00eda\": 8, \"decir\": 276, \"que...\": 2, \"no\": 4839, \"he\": 969, \"visto\": 108, \"nada\": 593, \"\\u00faltimamente,\": 4, \"\\u00bft\\u00fa?\": 4, \"gustan,\": 6, \"aunque\": 20, \"soy\": 951, \"un\": 2026, \"experto.\": 4, \"a\": 1331, \"est\\u00e1\": 545, \"poco\": 14, \"raro,\": 4, \"se\": 765, \"pueda\": 6, \"manejar.\": 4, \"\\u00a1s\\u00ed!\": 118, \"venga\": 6, \"de\": 1805, \"viento\": 4, \"pronto.\": 6, \"l\\u00e1stima!\": 6, \"veces\": 100, \"la\": 1480, \"lluvia\": 6, \"es\": 2346, \"relajante,\": 8, \"parece\": 14, \"mucha.\": 4, \"lo\": 2670, \"entiendo,\": 10, \"agotador.\": 6, \"\\u00bfya\": 4, \"casi\": 4, \"terminas?\": 4, \"\\u00a1\\u00e1nimo!\": 6, \"\\u00a1lo\": 121, \"lograr\\u00e1s!\": 4, \"\\u00a1de\": 4, \"t\\u00fa\": 6, \"quieras!\": 4, \"estoy\": 997, \"aqu\\u00ed\": 671, \"charlar.\": 4, \"\\u00bfpor\": 14, \"pruebas\": 4, \"alguna\": 12, \"actividad\": 6, \"divertida?\": 4, \"estuve\": 6, \"descansando.\": 6, \"\\u00a1eso\": 74, \"genial!\": 56, \"una\": 1470, \"buena\": 306, \"forma\": 56, \"relajarse.\": 18, \"emocionante!\": 40, \"est\\u00e1s\": 10, \"cocinando?\": 4, \"gusta\": 979, \"leer\": 12, \"y\": 900, \"aprender\": 20, \"cosas\": 14, \"nuevas.\": 6, \"tipo\": 24, \"libros\": 10, \"gustan?\": 12, \"\\u00bfverdad?\": 4, \"buen\": 22, \"momento\": 299, \"\\u00a1claro!\": 18, \"los\": 403, \"nunca\": 12, \"tienen\": 20, \"fr\\u00edo?\": 2, \"porque\": 4, \"muchas\": 20, \"hojas.\": 6, \"\\u00a1me\": 491, \"encantan!\": 10, \"perros\": 2, \"son\": 42, \"mis\": 585, \"favoritos.\": 2, \"bueno!\": 12, \"\\u00bfcu\\u00e1l\": 10, \"aprendiendo?\": 2, \"tu\": 378, \"destino\": 6, \"favorito?\": 4, \"siempre\": 98, \"buscando\": 6, \"nuevo.\": 6, \"las\": 64, \"disfruto\": 2, \"mucho.\": 4, \"p\\u00e1jaros\": 2, \"usan\": 2, \"facebook?\": 2, \"ya\": 246, \"twitter.\": 2, \"muy\": 338, \"curiosos.\": 2, \"\\u00bfc\\u00f3mo\": 22, \"va?\": 2, \"d\\u00f3nde\": 8, \"ir?\": 8, \"interesante!\": 24, \"favorita?\": 4, \"excelente!\": 2, \"el\": 1246, \"ejercicio\": 8, \"gran\": 174, \"sentirse\": 8, \"bien.\": 561, \"estuvo\": 2, \"reencuentro?\": 2, \"divertido!\": 12, \"decorarla?\": 2, \"pintura\": 6, \"hacer?\": 2, \"suena\": 34, \"jardiner\\u00eda\": 2, \"relajante.\": 10, \"\\u00bfllevas\": 4, \"mucho\": 30, \"tiempo?\": 2, \"meteoritos\": 2, \"desintegran\": 2, \"al\": 262, \"entrar\": 2, \"en\": 1212, \"atm\\u00f3sfera.\": 2, \"atrae\": 2, \"astronom\\u00eda?\": 2, \"d\\u00eda\": 12, \"tranquilo\": 4, \"todo\": 435, \"necesitamos.\": 6, \"siga\": 2, \"mejorando.\": 2, \"\\u00a1totalmente!\": 8, \"aire\": 20, \"fresco\": 16, \"viene\": 2, \"\\u00a1sin\": 8, \"duda!\": 8, \"caf\\u00e9\": 6, \"idea.\": 4, \"actividades\": 2, \"favoritas.\": 6, \"meditar\": 4, \"excelente\": 38, \"compa\\u00f1\\u00eda\": 4, \"bienvenida.\": 2, \"bueno\": 294, \"disfrutar\": 10, \"momentos\": 14, \"as\\u00ed.\": 2, \"\\u00a1parece\": 2, \"necesitas\": 2, \"descanso!\": 4, \"\\u00a1vaya!\": 6, \"sales\": 2, \"dar\": 6, \"vuelta?\": 2, \"asustan\": 2, \"demasiado.\": 2, \"ahora\": 152, \"escuchando\": 2, \"tranquilo.\": 4, \"manera\": 10, \"escapar\": 2, \"otro\": 563, \"mundo.\": 305, \"novelas\": 2, \"misterio.\": 4, \"geniales,\": 2, \"encantan.\": 4, \"agradable,\": 2, \"hace\": 309, \"ni\": 4, \"fr\\u00edo\": 2, \"calor.\": 2, \"llegue\": 2, \"cambiando\": 4, \"constantemente.\": 2, \"\\u00a1te\": 8, \"entiendo!\": 8, \"importante\": 6, \"tomarse\": 6, \"descanso.\": 6, \"lograr\\u00e1s,\": 2, \"seguro!\": 2, \"tranquilo,\": 6, \"gracias.\": 197, \"\\u00bfde\": 16, \"hablar?\": 2, \"haces\": 2, \"diferente?\": 2, \"salir\": 8, \"rutina\": 4, \"divertido.\": 10, \"tuyo?\": 4, \"caminar\": 8, \"libre\": 6, \"has\": 8, \"cocinado\": 4, \"\\u00faltimamente?\": 2, \"m\\u00e1s\": 300, \"animales\": 6, \"sorprendentes.\": 4, \"especialmente\": 2, \"perros.\": 2, \"pintar?\": 2, \"\\u00a1es\": 30, \"meta!\": 2, \"con\": 52, \"pr\\u00e1ctica\": 2, \"lograr\\u00e1s.\": 2, \"clave\": 2, \"mantenernos\": 4, \"saludables.\": 2, \"piano\": 4, \"instrumento\": 4, \"hermoso.\": 4, \"sea\": 6, \"agradable.\": 4, \"puedas\": 2, \"aprovechar\": 6, \"ese\": 12, \"\\u00e1nimo.\": 2, \"pasta\": 2, \"deliciosa.\": 2, \"series\": 8, \"si\": 741, \"suspenso,\": 2, \"recomendar\\u00eda\": 2, \"\\\"stranger\": 2, \"things\\\".\": 2, \"trata?\": 8, \"hornear\": 2, \"pan\": 2, \"debe\": 4, \"ser\": 62, \"perfecto\": 6, \"relajarse!\": 2, \"meditaci\\u00f3n\": 8, \"encontrar\": 12, \"paz\": 4, \"interior.\": 4, \"ma\\u00f1ana\": 4, \"productiva!\": 2, \"lugares\": 14, \"hist\\u00f3ricos\": 2, \"historias\": 8, \"interesantes.\": 4, \"agradable\": 6, \"detenerse\": 2, \"mirar\": 4, \"estrellas\": 2, \"o\": 264, \"nubes.\": 2, \"hay\": 302, \"muchos\": 8, \"interesantes\": 2, \"por\": 1130, \"explorar.\": 2, \"fue?\": 2, \"\\u00a1a\": 18, \"m\\u00ed\": 12, \"tambi\\u00e9n!\": 12, \"pel\\u00edculas\": 8, \"cl\\u00e1sicas\": 4, \"encanto\": 2, \"\\u00fanico.\": 2, \"hacerlo?\": 2, \"bienvenido!\": 2, \"espacio\": 14, \"limpio\": 4, \"importante!\": 4, \"\\u00bfhas\": 6, \"probado\": 2, \"libro?\": 4, \"\\u00a1hola!\": 580, \"est\\u00e1s?\": 2, \"estar\": 18, \"cansado\": 2, \"significa\": 2, \"hiciste\": 2, \"productivo.\": 2, \"clima\": 6, \"as\\u00ed\": 294, \"otros\": 4, \"d\\u00edas\": 76, \"puede\": 44, \"triste.\": 2, \"como\": 594, \"empezar\": 8, \"d\\u00eda.\": 262, \"despejar\": 4, \"mente.\": 12, \"necesitamos\": 8, \"aprovecha\": 8, \"\\u00e1nimo\": 4, \"puedas.\": 2, \"sentir\": 6, \"mejor.\": 10, \"\\u00a1genial!\": 2, \"depende\": 4, \"del\": 26, \"d\\u00eda,\": 8, \"m\\u00fasica\": 14, \"tranquila.\": 2, \"aprender?\": 4, \"encanta\": 305, \"ver\": 8, \"artistas\": 2, \"vivo.\": 2, \"muchas!\": 2, \"\\\"inception\\\"\": 2, \"acompa\\u00f1e\": 2, \"ciudad\": 4, \"entretenido.\": 2, \"leer.\": 2, \"creatividad\": 6, \"expresarse.\": 8, \"preparado?\": 2, \"\\u00bfhay\": 4, \"ayudarte\": 2, \"relajarte?\": 2, \"tuya?\": 2, \"pasta.\": 2, \"incre\\u00edble!\": 10, \"jap\\u00f3n\": 4, \"tiene\": 34, \"cultura\": 10, \"fascinante.\": 4, \"nuevas\": 2, \"darnos\": 4, \"ideas\": 4, \"frescas.\": 2, \"cuidar\": 2, \"cuerpo.\": 2, \"perfectos\": 2, \"libre.\": 8, \"tiempo\": 8, \"practicando?\": 2, \"mismo\": 195, \"obsesionado\": 2, \"canci\\u00f3n\": 2, \"jazz.\": 2, \"cambiar\": 8, \"ambiente.\": 2, \"bien\": 2, \"nostalgia,\": 2, \"nos\": 551, \"recuerda\": 2, \"buenos\": 2, \"momentos.\": 296, \"comidas\": 2, \"cualquier\": 242, \"contacto\": 4, \"naturaleza\": 10, \"genial.\": 418, \"tan\": 319, \"impresionante.\": 4, \"maravillosa\": 4, \"fue\": 10, \"descubriste?\": 2, \"esa\": 6, \"inspiraci\\u00f3n.\": 2, \"oler\": 2, \"delicioso.\": 4, \"comiendo?\": 2, \"pintar\": 4, \"expresiva\": 2, \"arte.\": 4, \"proyectos\": 2, \"diy\": 2, \"divertidos.\": 2, \"bonito!\": 4, \"genial\": 2, \"reencontrarse\": 2, \"gente\": 4, \"querida.\": 2, \"\\u00a1perfecto!\": 2, \"\\u00bftienes\": 12, \"alg\\u00fan\": 8, \"libro\": 6, \"mente?\": 8, \"gatos\": 2, \"expertos\": 2, \"descansar.\": 2, \"ayer\": 2, \"prob\\u00e9\": 4, \"plato\": 2, \"tailand\\u00e9s\": 2, \"encant\\u00f3.\": 2, \"normal\": 2, \"as\\u00ed!\": 2, \"podr\\u00edas\": 2, \"sencillo,\": 2, \"estiramientos.\": 2, \"tema\": 10, \"fascinante!\": 8, \"saber\": 14, \"espec\\u00edfico?\": 2, \"comprensible!\": 2, \"descanso\": 8, \"dispositivos\": 2, \"saludable.\": 2, \"relajar\": 2, \"cuerpo\": 2, \"cl\\u00e1sica\": 2, \"poder\": 16, \"incre\\u00edble\": 22, \"pensar\": 4, \"bajo\": 293, \"agua.\": 2, \"necesario\": 295, \"nubes\": 2, \"formas\": 6, \"curiosas.\": 2, \"historia\": 4, \"antigua\": 6, \"llena\": 2, \"eventos\": 2, \"fascinantes.\": 4, \"\\u00bfalguna\": 2, \"\\u00e9poca\": 2, \"interesa\": 2, \"particular?\": 2, \"conectarse\": 4, \"naturaleza.\": 6, \"pel\\u00edcula\": 2, \"rico!\": 2, \"preparaste?\": 2, \"jazz\": 2, \"variedad\": 2, \"sonidos\": 2, \"estilos.\": 2, \"revitalizante.\": 2, \"\\u00a1viajar\": 2, \"mejores\": 4, \"experiencias!\": 2, \"expresar\": 4, \"emociones.\": 2, \"explorar\": 6, \"diferentes.\": 2, \"listas\": 2, \"ayudan\": 2, \"organizarse\": 2, \"aportan\": 2, \"mucha\": 2, \"alegr\\u00eda.\": 2, \"mascota\": 2, \"tener?\": 2, \"escribir\": 6, \"plasmar\": 2, \"pensamientos.\": 2, \"\\u00a1buena\": 2, \"idea!\": 6, \"m\\u00e1s?\": 6, \"datos\": 2, \"viste?\": 2, \"ambiente\": 2, \"casa\": 4, \"refrescante.\": 2, \"cambio\": 4, \"clim\\u00e1tico\": 2, \"afecta\": 2, \"todos.\": 2, \"maravilloso.\": 4, \"eso!\": 2, \"universo\": 6, \"vasto\": 2, \"dejaremos\": 2, \"sorprendernos.\": 2, \"sali\\u00f3\": 2, \"bien?\": 2, \"espec\\u00edfico\": 2, \"saber?\": 2, \"capturar\": 6, \"museos\": 4, \"ofrecer.\": 2, \"conversaciones\": 2, \"profundas.\": 2, \"guiada\": 2, \"perfecto!\": 2, \"lectura\": 2, \"llevarte\": 2, \"nuevos.\": 2, \"origami\": 2, \"arte\": 4, \"rica.\": 2, \"motivaci\\u00f3n\": 2, \"parques\": 2, \"nacionales\": 2, \"hermosos\": 2, \"proyecto.\": 4, \"tratara?\": 4, \"dif\\u00edcil!\": 4, \"tal\": 18, \"vez\": 18, \"capacidad\": 4, \"volar.\": 10, \"oto\\u00f1o,\": 4, \"su\": 24, \"colores\": 4, \"viajes\": 4, \"improvisados\": 4, \"pueden\": 14, \"emocionantes.\": 6, \"pregunta!\": 4, \"haber\": 8, \"vivido\": 4, \"grecia.\": 4, \"mucho,\": 8, \"evito\": 4, \"pasar\": 6, \"debajo\": 4, \"escalera.\": 4, \"querido\": 14, \"visitar\": 4, \"jap\\u00f3n,\": 4, \"\\u00a1qui\\u00e9n\": 4, \"sabe!\": 4, \"grande\": 4, \"haya\": 4, \"all\\u00e1\": 4, \"afuera.\": 4, \"ser\\u00eda\": 42, \"innovador\": 4, \"futurista.\": 8, \"cercano,\": 4, \"enorme\": 4, \"esfera\": 4, \"gas.\": 4, \"uno\": 4, \"fen\\u00f3menos\": 4, \"naturales\": 4, \"impresionantes.\": 8, \"\\u00e1guila\": 4, \"volar\": 4, \"alto.\": 4, \"fascinante\": 8, \"nuevo\": 8, \"viajar\": 12, \"diferentes\": 14, \"\\u00e9pocas.\": 4, \"ha\": 295, \"gustado\": 4, \"piano,\": 4, \"sonido\": 4, \"profundo.\": 4, \"encantar\\u00eda\": 10, \"preparar\": 4, \"chocolate!\": 6, \"\\u00a1desear\\u00eda\": 4, \"mundo\": 14, \"sin\": 8, \"l\\u00edmites!\": 4, \"llamarme\": 4, \"\\\"rayo\\\",\": 4, \"r\\u00e1pido\": 6, \"fuerte.\": 4, \"\\u00a1quisiera\": 4, \"piensan\": 6, \"sobre\": 20, \"todo!\": 4, \"\\\"blade\": 4, \"runner\\\"!\": 4, \"obra\": 4, \"maestra\": 4, \"cine\": 4, \"tener\": 311, \"habilidad\": 6, \"desconectar\": 4, \"completamente\": 10, \"recuerdo\": 4, \"cuando\": 6, \"llevaba\": 4, \"mi\": 711, \"abuelo\": 4, \"parque,\": 4, \"especial.\": 4, \"interesante\": 4, \"m\\u00e1quina\": 4, \"ayude\": 4, \"todo.\": 6, \"eliminar\": 4, \"pobreza\": 4, \"darles\": 4, \"todos\": 20, \"vida\": 272, \"siento\": 8, \"orgulloso\": 4, \"aprendido\": 4, \"tocar\": 8, \"guitarra.\": 6, \"playa\": 4, \"disfrutando\": 4, \"sol\": 4, \"brisa.\": 4, \"le\": 300, \"preguntar\\u00eda\": 10, \"elon\": 6, \"musk\": 4, \"inspir\\u00f3\": 4, \"crear\": 8, \"spacex.\": 4, \"pasar\\u00e1,\": 4, \"tambi\\u00e9n\": 91, \"libertad\": 4, \"cambiarlo.\": 4, \"camino\": 4, \"correcto\": 4, \"decisiones.\": 4, \"\\u00a1ser\\u00eda\": 4, \"c\\u00f3mo\": 297, \"hacen\": 8, \"esos\": 12, \"trucos\": 8, \"\\u00a1definitivamente\": 4, \"\\\"harry\": 4, \"potter\\\"!\": 4, \"m\\u00e1gico.\": 4, \"inteligencia\": 4, \"artificial\": 4, \"potencial\": 4, \"cosas.\": 4, \"electricidad\": 4, \"impresionante;\": 4, \"podemos\": 6, \"gracias\": 152, \"ella\": 4, \"incre\\u00edble.\": 10, \"vivir\": 14, \"par\\u00eds,\": 4, \"belleza.\": 4, \"famoso\": 6, \"diferencia\": 4, \"positiva\": 4, \"dedicar\\u00eda\": 4, \"conocer\": 4, \"culturas.\": 8, \"hablar\": 120, \"albert\": 4, \"einstein\": 4, \"sus\": 6, \"teor\\u00edas.\": 4, \"puedo\": 397, \"algunos\": 4, \"magia\": 4, \"cartas!\": 4, \"exploraci\\u00f3n\": 4, \"aventura\": 4, \"bailar\": 2, \"divertida\": 2, \"fascinantes,\": 2, \"creo\": 351, \"balance\": 2, \"uso.\": 2, \"futuro\": 4, \"humanidad\": 2, \"visi\\u00f3n\": 6, \"\\\"el\": 2, \"se\\u00f1or\": 2, \"anillos\\\"\": 2, \"fascinante,\": 4, \"lleno\": 4, \"aventuras.\": 2, \"idea\": 2, \"emocionante,\": 2, \"plantea\": 2, \"desaf\\u00edos.\": 2, \"\\u00a1definitivamente!\": 4, \"oc\\u00e9ano\": 2, \"misterios\": 4, \"criaturas\": 2, \"isla\": 2, \"tranquila,\": 4, \"rodeado\": 2, \"solo\": 216, \"comenzar\\u00eda\": 2, \"propio\": 2, \"negocio\": 2, \"viajar\\u00eda\": 4, \"control\": 4, \"sucede\": 2, \"sue\\u00f1o.\": 2, \"complicado,\": 2, \"cada\": 169, \"propia\": 2, \"interesante.\": 6, \"\\u00a1\\\"el\": 2, \"lebowski\\\"\": 2, \"favorita!\": 2, \"comedia\": 2, \"\\u00fanica.\": 4, \"\\u00a1pizza!\": 2, \"cansar\\u00eda\": 2, \"pizza.\": 2, \"experiencia\": 6, \"\\u00a1el\": 4, \"drag\\u00f3n!\": 2, \"imponente\": 2, \"representaciones\": 2, \"mundo,\": 2, \"visitando\": 2, \"incre\\u00edbles.\": 4, \"positivo,\": 2, \"ayudar\": 2, \"otras\": 4, \"personas.\": 293, \"dif\\u00edcil,\": 4, \"permitir\\u00eda\": 2, \"momento.\": 2, \"cambiar\\u00eda\": 2, \"algunas\": 6, \"decisiones\": 4, \"personales,\": 2, \"general,\": 2, \"pasa\": 165, \"raz\\u00f3n.\": 2, \"posible,\": 2, \"habr\\u00e1\": 2, \"trabajos\": 2, \"necesiten\": 2, \"intervenci\\u00f3n\": 2, \"humana.\": 2, \"invitar\\u00eda\": 2, \"musk,\": 2, \"\\u00a1tiene\": 2, \"futuro!\": 2, \"toque\": 2, \"humano\": 2, \"ser\\u00e1\": 2, \"importante.\": 2, \"nueva\": 2, \"zelanda,\": 2, \"perro\": 2, \"grande,\": 2, \"pastor\": 2, \"alem\\u00e1n.\": 2, \"mejorar\": 2, \"instrumentos\": 2, \"musicales.\": 2, \"parte\": 4, \"aventura,\": 4, \"ayuda\": 6, \"descubrir\": 2, \"sab\\u00edas\": 2, \"exist\\u00edan.\": 2, \"pensado\": 6, \"divertido\": 4, \"manos.\": 2, \"ir\": 2, \"egipto\": 2, \"pir\\u00e1mides.\": 2, \"familia,\": 2, \"celebramos\": 2, \"fiestas\": 2, \"cena.\": 2, \"moderna,\": 2, \"grandes\": 2, \"ventanales\": 2, \"probarlo,\": 2, \"emocionante.\": 2, \"senderismo,\": 2, \"naturaleza!\": 2, \"especiales\": 2, \"belleza\": 2, \"entorno.\": 2, \"elegir\\u00eda\": 2, \"delf\\u00edn,\": 2, \"inteligentes!\": 2, \"encantan\": 4, \"vacaciones\": 2, \"explorando\": 2, \"nuevos\": 2, \"espacio.\": 2, \"vez,\": 2, \"nombre\": 2, \"diferente\": 2, \"explorador\": 2, \"abierto,\": 2, \"\\\"zelda\\\".\": 2, \"\\u00a1suena\": 2, \"nueva.\": 2, \"fascinantes\": 2, \"salvar\": 2, \"vidas,\": 2, \"debemos\": 2, \"cuidado\": 2, \"riesgos.\": 2, \"temprano.\": 2, \"sientes?\": 2, \"encanta,\": 2, \"exagerar\": 2, \"picante.\": 2, \"viendo\": 2, \"serie\": 4, \"\\u00a1est\\u00e1\": 2, \"buen\\u00edsima!\": 2, \"pudieras?\": 2, \"tiempo!\": 2, \"tuvi\\u00e9ramos\": 2, \"suficiente\": 2, \"bater\\u00eda\": 2, \"s\\u00e9\": 2, \"talento\": 2, \"oculto,\": 2, \"cantar\": 2, \"ducha.\": 2, \"generalmente\": 2, \"prefiero\": 8, \"playa.\": 2, \"mejor\": 212, \"comienzo\": 2, \"prefieres?\": 4, \"dan\": 2, \"miedo.\": 2, \"comedias\": 2, \"thrillers.\": 2, \"vi\": 2, \"toda\": 4, \"temporada\": 2, \"agotador\": 2, \"parque\": 4, \"cerca\": 2, \"casa.\": 4, \"trato\": 2, \"hacerlo,\": 2, \"dif\\u00edcil\": 295, \"motivaci\\u00f3n.\": 2, \"moderno\": 2, \"\\u00fanica\": 4, \"vez.\": 2, \"cuesta\": 2, \"poco.\": 2, \"comprar\": 2, \"l\\u00ednea.\": 2, \"c\\u00f3modo.\": 2, \"fotograf\\u00eda.\": 2, \"llevo\": 2, \"c\\u00e1mara\": 2, \"viajo.\": 2, \"acompa\\u00f1ante\": 2, \"importa.\": 2, \"incre\\u00edblemente\": 2, \"\\u00e1giles.\": 2, \"sorprenden.\": 2, \"estrategia.\": 2, \"monta\\u00f1as\": 2, \"rusas\": 2, \"atracciones\": 2, \"pastel\": 2, \"debilidad.\": 2, \"efecto,\": 2, \"querer\": 2, \"moverte.\": 2, \"\\\"forrest\": 2, \"gump\\\"\": 2, \"esas\": 4, \"canso\": 2, \"ver.\": 4, \"nostalgia\": 2, \"bonita.\": 2, \"sientes\": 2, \"as\\u00ed?\": 2, \"peque\\u00f1o\": 4, \"pueblo\": 2, \"fui\": 2, \"vacaciones.\": 2, \"frescos\": 2, \"ideales\": 2, \"paseo\": 4, \"quise\": 2, \"sushi.\": 2, \"depende.\": 2, \"buenas\": 2, \"sorpresas,\": 2, \"animaci\\u00f3n\": 2, \"madrugar.\": 2, \"productivo\": 4, \"ma\\u00f1ana.\": 2, \"mejor!\": 2, \"comida\": 2, \"fundamental\": 2, \"experiencia.\": 2, \"tomarme\": 2, \"supersticioso,\": 2, \"da\": 210, \"miedo\": 2, \"romper\": 2, \"espejo.\": 2, \"respirar\": 2, \"medio\": 2, \"paisaje\": 2, \"natural.\": 2, \"costa.\": 2, \"voy\": 2, \"\\u00e1rboles\": 2, \"inspirado.\": 2, \"atm\\u00f3sfera\": 2, \"festival\": 2, \"bonita\": 2, \"creatividad.\": 2, \"relajarme,\": 2, \"ciudad.\": 2, \"energ\\u00eda\": 2, \"cierto!\": 8, \"libro.\": 2, \"\\u00bfsobre\": 2, \"podcast?\": 2, \"preparar?\": 2, \"maravillas.\": 2, \"totalmente\": 2, \"necesario.\": 2, \"justo\": 4, \"eso\": 295, \"pasa.\": 2, \"comunicaci\\u00f3n\": 2, \"intentar\": 2, \"aclarar\": 2, \"ideas.\": 2, \"impulso\": 2, \"creativo\": 4, \"fotograf\\u00eda\": 2, \"especiales.\": 2, \"fotos\": 2, \"trataba\": 2, \"baile\": 2, \"divertirse.\": 2, \"\\u00a1las\": 2, \"especial!\": 2, \"normal,\": 4, \"reflexionar.\": 2, \"calma\": 6, \"fant\\u00e1stico!\": 4, \"experimentar\": 2, \"comida.\": 2, \"recientemente?\": 2, \"cierto,\": 6, \"reconfortante.\": 2, \"hemos\": 2, \"estado\": 2, \"ah\\u00ed.\": 2, \"organizar\": 4, \"tareas\": 2, \"tomar\": 4, \"descansos\": 2, \"ritmo\": 2, \"tomando\": 2, \"descansar?\": 2, \"gimnasio.\": 2, \"haces?\": 2, \"decisi\\u00f3n!\": 2, \"estr\\u00e9s\": 4, \"concentraci\\u00f3n.\": 2, \"adem\\u00e1s,\": 2, \"chocolate?\": 2, \"comprensible.\": 2, \"personal.\": 2, \"maravilloso!\": 2, \"hoy?\": 2, \"perfecta\": 2, \"lugar\": 2, \"favorito\": 2, \"caminar?\": 2, \"relajado\": 2, \"necesita.\": 2, \"energ\\u00eda.\": 2, \"parecen\": 2, \"va\": 2, \"d\\u00eda?\": 2, \"opciones:\": 2, \"yoga,\": 2, \"lectura,\": 2, \"paseos\": 2, \"probar?\": 2, \"calmar\": 2, \"maravilloso\": 2, \"libros,\": 2, \"permiten\": 2, \"experiencias\": 4, \"dibujo\": 2, \"expresarte.\": 2, \"dibujar?\": 2, \"\\u00a1puedes\": 2, \"probar\": 2, \"escribir,\": 2, \"incluso\": 4, \"hobby!\": 2, \"fluye,\": 2, \"vuelve.\": 2, \"\\u00fanica!\": 2, \"veces,\": 2, \"recargar\": 2, \"energ\\u00edas.\": 2, \"diferencia.\": 2, \"enganchados.\": 2, \"verdad,\": 2, \"vivimos\": 2, \"para.\": 2, \"pero,\": 10, \"\\u00bfno\": 16, \"crees\": 16, \"productiva?\": 2, \"decidir\": 2, \"entre\": 285, \"tantas\": 288, \"opciones.\": 2, \"sueles\": 4, \"tus\": 2, \"decisiones?\": 2, \"duda\": 4, \"com\\u00fan.\": 2, \"direcci\\u00f3n.\": 2, \"inseguro\": 2, \"camino?\": 2, \"abrumadoras\": 2, \"veces.\": 2, \"\\u00bfcrees\": 8, \"podr\\u00edan\": 4, \"aspecto\": 2, \"positivo?\": 2, \"normal.\": 2, \"tenemos\": 6, \"total,\": 2, \"situaciones\": 2, \"oportunidades\": 2, \"tienes\": 71, \"raz\\u00f3n,\": 2, \"priorizar\": 2, \"cosas?\": 2, \"personas\": 2, \"est\\u00e1n\": 2, \"aceptaci\\u00f3n.\": 2, \"punto\": 2, \"v\\u00e1lido.\": 2, \"lado,\": 2, \"tecnolog\\u00eda\": 295, \"conecta\": 2, \"antes\": 2, \"eran\": 2, \"posibles.\": 2, \"pasa!\": 2, \"herramienta\": 2, \"\\u00fatil\": 2, \"nuestras\": 4, \"vidas?\": 2, \"deseo!\": 2, \"inevitable\": 2, \"situaciones,\": 2, \"equilibrio?\": 2, \"totalmente.\": 2, \"b\\u00fasqueda\": 2, \"constante\": 2, \"dinero\": 2, \"perder\": 4, \"vista\": 2, \"realmente\": 6, \"felices.\": 4, \"piensas\": 2, \"frustrante.\": 4, \"sociedad\": 2, \"hacia\": 2, \"mayor\": 2, \"aceptaci\\u00f3n\": 2, \"no?\": 2, \"l\\u00e1stima\": 2, \"necesitemos\": 2, \"cuenta\": 2, \"valor.\": 2, \"evitarlo?\": 2, \"\\u00fatil,\": 2, \"peligroso,\": 2, \"\\u00bfno?\": 6, \"supieran\": 2, \"dem\\u00e1s,\": 2, \"surgir\": 2, \"malentendidos.\": 2, \"entiendo\": 4, \"dices.\": 2, \"noticias\": 2, \"repetitivas\": 2, \"pesimistas.\": 2, \"falta\": 2, \"diversidad\": 2, \"medios?\": 2, \"sabemos\": 2, \"vamos\": 2, \"hacer.\": 2, \"interesante?\": 2, \"claro,\": 2, \"simples\": 2, \"aburrirnos.\": 2, \"caos\": 2, \"agregar\": 2, \"emoci\\u00f3n\": 2, \"vida.\": 2, \"opinas?\": 4, \"interesante,\": 2, \"estamos\": 4, \"d\\u00e9\": 2, \"sentido\": 4, \"vidas.\": 2, \"\\u00bft\\u00fa\": 6, \"encontrado\": 2, \"prop\\u00f3sito?\": 2, \"totalmente,\": 2, \"posible\": 2, \"peque\\u00f1os\": 2, \"agitados?\": 2, \"considerado\": 2, \"perspectivas\": 2, \"vida?\": 2, \"v\\u00e1lida.\": 2, \"opiniones\": 2, \"externas\": 2, \"valiosas,\": 2, \"final\": 2, \"deben\": 2, \"personales.\": 2, \"piensas?\": 2, \"monta\\u00f1a\": 2, \"rusa,\": 2, \"arriba,\": 2, \"abajo.\": 2, \"enfrentamos\": 2, \"pregunta.\": 169, \"felicidad\": 2, \"subjetiva,\": 2, \"entendemos\": 2, \"misma\": 2, \"manera?\": 2, \"es.\": 2, \"amor\": 286, \"bonito\": 2, \"doloroso.\": 2, \"opini\\u00f3n\": 2, \"amor?\": 2, \"pasamos\": 2, \"duda.\": 2, \"encontramos\": 2, \"trav\\u00e9s\": 2, \"vivimos?\": 2, \"acuerdo,\": 2, \"honesto\": 2, \"doloroso\": 2, \"inc\\u00f3modo.\": 2, \"ves\": 2, \"lentos\": 2, \"interminables.\": 2, \"pase\": 2, \"d\\u00edas?\": 2, \"menudo\": 2, \"peque\\u00f1as\": 2, \"alegr\\u00edas\": 2, \"definitivamente.\": 2, \"conectan,\": 2, \"alejan\": 2, \"interacciones\": 2, \"reales.\": 2, \"preocupaci\\u00f3n.\": 2, \"todas\": 2, \"partes,\": 2, \"traer\": 2, \"positivas,\": 2, \"facilitar\": 2, \"comunicaci\\u00f3n?\": 2, \"\\u00a1probablemente!\": 2, \"final,\": 2, \"sorpresas\": 2, \"esperas\": 2, \"futuro?\": 2, \"previsibilidad\": 2, \"encanto,\": 2, \"incertidumbre,\": 2, \"ella,\": 2, \"habr\\u00eda\": 2, \"sorpresa.\": 2, \"answer\": 1, \"realidad,\": 276, \"tengo\": 1751, \"edad.\": 276, \"bots\": 276, \"cumplimos\": 276, \"a\\u00f1os.\": 276, \"responder.\": 208, \"hardware\": 291, \"tocado\": 264, \"hundido.\": 264, \"verdad\": 259, \"dependo\": 259, \"nadie.\": 259, \"talentos.\": 283, \"charlar\": 267, \"ayudarte.\": 267, \"crearon\": 291, \"vengo\": 288, \"larga\": 288, \"saga\": 288, \"c\\u00f3digo.\": 288, \"familia.\": 288, \"bot.\": 66, \"\\u00a1soy\": 291, \"feliz!\": 291, \"alimento\": 210, \"conocimiento.\": 210, \"conocido\": 269, \"ning\\u00fan\": 269, \"bot,\": 269, \"seguro\": 269, \"llevar\\u00edamos\": 269, \"cosas...\": 286, \"pienso...\": 148, \"nombre.\": 148, \"claro.\": 291, \"o\\u00eddo\": 574, \"mueve\": 284, \"monta\\u00f1as.\": 284, \"supiera,\": 268, \"dir\\u00eda.\": 268, \"ganas\": 291, \"goleada...\": 291, \"sabes.\": 291, \"esto\": 683, \"fuera\": 290, \"concurso\": 290, \"(que\": 290, \"es),\": 290, \"ganar\\u00edas\": 290, \"t\\u00fa.\": 290, \"veo,\": 291, \"eres.\": 291, \"escucha\": 291, \"coraz\\u00f3n.\": 291, \"compartimos\": 264, \"cosa:\": 264, \"hacerte\": 264, \"f\\u00e1cil.\": 264, \"claro\": 189, \"no.\": 189, \"\\u00fanico\": 150, \"compromiso\": 150, \"amistad.\": 150, \"estoy.\": 400, \"respuesta\": 167, \"quieres\": 167, \"distinto,\": 167, \"pregunta\": 167, \"otra\": 167, \"cosa.\": 167, \"bot\": 297, \"creado\": 297, \"humanos.\": 297, \"digital,\": 292, \"simplemente\": 292, \"aqu\\u00ed.\": 292, \"b\\u00e1sicamente\": 291, \"esto.\": 291, \"oh,\": 291, \"vaya.\": 291, \"dice\": 290, \"chinche\": 290, \"chinche?\": 290, \"quiero\": 290, \"chincheramente.\": 290, \"abeja\": 291, \"gimnasio?\": 291, \"zumba.\": 291, \"gracia\": 291, \"demanda,\": 291, \"quiz\\u00e1\": 291, \"sorprenda\": 291, \"menos\": 291, \"pensado.\": 291, \"vale,\": 145, \"callo.\": 145, \"na,\": 786, \"nana,\": 786, \"nanan\\u00e1.\": 393, \"dar.\": 393, \"vas\": 61, \"suban\": 61, \"colores.\": 61, \"podr\\u00edamos\": 272, \"\\\"en\": 272, \"construcci\\u00f3n\\\".\": 272, \"ve\": 252, \"soy.\": 282, \"siento!\": 113, \"guay.\": 580, \"alegro\": 170, \"haga\": 170, \"gracia.\": 170, \"preocupes.\": 161, \"puedo.\": 547, \"\\u00a1guay!\": 154, \"\\u00a1no\": 161, \"nada!\": 161, \"sigo...\": 63, \"hasta\": 217, \"luego.\": 217, \"\\u00a1hey!\": 155, \"\\u00a1buenas\": 59, \"tardes!\": 59, \"\\u00a1buenos\": 66, \"ma\\u00f1ana!\": 166, \"\\u00a1hasta\": 297, \"preguntar.\": 148, \"\\u00a1gracias\": 288, \"preguntar!\": 288, \"placer.\": 97, \"yo,\": 290, \"saludar\\u00e9\": 290, \"igualmente.\": 290, \"\\u00a1gracias!\": 103, \"\\u00a1igualmente!\": 103, \"poca\": 146, \"novedad.\": 146, \"encantar\\u00eda,\": 275, \"best\": 118, \"friends\": 118, \"forever!\": 118, \"encantas!\": 183, \"mando\": 219, \"abrazo\": 433, \"virtual.\": 433, \"conozco\": 116, \"tanto,\": 116, \"contigo.\": 116, \"encanto.\": 69, \"digo.\": 191, \"eres\": 276, \"amor.\": 102, \"yo\": 67, \"quiero.\": 67, \"reconozco\": 104, \"venir...\": 104, \"s\\u00e9,\": 291, \"hecho\": 291, \"eterno.\": 291, \"vaya,\": 61, \"siento.\": 61, \"luego!\": 197, \"menuda\": 275, \"faena.\": 275, \"alegro!\": 288, \"hora\": 104, \"picar\": 104, \"algo.\": 104, \"vale.\": 289, \"saberlo.\": 284, \"encante.\": 291, \"env\\u00edo\": 214, \"s\\u00faper\": 214, \"tel\\u00e9fono\": 240, \"esperanza\": 240, \"disponible\": 240, \"hora.\": 240, \"llama\": 240, \"717\": 480, \"003\": 240, \"entra\": 240, \"https://www.telefonodelaesperanza.org/prevencion-del-suicidio.\": 240, \"veo\": 244, \"siesta.\": 290}", "word_docs": "{\"t\\u00fa?\": 60, \"bien,\": 34, \"\\u00a1todo\": 30, \"\\u00bfy\": 76, \"gracias!\": 30, \"<start>\": 20230, \"<end>\": 20230, \"encanta!\": 6, \"\\u00a1s\\u00ed,\": 14, \"ti?\": 28, \"\\u00bfa\": 22, \"me\": 3374, \"que\": 3771, \"\\u00a1vaya,\": 8, \"pronto!\": 6, \"descanses\": 4, \"espero\": 18, \"escuchar\": 175, \"bien!\": 62, \"eso.\": 295, \"alegra\": 4, \"\\u00a1qu\\u00e9\": 184, \"gustar\\u00eda\": 94, \"mal!\": 4, \"algo\": 223, \"distraerte?\": 4, \"qu\\u00e9\": 60, \"hacer\": 97, \"para\": 805, \"\\u00bfte\": 12, \"\\u00bfqu\\u00e9\": 659, \"te\": 3208, \"suerte!\": 6, \"apetece\": 4, \"\\u00a1oye,\": 4, \"comer?\": 6, \"encanta.\": 2, \"s\\u00ed,\": 34, \"decir\": 276, \"podr\\u00eda\": 8, \"hoy\": 258, \"gustan\": 300, \"pero\": 1610, \"que...\": 2, \"muchas,\": 2, \"nada\": 593, \"\\u00bft\\u00fa?\": 4, \"he\": 969, \"no\": 4563, \"\\u00faltimamente,\": 4, \"visto\": 108, \"gustan,\": 6, \"un\": 2014, \"soy\": 951, \"a\": 1321, \"aunque\": 20, \"experto.\": 4, \"pueda\": 6, \"poco\": 14, \"raro,\": 4, \"est\\u00e1\": 545, \"se\": 765, \"manejar.\": 4, \"viento\": 4, \"pronto.\": 6, \"venga\": 6, \"\\u00a1s\\u00ed!\": 118, \"de\": 1501, \"es\": 2308, \"la\": 1454, \"parece\": 14, \"veces\": 98, \"l\\u00e1stima!\": 6, \"relajante,\": 8, \"lluvia\": 6, \"mucha.\": 4, \"casi\": 4, \"entiendo,\": 10, \"\\u00bfya\": 4, \"terminas?\": 4, \"agotador.\": 6, \"lo\": 2400, \"lograr\\u00e1s!\": 4, \"\\u00a1\\u00e1nimo!\": 6, \"\\u00a1lo\": 121, \"estoy\": 997, \"aqu\\u00ed\": 671, \"\\u00a1de\": 4, \"charlar.\": 4, \"quieras!\": 4, \"t\\u00fa\": 6, \"\\u00bfpor\": 14, \"actividad\": 6, \"divertida?\": 4, \"alguna\": 12, \"pruebas\": 4, \"descansando.\": 6, \"estuve\": 6, \"relajarse.\": 18, \"\\u00a1eso\": 74, \"genial!\": 56, \"buena\": 306, \"forma\": 56, \"una\": 1466, \"cocinando?\": 4, \"emocionante!\": 40, \"est\\u00e1s\": 10, \"gusta\": 979, \"cosas\": 14, \"nuevas.\": 6, \"aprender\": 20, \"y\": 900, \"leer\": 12, \"tipo\": 24, \"gustan?\": 12, \"libros\": 10, \"buen\": 22, \"momento\": 299, \"\\u00bfverdad?\": 4, \"porque\": 4, \"\\u00a1claro!\": 18, \"nunca\": 12, \"tienen\": 18, \"muchas\": 20, \"los\": 399, \"hojas.\": 6, \"fr\\u00edo?\": 2, \"mis\": 585, \"encantan!\": 10, \"perros\": 2, \"\\u00a1me\": 491, \"son\": 42, \"favoritos.\": 2, \"\\u00bfcu\\u00e1l\": 10, \"aprendiendo?\": 2, \"bueno!\": 12, \"favorito?\": 4, \"destino\": 6, \"tu\": 378, \"siempre\": 98, \"buscando\": 6, \"nuevo.\": 6, \"las\": 54, \"disfruto\": 2, \"mucho.\": 4, \"p\\u00e1jaros\": 2, \"twitter.\": 2, \"ya\": 246, \"facebook?\": 2, \"usan\": 2, \"curiosos.\": 2, \"muy\": 338, \"\\u00bfc\\u00f3mo\": 22, \"va?\": 2, \"ir?\": 8, \"d\\u00f3nde\": 8, \"favorita?\": 4, \"interesante!\": 24, \"bien.\": 561, \"excelente!\": 2, \"sentirse\": 8, \"el\": 1240, \"gran\": 174, \"ejercicio\": 8, \"estuvo\": 2, \"reencuentro?\": 2, \"divertido!\": 12, \"decorarla?\": 2, \"pintura\": 6, \"hacer?\": 2, \"suena\": 34, \"relajante.\": 10, \"jardiner\\u00eda\": 2, \"\\u00bfllevas\": 4, \"mucho\": 28, \"tiempo?\": 2, \"en\": 1204, \"meteoritos\": 2, \"desintegran\": 2, \"atm\\u00f3sfera.\": 2, \"entrar\": 2, \"al\": 262, \"astronom\\u00eda?\": 2, \"atrae\": 2, \"d\\u00eda\": 12, \"todo\": 435, \"tranquilo\": 4, \"necesitamos.\": 6, \"siga\": 2, \"mejorando.\": 2, \"viene\": 2, \"fresco\": 16, \"aire\": 20, \"\\u00a1totalmente!\": 8, \"caf\\u00e9\": 6, \"idea.\": 4, \"\\u00a1sin\": 8, \"duda!\": 8, \"actividades\": 2, \"favoritas.\": 6, \"meditar\": 4, \"excelente\": 38, \"bienvenida.\": 2, \"compa\\u00f1\\u00eda\": 4, \"disfrutar\": 10, \"as\\u00ed.\": 2, \"momentos\": 14, \"bueno\": 294, \"necesitas\": 2, \"descanso!\": 4, \"\\u00a1parece\": 2, \"\\u00a1vaya!\": 6, \"sales\": 2, \"vuelta?\": 2, \"dar\": 6, \"asustan\": 2, \"demasiado.\": 2, \"escuchando\": 2, \"tranquilo.\": 4, \"ahora\": 152, \"escapar\": 2, \"otro\": 563, \"mundo.\": 305, \"manera\": 10, \"misterio.\": 4, \"novelas\": 2, \"geniales,\": 2, \"encantan.\": 4, \"agradable,\": 2, \"calor.\": 2, \"ni\": 2, \"hace\": 307, \"fr\\u00edo\": 2, \"llegue\": 2, \"constantemente.\": 2, \"cambiando\": 4, \"\\u00a1te\": 8, \"entiendo!\": 8, \"descanso.\": 6, \"importante\": 6, \"tomarse\": 6, \"lograr\\u00e1s,\": 2, \"seguro!\": 2, \"gracias.\": 197, \"tranquilo,\": 6, \"\\u00bfde\": 16, \"hablar?\": 2, \"divertido.\": 10, \"diferente?\": 2, \"haces\": 2, \"rutina\": 4, \"salir\": 8, \"tuyo?\": 4, \"caminar\": 8, \"libre\": 6, \"\\u00faltimamente?\": 2, \"has\": 8, \"cocinado\": 4, \"m\\u00e1s\": 300, \"animales\": 6, \"sorprendentes.\": 4, \"perros.\": 2, \"especialmente\": 2, \"pintar?\": 2, \"lograr\\u00e1s.\": 2, \"pr\\u00e1ctica\": 2, \"meta!\": 2, \"con\": 52, \"\\u00a1es\": 30, \"clave\": 2, \"mantenernos\": 4, \"saludables.\": 2, \"hermoso.\": 4, \"instrumento\": 4, \"piano\": 4, \"agradable.\": 4, \"sea\": 6, \"aprovechar\": 6, \"\\u00e1nimo.\": 2, \"puedas\": 2, \"ese\": 12, \"deliciosa.\": 2, \"pasta\": 2, \"series\": 8, \"\\\"stranger\": 2, \"suspenso,\": 2, \"recomendar\\u00eda\": 2, \"si\": 741, \"things\\\".\": 2, \"trata?\": 8, \"hornear\": 2, \"pan\": 2, \"debe\": 4, \"ser\": 60, \"perfecto\": 6, \"relajarse!\": 2, \"encontrar\": 12, \"meditaci\\u00f3n\": 8, \"interior.\": 4, \"paz\": 4, \"ma\\u00f1ana\": 4, \"productiva!\": 2, \"hist\\u00f3ricos\": 2, \"historias\": 8, \"lugares\": 14, \"interesantes.\": 4, \"nubes.\": 2, \"estrellas\": 2, \"agradable\": 6, \"mirar\": 4, \"o\": 262, \"detenerse\": 2, \"muchos\": 8, \"por\": 1130, \"hay\": 302, \"interesantes\": 2, \"explorar.\": 2, \"fue?\": 2, \"\\u00a1a\": 18, \"pel\\u00edculas\": 8, \"\\u00fanico.\": 2, \"m\\u00ed\": 12, \"cl\\u00e1sicas\": 4, \"encanto\": 2, \"tambi\\u00e9n!\": 12, \"hacerlo?\": 2, \"limpio\": 4, \"espacio\": 14, \"bienvenido!\": 2, \"probado\": 2, \"libro?\": 4, \"importante!\": 4, \"\\u00bfhas\": 6, \"\\u00a1hola!\": 580, \"est\\u00e1s?\": 2, \"estar\": 18, \"significa\": 2, \"hiciste\": 2, \"cansado\": 2, \"productivo.\": 2, \"clima\": 6, \"otros\": 4, \"as\\u00ed\": 294, \"triste.\": 2, \"d\\u00edas\": 76, \"puede\": 44, \"d\\u00eda.\": 262, \"empezar\": 8, \"como\": 594, \"mente.\": 12, \"despejar\": 4, \"necesitamos\": 8, \"puedas.\": 2, \"aprovecha\": 8, \"\\u00e1nimo\": 4, \"sentir\": 6, \"mejor.\": 10, \"\\u00a1genial!\": 2, \"m\\u00fasica\": 12, \"d\\u00eda,\": 8, \"del\": 26, \"depende\": 4, \"tranquila.\": 2, \"aprender?\": 4, \"artistas\": 2, \"ver\": 8, \"vivo.\": 2, \"encanta\": 305, \"\\\"inception\\\"\": 2, \"muchas!\": 2, \"acompa\\u00f1e\": 2, \"ciudad\": 4, \"entretenido.\": 2, \"leer.\": 2, \"expresarse.\": 8, \"creatividad\": 6, \"preparado?\": 2, \"ayudarte\": 2, \"\\u00bfhay\": 4, \"relajarte?\": 2, \"tuya?\": 2, \"pasta.\": 2, \"cultura\": 10, \"jap\\u00f3n\": 4, \"fascinante.\": 4, \"tiene\": 32, \"incre\\u00edble!\": 10, \"frescas.\": 2, \"nuevas\": 2, \"darnos\": 4, \"ideas\": 4, \"cuidar\": 2, \"cuerpo.\": 2, \"perfectos\": 2, \"libre.\": 8, \"tiempo\": 8, \"practicando?\": 2, \"canci\\u00f3n\": 2, \"jazz.\": 2, \"mismo\": 195, \"obsesionado\": 2, \"ambiente.\": 2, \"cambiar\": 8, \"nostalgia,\": 2, \"recuerda\": 2, \"nos\": 547, \"buenos\": 2, \"momentos.\": 296, \"bien\": 2, \"comidas\": 2, \"genial.\": 418, \"cualquier\": 242, \"contacto\": 4, \"naturaleza\": 10, \"impresionante.\": 4, \"tan\": 319, \"maravillosa\": 4, \"fue\": 10, \"descubriste?\": 2, \"esa\": 6, \"inspiraci\\u00f3n.\": 2, \"comiendo?\": 2, \"oler\": 2, \"delicioso.\": 4, \"arte.\": 4, \"expresiva\": 2, \"pintar\": 4, \"divertidos.\": 2, \"diy\": 2, \"proyectos\": 2, \"querida.\": 2, \"reencontrarse\": 2, \"genial\": 2, \"gente\": 4, \"bonito!\": 4, \"\\u00a1perfecto!\": 2, \"mente?\": 8, \"libro\": 6, \"alg\\u00fan\": 8, \"\\u00bftienes\": 12, \"expertos\": 2, \"gatos\": 2, \"descansar.\": 2, \"encant\\u00f3.\": 2, \"plato\": 2, \"prob\\u00e9\": 4, \"tailand\\u00e9s\": 2, \"ayer\": 2, \"sencillo,\": 2, \"estiramientos.\": 2, \"normal\": 2, \"as\\u00ed!\": 2, \"podr\\u00edas\": 2, \"fascinante!\": 8, \"tema\": 10, \"saber\": 14, \"espec\\u00edfico?\": 2, \"descanso\": 8, \"saludable.\": 2, \"dispositivos\": 2, \"comprensible!\": 2, \"relajar\": 2, \"cuerpo\": 2, \"cl\\u00e1sica\": 2, \"poder\": 16, \"incre\\u00edble\": 22, \"pensar\": 4, \"bajo\": 293, \"agua.\": 2, \"necesario\": 295, \"formas\": 6, \"curiosas.\": 2, \"nubes\": 2, \"\\u00bfalguna\": 2, \"llena\": 2, \"eventos\": 2, \"antigua\": 6, \"particular?\": 2, \"interesa\": 2, \"fascinantes.\": 4, \"\\u00e9poca\": 2, \"historia\": 4, \"conectarse\": 4, \"naturaleza.\": 6, \"pel\\u00edcula\": 2, \"rico!\": 2, \"preparaste?\": 2, \"sonidos\": 2, \"estilos.\": 2, \"variedad\": 2, \"jazz\": 2, \"revitalizante.\": 2, \"mejores\": 4, \"\\u00a1viajar\": 2, \"experiencias!\": 2, \"emociones.\": 2, \"expresar\": 4, \"explorar\": 6, \"diferentes.\": 2, \"listas\": 2, \"ayudan\": 2, \"organizarse\": 2, \"alegr\\u00eda.\": 2, \"aportan\": 2, \"tener?\": 2, \"mascota\": 2, \"mucha\": 2, \"escribir\": 6, \"pensamientos.\": 2, \"plasmar\": 2, \"\\u00a1buena\": 2, \"m\\u00e1s?\": 6, \"idea!\": 6, \"datos\": 2, \"viste?\": 2, \"refrescante.\": 2, \"casa\": 4, \"ambiente\": 2, \"afecta\": 2, \"todos.\": 2, \"clim\\u00e1tico\": 2, \"cambio\": 4, \"maravilloso.\": 4, \"sorprendernos.\": 2, \"dejaremos\": 2, \"universo\": 6, \"eso!\": 2, \"vasto\": 2, \"bien?\": 2, \"sali\\u00f3\": 2, \"saber?\": 2, \"espec\\u00edfico\": 2, \"capturar\": 6, \"museos\": 4, \"ofrecer.\": 2, \"conversaciones\": 2, \"profundas.\": 2, \"guiada\": 2, \"perfecto!\": 2, \"llevarte\": 2, \"nuevos.\": 2, \"lectura\": 2, \"origami\": 2, \"arte\": 4, \"rica.\": 2, \"motivaci\\u00f3n\": 2, \"nacionales\": 2, \"parques\": 2, \"hermosos\": 2, \"tratara?\": 4, \"proyecto.\": 4, \"volar.\": 10, \"vez\": 18, \"capacidad\": 4, \"tal\": 18, \"dif\\u00edcil!\": 4, \"oto\\u00f1o,\": 4, \"colores\": 4, \"su\": 20, \"viajes\": 4, \"pueden\": 14, \"emocionantes.\": 6, \"improvisados\": 4, \"pregunta!\": 4, \"haber\": 8, \"vivido\": 4, \"grecia.\": 4, \"debajo\": 4, \"escalera.\": 4, \"mucho,\": 8, \"pasar\": 6, \"evito\": 4, \"visitar\": 4, \"jap\\u00f3n,\": 4, \"querido\": 14, \"afuera.\": 4, \"\\u00a1qui\\u00e9n\": 4, \"sabe!\": 4, \"haya\": 4, \"all\\u00e1\": 4, \"grande\": 4, \"ser\\u00eda\": 42, \"innovador\": 4, \"futurista.\": 8, \"enorme\": 4, \"cercano,\": 4, \"gas.\": 4, \"esfera\": 4, \"fen\\u00f3menos\": 4, \"naturales\": 4, \"uno\": 4, \"impresionantes.\": 8, \"\\u00e1guila\": 4, \"volar\": 4, \"alto.\": 4, \"fascinante\": 8, \"nuevo\": 8, \"\\u00e9pocas.\": 4, \"diferentes\": 14, \"viajar\": 12, \"piano,\": 4, \"profundo.\": 4, \"sonido\": 4, \"gustado\": 4, \"ha\": 295, \"encantar\\u00eda\": 10, \"chocolate!\": 6, \"preparar\": 4, \"mundo\": 14, \"\\u00a1desear\\u00eda\": 4, \"sin\": 8, \"l\\u00edmites!\": 4, \"fuerte.\": 4, \"llamarme\": 4, \"r\\u00e1pido\": 6, \"\\\"rayo\\\",\": 4, \"sobre\": 18, \"\\u00a1quisiera\": 4, \"todo!\": 4, \"piensan\": 6, \"runner\\\"!\": 4, \"\\\"blade\": 4, \"maestra\": 4, \"obra\": 4, \"cine\": 4, \"habilidad\": 6, \"tener\": 311, \"desconectar\": 4, \"completamente\": 10, \"abuelo\": 4, \"mi\": 711, \"llevaba\": 4, \"parque,\": 4, \"especial.\": 4, \"cuando\": 6, \"recuerdo\": 4, \"m\\u00e1quina\": 4, \"ayude\": 4, \"interesante\": 4, \"todo.\": 6, \"darles\": 4, \"todos\": 20, \"vida\": 272, \"eliminar\": 4, \"pobreza\": 4, \"siento\": 8, \"aprendido\": 4, \"tocar\": 8, \"orgulloso\": 4, \"guitarra.\": 6, \"sol\": 4, \"playa\": 4, \"disfrutando\": 4, \"brisa.\": 4, \"preguntar\\u00eda\": 10, \"musk\": 4, \"spacex.\": 4, \"le\": 300, \"elon\": 6, \"inspir\\u00f3\": 4, \"crear\": 8, \"pasar\\u00e1,\": 4, \"tambi\\u00e9n\": 91, \"libertad\": 4, \"cambiarlo.\": 4, \"decisiones.\": 4, \"correcto\": 4, \"camino\": 4, \"hacen\": 8, \"esos\": 12, \"c\\u00f3mo\": 297, \"\\u00a1ser\\u00eda\": 4, \"trucos\": 8, \"\\u00a1definitivamente\": 4, \"\\\"harry\": 4, \"potter\\\"!\": 4, \"m\\u00e1gico.\": 4, \"cosas.\": 4, \"potencial\": 4, \"artificial\": 4, \"inteligencia\": 4, \"ella\": 4, \"electricidad\": 4, \"impresionante;\": 4, \"gracias\": 152, \"podemos\": 6, \"incre\\u00edble.\": 10, \"belleza.\": 4, \"vivir\": 14, \"par\\u00eds,\": 4, \"famoso\": 6, \"diferencia\": 4, \"positiva\": 4, \"conocer\": 4, \"dedicar\\u00eda\": 4, \"culturas.\": 8, \"einstein\": 4, \"albert\": 4, \"sus\": 6, \"hablar\": 120, \"teor\\u00edas.\": 4, \"algunos\": 4, \"cartas!\": 4, \"puedo\": 397, \"magia\": 4, \"aventura\": 4, \"exploraci\\u00f3n\": 4, \"bailar\": 2, \"divertida\": 2, \"fascinantes,\": 2, \"balance\": 2, \"uso.\": 2, \"creo\": 349, \"humanidad\": 2, \"visi\\u00f3n\": 6, \"futuro\": 4, \"se\\u00f1or\": 2, \"fascinante,\": 4, \"lleno\": 4, \"aventuras.\": 2, \"anillos\\\"\": 2, \"\\\"el\": 2, \"idea\": 2, \"plantea\": 2, \"emocionante,\": 2, \"desaf\\u00edos.\": 2, \"oc\\u00e9ano\": 2, \"misterios\": 4, \"criaturas\": 2, \"\\u00a1definitivamente!\": 4, \"tranquila,\": 4, \"rodeado\": 2, \"solo\": 216, \"isla\": 2, \"propio\": 2, \"viajar\\u00eda\": 4, \"comenzar\\u00eda\": 2, \"negocio\": 2, \"control\": 4, \"sue\\u00f1o.\": 2, \"sucede\": 2, \"propia\": 2, \"complicado,\": 2, \"cada\": 169, \"interesante.\": 6, \"\\u00a1\\\"el\": 2, \"lebowski\\\"\": 2, \"comedia\": 2, \"\\u00fanica.\": 4, \"favorita!\": 2, \"cansar\\u00eda\": 2, \"pizza.\": 2, \"\\u00a1pizza!\": 2, \"experiencia\": 6, \"representaciones\": 2, \"\\u00a1el\": 4, \"drag\\u00f3n!\": 2, \"imponente\": 2, \"mundo,\": 2, \"visitando\": 2, \"incre\\u00edbles.\": 4, \"ayudar\": 2, \"otras\": 4, \"positivo,\": 2, \"personas.\": 293, \"momento.\": 2, \"dif\\u00edcil,\": 4, \"permitir\\u00eda\": 2, \"cambiar\\u00eda\": 2, \"personales,\": 2, \"pasa\": 165, \"general,\": 2, \"raz\\u00f3n.\": 2, \"decisiones\": 4, \"algunas\": 6, \"necesiten\": 2, \"trabajos\": 2, \"posible,\": 2, \"humana.\": 2, \"habr\\u00e1\": 2, \"intervenci\\u00f3n\": 2, \"\\u00a1tiene\": 2, \"futuro!\": 2, \"invitar\\u00eda\": 2, \"musk,\": 2, \"ser\\u00e1\": 2, \"toque\": 2, \"humano\": 2, \"importante.\": 2, \"zelanda,\": 2, \"nueva\": 2, \"perro\": 2, \"grande,\": 2, \"pastor\": 2, \"alem\\u00e1n.\": 2, \"musicales.\": 2, \"instrumentos\": 2, \"mejorar\": 2, \"ayuda\": 6, \"aventura,\": 4, \"exist\\u00edan.\": 2, \"parte\": 4, \"descubrir\": 2, \"sab\\u00edas\": 2, \"manos.\": 2, \"pensado\": 6, \"divertido\": 4, \"ir\": 2, \"egipto\": 2, \"pir\\u00e1mides.\": 2, \"familia,\": 2, \"fiestas\": 2, \"celebramos\": 2, \"cena.\": 2, \"grandes\": 2, \"moderna,\": 2, \"ventanales\": 2, \"emocionante.\": 2, \"probarlo,\": 2, \"naturaleza!\": 2, \"senderismo,\": 2, \"especiales\": 2, \"entorno.\": 2, \"belleza\": 2, \"elegir\\u00eda\": 2, \"delf\\u00edn,\": 2, \"inteligentes!\": 2, \"explorando\": 2, \"nuevos\": 2, \"vacaciones\": 2, \"encantan\": 4, \"espacio.\": 2, \"diferente\": 2, \"nombre\": 2, \"vez,\": 2, \"abierto,\": 2, \"\\\"zelda\\\".\": 2, \"explorador\": 2, \"\\u00a1suena\": 2, \"nueva.\": 2, \"debemos\": 2, \"cuidado\": 2, \"riesgos.\": 2, \"salvar\": 2, \"vidas,\": 2, \"fascinantes\": 2, \"temprano.\": 2, \"sientes?\": 2, \"encanta,\": 2, \"picante.\": 2, \"exagerar\": 2, \"buen\\u00edsima!\": 2, \"viendo\": 2, \"serie\": 4, \"\\u00a1est\\u00e1\": 2, \"pudieras?\": 2, \"bater\\u00eda\": 2, \"suficiente\": 2, \"tiempo!\": 2, \"tuvi\\u00e9ramos\": 2, \"ducha.\": 2, \"s\\u00e9\": 2, \"talento\": 2, \"oculto,\": 2, \"cantar\": 2, \"playa.\": 2, \"prefiero\": 8, \"generalmente\": 2, \"prefieres?\": 4, \"comienzo\": 2, \"mejor\": 212, \"thrillers.\": 2, \"miedo.\": 2, \"comedias\": 2, \"dan\": 2, \"toda\": 4, \"vi\": 2, \"agotador\": 2, \"temporada\": 2, \"cerca\": 2, \"casa.\": 4, \"parque\": 4, \"motivaci\\u00f3n.\": 2, \"trato\": 2, \"hacerlo,\": 2, \"dif\\u00edcil\": 295, \"\\u00fanica\": 4, \"moderno\": 2, \"poco.\": 2, \"cuesta\": 2, \"vez.\": 2, \"comprar\": 2, \"l\\u00ednea.\": 2, \"c\\u00f3modo.\": 2, \"llevo\": 2, \"viajo.\": 2, \"fotograf\\u00eda.\": 2, \"c\\u00e1mara\": 2, \"acompa\\u00f1ante\": 2, \"importa.\": 2, \"sorprenden.\": 2, \"\\u00e1giles.\": 2, \"incre\\u00edblemente\": 2, \"estrategia.\": 2, \"rusas\": 2, \"monta\\u00f1as\": 2, \"atracciones\": 2, \"pastel\": 2, \"debilidad.\": 2, \"moverte.\": 2, \"querer\": 2, \"efecto,\": 2, \"\\\"forrest\": 2, \"gump\\\"\": 2, \"ver.\": 4, \"canso\": 2, \"esas\": 4, \"as\\u00ed?\": 2, \"bonita.\": 2, \"sientes\": 2, \"nostalgia\": 2, \"peque\\u00f1o\": 4, \"vacaciones.\": 2, \"fui\": 2, \"pueblo\": 2, \"paseo\": 4, \"frescos\": 2, \"ideales\": 2, \"sushi.\": 2, \"quise\": 2, \"buenas\": 2, \"depende.\": 2, \"sorpresas,\": 2, \"animaci\\u00f3n\": 2, \"ma\\u00f1ana.\": 2, \"madrugar.\": 2, \"productivo\": 4, \"mejor!\": 2, \"fundamental\": 2, \"experiencia.\": 2, \"comida\": 2, \"tomarme\": 2, \"da\": 210, \"miedo\": 2, \"espejo.\": 2, \"supersticioso,\": 2, \"romper\": 2, \"natural.\": 2, \"respirar\": 2, \"paisaje\": 2, \"medio\": 2, \"costa.\": 2, \"voy\": 2, \"inspirado.\": 2, \"\\u00e1rboles\": 2, \"festival\": 2, \"atm\\u00f3sfera\": 2, \"bonita\": 2, \"creatividad.\": 2, \"relajarme,\": 2, \"ciudad.\": 2, \"energ\\u00eda\": 2, \"cierto!\": 8, \"libro.\": 2, \"podcast?\": 2, \"\\u00bfsobre\": 2, \"preparar?\": 2, \"maravillas.\": 2, \"totalmente\": 2, \"necesario.\": 2, \"justo\": 4, \"pasa.\": 2, \"eso\": 295, \"intentar\": 2, \"ideas.\": 2, \"comunicaci\\u00f3n\": 2, \"aclarar\": 2, \"impulso\": 2, \"creativo\": 4, \"fotograf\\u00eda\": 2, \"fotos\": 2, \"especiales.\": 2, \"trataba\": 2, \"divertirse.\": 2, \"baile\": 2, \"especial!\": 2, \"\\u00a1las\": 2, \"reflexionar.\": 2, \"normal,\": 4, \"calma\": 6, \"experimentar\": 2, \"fant\\u00e1stico!\": 4, \"recientemente?\": 2, \"comida.\": 2, \"reconfortante.\": 2, \"cierto,\": 6, \"hemos\": 2, \"tomar\": 4, \"tareas\": 2, \"descansos\": 2, \"organizar\": 4, \"ah\\u00ed.\": 2, \"estado\": 2, \"tomando\": 2, \"ritmo\": 2, \"descansar?\": 2, \"gimnasio.\": 2, \"haces?\": 2, \"estr\\u00e9s\": 4, \"decisi\\u00f3n!\": 2, \"concentraci\\u00f3n.\": 2, \"chocolate?\": 2, \"adem\\u00e1s,\": 2, \"comprensible.\": 2, \"personal.\": 2, \"maravilloso!\": 2, \"hoy?\": 2, \"favorito\": 2, \"lugar\": 2, \"caminar?\": 2, \"perfecta\": 2, \"necesita.\": 2, \"relajado\": 2, \"energ\\u00eda.\": 2, \"va\": 2, \"d\\u00eda?\": 2, \"parecen\": 2, \"yoga,\": 2, \"opciones:\": 2, \"probar?\": 2, \"lectura,\": 2, \"paseos\": 2, \"calmar\": 2, \"experiencias\": 4, \"libros,\": 2, \"maravilloso\": 2, \"permiten\": 2, \"dibujo\": 2, \"expresarte.\": 2, \"dibujar?\": 2, \"escribir,\": 2, \"probar\": 2, \"\\u00a1puedes\": 2, \"incluso\": 4, \"hobby!\": 2, \"vuelve.\": 2, \"fluye,\": 2, \"\\u00fanica!\": 2, \"energ\\u00edas.\": 2, \"veces,\": 2, \"recargar\": 2, \"diferencia.\": 2, \"enganchados.\": 2, \"productiva?\": 2, \"para.\": 2, \"pero,\": 10, \"crees\": 16, \"vivimos\": 2, \"\\u00bfno\": 16, \"verdad,\": 2, \"decidir\": 2, \"tus\": 2, \"sueles\": 4, \"opciones.\": 2, \"tantas\": 288, \"entre\": 285, \"decisiones?\": 2, \"camino?\": 2, \"com\\u00fan.\": 2, \"inseguro\": 2, \"direcci\\u00f3n.\": 2, \"duda\": 4, \"aspecto\": 2, \"\\u00bfcrees\": 8, \"veces.\": 2, \"abrumadoras\": 2, \"podr\\u00edan\": 4, \"positivo?\": 2, \"total,\": 2, \"situaciones\": 2, \"oportunidades\": 2, \"tenemos\": 6, \"normal.\": 2, \"est\\u00e1n\": 2, \"priorizar\": 2, \"aceptaci\\u00f3n.\": 2, \"raz\\u00f3n,\": 2, \"cosas?\": 2, \"tienes\": 71, \"personas\": 2, \"v\\u00e1lido.\": 2, \"eran\": 2, \"tecnolog\\u00eda\": 295, \"posibles.\": 2, \"antes\": 2, \"punto\": 2, \"conecta\": 2, \"lado,\": 2, \"herramienta\": 2, \"nuestras\": 4, \"pasa!\": 2, \"vidas?\": 2, \"\\u00fatil\": 2, \"situaciones,\": 2, \"deseo!\": 2, \"inevitable\": 2, \"equilibrio?\": 2, \"b\\u00fasqueda\": 2, \"piensas\": 2, \"totalmente.\": 2, \"vista\": 2, \"realmente\": 6, \"perder\": 4, \"constante\": 2, \"dinero\": 2, \"felices.\": 4, \"frustrante.\": 4, \"sociedad\": 2, \"aceptaci\\u00f3n\": 2, \"mayor\": 2, \"no?\": 2, \"hacia\": 2, \"necesitemos\": 2, \"cuenta\": 2, \"l\\u00e1stima\": 2, \"evitarlo?\": 2, \"valor.\": 2, \"peligroso,\": 2, \"supieran\": 2, \"\\u00bfno?\": 6, \"\\u00fatil,\": 2, \"surgir\": 2, \"dem\\u00e1s,\": 2, \"malentendidos.\": 2, \"medios?\": 2, \"entiendo\": 4, \"dices.\": 2, \"noticias\": 2, \"pesimistas.\": 2, \"repetitivas\": 2, \"diversidad\": 2, \"falta\": 2, \"sabemos\": 2, \"vamos\": 2, \"interesante?\": 2, \"hacer.\": 2, \"claro,\": 2, \"agregar\": 2, \"emoci\\u00f3n\": 2, \"opinas?\": 4, \"vida.\": 2, \"caos\": 2, \"aburrirnos.\": 2, \"simples\": 2, \"vidas.\": 2, \"encontrado\": 2, \"estamos\": 4, \"sentido\": 4, \"prop\\u00f3sito?\": 2, \"d\\u00e9\": 2, \"interesante,\": 2, \"\\u00bft\\u00fa\": 6, \"totalmente,\": 2, \"posible\": 2, \"agitados?\": 2, \"peque\\u00f1os\": 2, \"perspectivas\": 2, \"considerado\": 2, \"vida?\": 2, \"v\\u00e1lida.\": 2, \"final\": 2, \"piensas?\": 2, \"deben\": 2, \"valiosas,\": 2, \"externas\": 2, \"personales.\": 2, \"opiniones\": 2, \"abajo.\": 2, \"arriba,\": 2, \"enfrentamos\": 2, \"monta\\u00f1a\": 2, \"rusa,\": 2, \"felicidad\": 2, \"misma\": 2, \"pregunta.\": 169, \"entendemos\": 2, \"manera?\": 2, \"subjetiva,\": 2, \"bonito\": 2, \"es.\": 2, \"opini\\u00f3n\": 2, \"amor\": 286, \"amor?\": 2, \"doloroso.\": 2, \"duda.\": 2, \"trav\\u00e9s\": 2, \"vivimos?\": 2, \"encontramos\": 2, \"pasamos\": 2, \"honesto\": 2, \"acuerdo,\": 2, \"doloroso\": 2, \"inc\\u00f3modo.\": 2, \"ves\": 2, \"lentos\": 2, \"pase\": 2, \"interminables.\": 2, \"d\\u00edas?\": 2, \"menudo\": 2, \"alegr\\u00edas\": 2, \"peque\\u00f1as\": 2, \"definitivamente.\": 2, \"reales.\": 2, \"interacciones\": 2, \"conectan,\": 2, \"alejan\": 2, \"todas\": 2, \"positivas,\": 2, \"traer\": 2, \"facilitar\": 2, \"partes,\": 2, \"comunicaci\\u00f3n?\": 2, \"preocupaci\\u00f3n.\": 2, \"futuro?\": 2, \"sorpresas\": 2, \"esperas\": 2, \"\\u00a1probablemente!\": 2, \"final,\": 2, \"incertidumbre,\": 2, \"encanto,\": 2, \"sorpresa.\": 2, \"ella,\": 2, \"previsibilidad\": 2, \"habr\\u00eda\": 2, \"answer\": 1, \"cumplimos\": 276, \"realidad,\": 276, \"a\\u00f1os.\": 276, \"edad.\": 276, \"tengo\": 1751, \"bots\": 276, \"responder.\": 208, \"hardware\": 291, \"tocado\": 264, \"hundido.\": 264, \"nadie.\": 259, \"dependo\": 259, \"verdad\": 259, \"talentos.\": 283, \"ayudarte.\": 267, \"charlar\": 267, \"crearon\": 291, \"vengo\": 288, \"familia.\": 288, \"saga\": 288, \"c\\u00f3digo.\": 288, \"larga\": 288, \"bot.\": 66, \"feliz!\": 291, \"\\u00a1soy\": 291, \"alimento\": 210, \"conocimiento.\": 210, \"llevar\\u00edamos\": 269, \"ning\\u00fan\": 269, \"seguro\": 269, \"conocido\": 269, \"bot,\": 269, \"cosas...\": 286, \"pienso...\": 148, \"nombre.\": 148, \"claro.\": 291, \"monta\\u00f1as.\": 284, \"mueve\": 284, \"o\\u00eddo\": 574, \"dir\\u00eda.\": 268, \"supiera,\": 268, \"sabes.\": 291, \"ganas\": 291, \"goleada...\": 291, \"t\\u00fa.\": 290, \"(que\": 290, \"fuera\": 290, \"concurso\": 290, \"ganar\\u00edas\": 290, \"es),\": 290, \"esto\": 683, \"eres.\": 291, \"veo,\": 291, \"coraz\\u00f3n.\": 291, \"escucha\": 291, \"cosa:\": 264, \"f\\u00e1cil.\": 264, \"compartimos\": 264, \"hacerte\": 264, \"no.\": 189, \"claro\": 189, \"compromiso\": 150, \"\\u00fanico\": 150, \"amistad.\": 150, \"estoy.\": 400, \"quieres\": 167, \"cosa.\": 167, \"otra\": 167, \"distinto,\": 167, \"respuesta\": 167, \"pregunta\": 167, \"bot\": 297, \"creado\": 297, \"humanos.\": 297, \"aqu\\u00ed.\": 292, \"simplemente\": 292, \"digital,\": 292, \"b\\u00e1sicamente\": 291, \"esto.\": 291, \"oh,\": 291, \"vaya.\": 291, \"chinche\": 290, \"quiero\": 290, \"dice\": 290, \"chincheramente.\": 290, \"chinche?\": 290, \"gimnasio?\": 291, \"zumba.\": 291, \"abeja\": 291, \"gracia\": 291, \"sorprenda\": 291, \"pensado.\": 291, \"demanda,\": 291, \"quiz\\u00e1\": 291, \"menos\": 291, \"vale,\": 145, \"callo.\": 145, \"dar.\": 393, \"na,\": 393, \"nanan\\u00e1.\": 393, \"nana,\": 393, \"suban\": 61, \"vas\": 61, \"colores.\": 61, \"podr\\u00edamos\": 272, \"construcci\\u00f3n\\\".\": 272, \"\\\"en\": 272, \"ve\": 252, \"soy.\": 282, \"siento!\": 113, \"guay.\": 580, \"alegro\": 170, \"gracia.\": 170, \"haga\": 170, \"preocupes.\": 161, \"puedo.\": 547, \"\\u00a1guay!\": 154, \"\\u00a1no\": 161, \"nada!\": 161, \"sigo...\": 63, \"luego.\": 217, \"hasta\": 217, \"\\u00a1hey!\": 155, \"\\u00a1buenas\": 59, \"tardes!\": 59, \"ma\\u00f1ana!\": 166, \"\\u00a1buenos\": 66, \"\\u00a1hasta\": 297, \"preguntar.\": 148, \"preguntar!\": 288, \"\\u00a1gracias\": 288, \"placer.\": 97, \"igualmente.\": 290, \"yo,\": 290, \"saludar\\u00e9\": 290, 