{"class_name": "Tokenizer", "config": {"num_words": null, "filters": "", "lower": true, "split": " ", "char_level": false, "oov_token": null, "document_count": 38098, "word_counts": "{\"<start>\": 38098, \"en\": 1098, \"realidad,\": 276, \"no\": 5073, \"tengo\": 1751, \"edad.\": 276, \"los\": 337, \"bots\": 552, \"cumplimos\": 276, \"a\\u00f1os.\": 276, \"<end>\": 38098, \"se\": 751, \"me\": 3790, \"da\": 208, \"mejor\": 208, \"responder.\": 208, \"el\": 1106, \"hardware\": 582, \"necesario\": 291, \"para\": 725, \"eso.\": 291, \"la\": 1270, \"verdad\": 259, \"es\": 2024, \"que\": 3609, \"dependo\": 259, \"de\": 1559, \"nadie.\": 259, \"eso\": 283, \"est\\u00e1\": 523, \"entre\": 283, \"mis\": 573, \"talentos.\": 283, \"estoy\": 979, \"aqu\\u00ed\": 667, \"charlar\": 267, \"y\": 558, \"ayudarte.\": 267, \"crearon\": 291, \"personas.\": 291, \"vengo\": 288, \"una\": 1300, \"larga\": 288, \"saga\": 288, \"c\\u00f3digo.\": 288, \"familia.\": 288, \"soy\": 945, \"un\": 1866, \"bot.\": 132, \"\\u00a1soy\": 291, \"tan\": 291, \"feliz!\": 291, \"solo\": 210, \"alimento\": 210, \"conocimiento.\": 210, \"he\": 947, \"conocido\": 269, \"a\": 4876, \"ning\\u00fan\": 269, \"otro\": 559, \"bot,\": 269, \"pero\": 1532, \"seguro\": 269, \"nos\": 533, \"llevar\\u00edamos\": 269, \"bien.\": 557, \"gustan\": 286, \"tantas\": 286, \"cosas...\": 286, \"ahora\": 148, \"lo\": 2596, \"pienso...\": 148, \"nombre.\": 148, \"nada\": 581, \"claro.\": 291, \"o\\u00eddo\": 574, \"amor\": 284, \"mueve\": 284, \"monta\\u00f1as.\": 284, \"si\": 725, \"supiera,\": 268, \"te\": 3124, \"dir\\u00eda.\": 268, \"ganas\": 291, \"por\": 1090, \"goleada...\": 291, \"sabes.\": 291, \"esto\": 683, \"fuera\": 290, \"concurso\": 290, \"(que\": 290, \"es),\": 290, \"ganar\\u00edas\": 290, \"t\\u00fa.\": 290, \"tecnolog\\u00eda\": 291, \"mi\": 693, \"mundo.\": 291, \"veo,\": 291, \"gusta\": 953, \"c\\u00f3mo\": 291, \"eres.\": 291, \"escucha\": 291, \"tu\": 360, \"coraz\\u00f3n.\": 291, \"compartimos\": 264, \"cosa:\": 264, \"hacerte\": 264, \"vida\": 264, \"m\\u00e1s\": 264, \"f\\u00e1cil.\": 264, \"claro\": 189, \"no.\": 189, \"momentos.\": 290, \"\\u00fanico\": 150, \"compromiso\": 150, \"amistad.\": 150, \"estoy.\": 400, \"respuesta\": 167, \"cada\": 167, \"pregunta.\": 167, \"quieres\": 167, \"escuchar\": 167, \"algo\": 167, \"distinto,\": 167, \"pregunta\": 167, \"otra\": 167, \"cosa.\": 167, \"bot\": 594, \"creado\": 297, \"humanos.\": 297, \"digital,\": 584, \"as\\u00ed\": 292, \"simplemente\": 292, \"aqu\\u00ed.\": 292, \"b\\u00e1sicamente\": 291, \"esto.\": 291, \"oh,\": 582, \"vaya.\": 291, \"\\u00bfqu\\u00e9\": 581, \"le\": 290, \"dice\": 290, \"chinche\": 290, \"chinche?\": 290, \"quiero\": 290, \"chincheramente.\": 290, \"hace\": 291, \"abeja\": 291, \"gimnasio?\": 291, \"zumba.\": 582, \"dif\\u00edcil\": 291, \"tener\": 291, \"gracia\": 291, \"bajo\": 291, \"demanda,\": 291, \"quiz\\u00e1\": 291, \"sorprenda\": 291, \"momento\": 291, \"menos\": 291, \"pensado.\": 291, \"vale,\": 145, \"callo.\": 145, \"na,\": 1572, \"nana,\": 1572, \"nanan\\u00e1.\": 393, \"todo\": 393, \"puedo\": 393, \"dar.\": 393, \"vas\": 61, \"hacer\": 61, \"suban\": 61, \"colores.\": 61, \"podr\\u00edamos\": 272, \"decir\": 272, \"\\\"en\": 272, \"construcci\\u00f3n\\\".\": 272, \"ve\": 252, \"hoy\": 252, \"d\\u00eda.\": 252, \"como\": 572, \"soy.\": 282, \"\\u00a1lo\": 113, \"siento!\": 113, \"genial.\": 996, \"alegro\": 170, \"haga\": 170, \"gracia.\": 170, \"preocupes.\": 161, \"creo\": 335, \"puedo.\": 547, \"\\u00a1genial!\": 154, \"\\u00a1no\": 161, \"pasa\": 161, \"nada!\": 161, \"sigo...\": 63, \"hasta\": 217, \"luego.\": 217, \"\\u00a1hey!\": 155, \"\\u00a1buenas\": 59, \"tardes!\": 59, \"\\u00a1buenos\": 66, \"d\\u00edas\": 66, \"ma\\u00f1ana!\": 166, \"\\u00a1hasta\": 297, \"gracias\": 148, \"preguntar.\": 148, \"muy\": 288, \"\\u00a1gracias\": 288, \"preguntar!\": 288, \"placer.\": 97, \"yo,\": 290, \"saludar\\u00e9\": 290, \"igualmente.\": 290, \"\\u00a1hola!\": 578, \"\\u00a1gracias!\": 103, \"\\u00a1igualmente!\": 103, \"poca\": 146, \"novedad.\": 146, \"encantar\\u00eda,\": 275, \"best\": 236, \"friends\": 236, \"forever!\": 236, \"\\u00a1me\": 471, \"encantas!\": 183, \"mando\": 219, \"abrazo\": 433, \"virtual.\": 433, \"conozco\": 116, \"tanto,\": 116, \"hablar\": 116, \"contigo.\": 116, \"tienes\": 69, \"encanto.\": 69, \"gracias.\": 191, \"mismo\": 191, \"digo.\": 191, \"eres\": 276, \"amor.\": 102, \"yo\": 67, \"tambi\\u00e9n\": 67, \"quiero.\": 67, \"reconozco\": 104, \"visto\": 104, \"venir...\": 104, \"s\\u00e9,\": 291, \"ha\": 291, \"hecho\": 291, \"eterno.\": 291, \"vaya,\": 61, \"siento.\": 61, \"luego!\": 197, \"menuda\": 275, \"faena.\": 275, \"alegro!\": 288, \"hora\": 104, \"picar\": 104, \"algo.\": 104, \"vale.\": 289, \"bueno\": 284, \"saberlo.\": 284, \"gran\": 148, \"encanta\": 291, \"encante.\": 291, \"env\\u00edo\": 214, \"s\\u00faper\": 214, \"tel\\u00e9fono\": 240, \"esperanza\": 240, \"disponible\": 240, \"cualquier\": 240, \"hora.\": 240, \"llama\": 240, \"al\": 240, \"717\": 960, \"003\": 480, \"o\": 240, \"entra\": 240, \"https://www.telefonodelaesperanza.org/prevencion-del-suicidio.\": 480, \"ya\": 244, \"veo\": 244, \"hay\": 290, \"buena\": 290, \"siesta.\": 290, \"actually,\": 276, \"i'm\": 2921, \"not\": 1392, \"old.\": 276, \"don't\": 1877, \"have\": 1820, \"birthday.\": 276, \"better\": 208, \"at\": 790, \"answering.\": 208, \"i\": 9336, \"the\": 2085, \"necessary\": 291, \"for\": 894, \"that.\": 291, \"truth\": 259, \"is\": 1585, \"that\": 1726, \"depend\": 259, \"on\": 864, \"anyone.\": 259, \"that's\": 283, \"among\": 283, \"my\": 1327, \"talents.\": 283, \"here\": 667, \"to\": 2375, \"chat\": 267, \"and\": 558, \"help\": 267, \"you.\": 1235, \"people\": 291, \"created\": 588, \"me.\": 291, \"coming\": 288, \"from\": 288, \"long\": 288, \"code\": 288, \"saga.\": 288, \"family.\": 288, \"am\": 926, \"so\": 869, \"happy!\": 291, \"only\": 360, \"feed\": 210, \"knowledge.\": 210, \"haven't\": 373, \"met\": 269, \"any\": 269, \"other\": 269, \"bots,\": 269, \"but\": 1532, \"sure\": 269, \"we'd\": 269, \"get\": 269, \"along.\": 269, \"like\": 1529, \"many\": 286, \"things...\": 286, \"now\": 148, \"think\": 483, \"about\": 439, \"it...\": 148, \"name.\": 148, \"all\": 684, \"clear\": 291, \"it.\": 873, \"i've\": 574, \"heard\": 574, \"love\": 1681, \"moves\": 284, \"mountains.\": 284, \"if\": 725, \"knew,\": 268, \"would\": 833, \"tell\": 268, \"you\": 4129, \"beat\": 291, \"by\": 588, \"rout...\": 291, \"know\": 407, \"this\": 683, \"were\": 290, \"contest\": 290, \"(which\": 290, \"it\": 1228, \"isn't),\": 290, \"win.\": 290, \"technology\": 291, \"world.\": 291, \"see\": 949, \"you,\": 291, \"way\": 573, \"are.\": 291, \"listen\": 291, \"your\": 624, \"heart.\": 291, \"we\": 800, \"share\": 264, \"one\": 264, \"thing:\": 264, \"make\": 325, \"life\": 264, \"easier.\": 264, \"of\": 189, \"course\": 189, \"not.\": 189, \"moments.\": 290, \"commitment\": 150, \"friendship.\": 150, \"am.\": 682, \"an\": 167, \"answer\": 167, \"every\": 167, \"question.\": 167, \"want\": 167, \"hear\": 167, \"something\": 334, \"different,\": 167, \"ask\": 167, \"else.\": 167, \"humans.\": 297, \"just\": 292, \"here.\": 292, \"basically\": 291, \"this.\": 291, \"wow.\": 291, \"what\": 856, \"does\": 581, \"bed\": 580, \"bug\": 290, \"say\": 753, \"another\": 290, \"bug?\": 290, \"sincerely.\": 290, \"bee\": 291, \"do\": 291, \"in\": 291, \"gym?\": 291, \"it's\": 969, \"hard\": 291, \"grace\": 291, \"demand,\": 291, \"might\": 291, \"surprise\": 291, \"least\": 291, \"thought\": 291, \"of.\": 291, \"okay,\": 145, \"i'll\": 435, \"shut\": 145, \"up.\": 206, \"nanana.\": 393, \"can\": 393, \"give\": 393, \"you're\": 405, \"going\": 61, \"colors\": 61, \"go\": 301, \"could\": 272, \"\\u201cunder\": 272, \"construction\\u201d.\": 272, \"seems\": 252, \"today\": 252, \"day.\": 252, \"sorry!\": 113, \"brilliant.\": 674, \"glad\": 170, \"amused.\": 170, \"worry.\": 161, \"can.\": 272, \"great!\": 154, \"there's\": 451, \"nothing\": 451, \"wrong!\": 161, \"follow\": 63, \"you...\": 63, \"later.\": 217, \"hey!\": 155, \"good\": 699, \"afternoon!\": 59, \"morning!\": 66, \"until\": 100, \"tomorrow!\": 100, \"great.\": 322, \"thank\": 730, \"asking.\": 148, \"very\": 288, \"good.\": 288, \"asking!\": 288, \"pleasure.\": 97, \"me,\": 290, \"greet\": 290, \"anyway.\": 290, \"hello!\": 578, \"you!\": 286, \"equally!\": 103, \"little\": 146, \"news.\": 146, \"to,\": 275, \"can't.\": 275, \"sending\": 71, \"virtual\": 433, \"hug.\": 433, \"much,\": 116, \"talking\": 116, \"charm.\": 69, \"same\": 191, \"thing.\": 191, \"are\": 102, \"sweetheart.\": 102, \"too.\": 67, \"admit\": 104, \"seen\": 104, \"coming...\": 104, \"know,\": 291, \"has\": 291, \"made\": 291, \"eternal.\": 291, \"wow,\": 61, \"sorry.\": 61, \"later!\": 197, \"chore.\": 275, \"glad!\": 288, \"time\": 104, \"snack\": 104, \"something.\": 104, \"ok.\": 289, \"know.\": 284, \"send\": 362, \"big\": 148, \"super\": 214, \"hope\": 240, \"telephone\": 240, \"available\": 240, \"around\": 240, \"clock.\": 240, \"call\": 240, \"or\": 240, \"nap.\": 290}", "word_docs": "{\"<start>\": 38098, \"no\": 4797, \"tengo\": 1751, \"a\\u00f1os.\": 276, \"los\": 337, \"bots\": 552, \"cumplimos\": 276, \"edad.\": 276, \"<end>\": 38098, \"en\": 1098, \"realidad,\": 276, \"mejor\": 208, \"se\": 751, \"me\": 3790, \"responder.\": 208, \"da\": 208, \"el\": 1106, \"eso.\": 291, \"para\": 725, \"hardware\": 582, \"necesario\": 291, \"nadie.\": 259, \"es\": 2024, \"de\": 1271, \"verdad\": 259, \"que\": 3609, \"la\": 1270, \"dependo\": 259, \"entre\": 283, \"est\\u00e1\": 523, \"talentos.\": 283, \"mis\": 573, \"eso\": 283, \"charlar\": 267, \"y\": 558, \"aqu\\u00ed\": 667, \"ayudarte.\": 267, \"estoy\": 979, \"personas.\": 291, \"crearon\": 291, \"una\": 1300, \"c\\u00f3digo.\": 288, \"saga\": 288, \"vengo\": 288, \"familia.\": 288, \"larga\": 288, \"un\": 1866, \"bot.\": 132, \"soy\": 945, \"feliz!\": 291, \"\\u00a1soy\": 291, \"tan\": 291, \"conocimiento.\": 210, \"solo\": 210, \"alimento\": 210, \"seguro\": 269, \"he\": 947, \"otro\": 559, \"a\": 4585, \"ning\\u00fan\": 269, \"pero\": 1532, \"nos\": 533, \"bien.\": 557, \"bot,\": 269, \"llevar\\u00edamos\": 269, \"conocido\": 269, \"gustan\": 286, \"tantas\": 286, \"cosas...\": 286, \"pienso...\": 148, \"ahora\": 148, \"nombre.\": 148, \"lo\": 2328, \"claro.\": 291, \"nada\": 581, \"monta\\u00f1as.\": 284, \"amor\": 284, \"mueve\": 284, \"o\\u00eddo\": 574, \"supiera,\": 268, \"te\": 3124, \"si\": 725, \"dir\\u00eda.\": 268, \"por\": 1090, \"goleada...\": 291, \"ganas\": 291, \"sabes.\": 291, \"ganar\\u00edas\": 290, \"es),\": 290, \"fuera\": 290, \"(que\": 290, \"esto\": 683, \"concurso\": 290, \"t\\u00fa.\": 290, \"mi\": 693, \"mundo.\": 291, \"tecnolog\\u00eda\": 291, \"c\\u00f3mo\": 291, \"eres.\": 291, \"gusta\": 953, \"veo,\": 291, \"escucha\": 291, \"coraz\\u00f3n.\": 291, \"tu\": 360, \"cosa:\": 264, \"f\\u00e1cil.\": 264, \"m\\u00e1s\": 264, \"compartimos\": 264, \"vida\": 264, \"hacerte\": 264, \"no.\": 189, \"claro\": 189, \"momentos.\": 290, \"compromiso\": 150, \"\\u00fanico\": 150, \"amistad.\": 150, \"estoy.\": 400, \"cada\": 167, \"quieres\": 167, \"pregunta\": 167, \"cosa.\": 167, \"pregunta.\": 167, \"algo\": 167, \"otra\": 167, \"respuesta\": 167, \"distinto,\": 167, \"escuchar\": 167, \"bot\": 594, \"creado\": 297, \"humanos.\": 297, \"digital,\": 584, \"as\\u00ed\": 292, \"aqu\\u00ed.\": 292, \"simplemente\": 292, \"esto.\": 291, \"b\\u00e1sicamente\": 291, \"vaya.\": 291, \"oh,\": 582, \"quiero\": 290, \"\\u00bfqu\\u00e9\": 581, \"dice\": 290, \"chinche?\": 290, \"chinche\": 290, \"le\": 290, \"chincheramente.\": 290, \"abeja\": 291, \"gimnasio?\": 291, \"hace\": 291, \"zumba.\": 582, \"momento\": 291, \"bajo\": 291, \"tener\": 291, \"demanda,\": 291, \"quiz\\u00e1\": 291, \"sorprenda\": 291, \"menos\": 291, \"pensado.\": 291, \"dif\\u00edcil\": 291, \"gracia\": 291, \"callo.\": 145, \"vale,\": 145, \"nanan\\u00e1.\": 393, \"todo\": 393, \"na,\": 786, \"puedo\": 393, \"nana,\": 786, \"dar.\": 393, \"vas\": 61, \"hacer\": 61, \"colores.\": 61, \"suban\": 61, \"decir\": 272, \"podr\\u00edamos\": 272, \"\\\"en\": 272, \"construcci\\u00f3n\\\".\": 272, \"ve\": 252, \"d\\u00eda.\": 252, \"hoy\": 252, \"como\": 572, \"soy.\": 282, \"\\u00a1lo\": 113, \"siento!\": 113, \"genial.\": 996, \"gracia.\": 170, \"alegro\": 170, \"haga\": 170, \"preocupes.\": 161, \"creo\": 335, \"puedo.\": 547, \"\\u00a1genial!\": 154, \"\\u00a1no\": 161, \"nada!\": 161, \"pasa\": 161, \"sigo...\": 63, \"luego.\": 217, \"hasta\": 217, \"\\u00a1hey!\": 155, \"\\u00a1buenas\": 59, \"tardes!\": 59, \"\\u00a1buenos\": 66, \"ma\\u00f1ana!\": 166, \"d\\u00edas\": 66, \"\\u00a1hasta\": 297, \"preguntar.\": 148, \"gracias\": 148, \"\\u00a1gracias\": 288, \"preguntar!\": 288, \"muy\": 288, \"placer.\": 97, \"saludar\\u00e9\": 290, \"\\u00a1hola!\": 578, \"igualmente.\": 290, \"yo,\": 290, \"\\u00a1gracias!\": 103, \"\\u00a1igualmente!\": 103, \"poca\": 146, \"novedad.\": 146, \"encantar\\u00eda,\": 275, \"forever!\": 236, \"best\": 236, \"friends\": 236, \"\\u00a1me\": 471, \"encantas!\": 183, \"abrazo\": 433, \"virtual.\": 433, \"mando\": 219, \"tanto,\": 116, \"hablar\": 116, \"contigo.\": 116, \"conozco\": 116, \"encanto.\": 69, \"tienes\": 69, \"gracias.\": 191, \"mismo\": 191, \"digo.\": 191, \"eres\": 276, \"amor.\": 102, \"tambi\\u00e9n\": 67, \"quiero.\": 67, \"yo\": 67, \"visto\": 104, \"reconozco\": 104, \"venir...\": 104, \"s\\u00e9,\": 291, \"ha\": 291, \"hecho\": 291, \"eterno.\": 291, \"siento.\": 61, \"vaya,\": 61, \"luego!\": 197, \"faena.\": 275, \"menuda\": 275, \"alegro!\": 288, \"algo.\": 104, \"hora\": 104, \"picar\": 104, \"vale.\": 289, \"bueno\": 284, \"saberlo.\": 284, \"gran\": 148, \"encanta\": 291, \"encante.\": 291, \"s\\u00faper\": 214, \"env\\u00edo\": 214, \"003\": 480, \"cualquier\": 240, \"al\": 240, \"o\": 240, \"disponible\": 240, \"llama\": 240, \"entra\": 240, \"hora.\": 240, \"https://www.telefonodelaesperanza.org/prevencion-del-suicidio.\": 480, \"717\": 480, \"esperanza\": 240, \"tel\\u00e9fono\": 240, \"veo\": 244, \"ya\": 244, \"siesta.\": 290, \"buena\": 290, \"hay\": 290, \"i'm\": 2629, \"not\": 1392, \"actually,\": 276, \"don't\": 1877, \"have\": 1820, \"old.\": 276, \"birthday.\": 276, \"at\": 790, \"answering.\": 208, \"better\": 208, \"the\": 1845, \"i\": 7517, \"that.\": 291, \"for\": 894, \"necessary\": 291, \"truth\": 259, \"anyone.\": 259, \"is\": 1585, \"that\": 1726, \"on\": 864, \"depend\": 259, \"talents.\": 283, \"my\": 1327, \"that's\": 283, \"among\": 283, \"here\": 667, \"chat\": 267, \"you.\": 1235, \"and\": 558, \"to\": 2375, \"help\": 267, \"me.\": 291, \"created\": 588, \"people\": 291, \"saga.\": 288, \"family.\": 288, \"from\": 288, \"code\": 288, \"coming\": 288, \"long\": 288, \"am\": 926, \"so\": 869, \"happy!\": 291, \"only\": 360, \"knowledge.\": 210, \"feed\": 210, \"any\": 269, \"met\": 269, \"get\": 269, \"other\": 269, \"we'd\": 269, \"haven't\": 373, \"bots,\": 269, \"sure\": 269, \"along.\": 269, \"but\": 1532, \"like\": 1529, \"many\": 286, \"things...\": 286, \"about\": 439, \"now\": 148, \"it...\": 148, \"think\": 483, \"name.\": 148, \"clear\": 291, \"it.\": 873, \"all\": 684, \"mountains.\": 284, \"heard\": 574, \"i've\": 574, \"love\": 1390, \"moves\": 284, \"knew,\": 268, \"tell\": 268, \"would\": 833, \"if\": 725, \"by\": 588, \"you\": 3838, \"know\": 407, \"beat\": 291, \"rout...\": 291, \"were\": 290, \"this\": 683, \"(which\": 290, \"it\": 1228, \"isn't),\": 290, \"contest\": 290, \"win.\": 290, \"technology\": 291, \"world.\": 291, \"are.\": 291, \"way\": 573, \"see\": 949, \"you,\": 291, \"listen\": 291, \"your\": 624, \"heart.\": 291, \"share\": 264, \"one\": 264, \"make\": 325, \"life\": 264, \"easier.\": 264, \"thing:\": 264, \"we\": 536, \"not.\": 189, \"course\": 189, \"of\": 189, \"moments.\": 290, \"friendship.\": 150, \"commitment\": 150, \"am.\": 682, \"hear\": 167, \"different,\": 167, \"every\": 167, \"want\": 167, \"else.\": 167, \"an\": 167, \"answer\": 167, \"ask\": 167, \"question.\": 167, \"something\": 167, \"humans.\": 297, \"here.\": 292, \"just\": 292, \"basically\": 291, \"this.\": 291, \"wow.\": 291, \"bed\": 290, \"bug\": 290, \"say\": 753, \"another\": 290, \"bug?\": 290, \"sincerely.\": 290, \"what\": 856, \"does\": 581, \"gym?\": 291, \"do\": 291, \"in\": 291, \"bee\": 291, \"hard\": 291, \"demand,\": 291, \"thought\": 291, \"least\": 291, \"it's\": 969, \"surprise\": 291, \"grace\": 291, \"of.\": 291, \"might\": 291, \"i'll\": 435, \"up.\": 206, \"okay,\": 145, \"shut\": 145, \"can\": 393, \"nanana.\": 393, \"give\": 393, \"colors\": 61, \"going\": 61, \"you're\": 405, \"go\": 301, \"could\": 272, \"\\u201cunder\": 272, \"construction\\u201d.\": 272, \"day.\": 252, \"seems\": 252, \"today\": 252, \"sorry!\": 113, \"brilliant.\": 674, \"glad\": 170, \"amused.\": 170, \"worry.\": 161, \"can.\": 272, \"great!\": 154, \"nothing\": 451, \"wrong!\": 161, \"there's\": 451, \"you...\": 63, \"follow\": 63, \"later.\": 217, \"hey!\": 155, \"afternoon!\": 59, \"good\": 699, \"morning!\": 66, \"tomorrow!\": 100, \"until\": 100, \"thank\": 730, \"great.\": 322, \"asking.\": 148, \"good.\": 288, \"asking!\": 288, \"very\": 288, \"pleasure.\": 97, \"greet\": 290, \"anyway.\": 290, \"me,\": 290, \"hello!\": 578, \"you!\": 286, \"equally!\": 103, \"little\": 146, \"news.\": 146, \"to,\": 275, \"can't.\": 275, \"sending\": 71, \"hug.\": 433, \"virtual\": 433, \"much,\": 116, \"talking\": 116, \"charm.\": 69, \"same\": 191, \"thing.\": 191, \"sweetheart.\": 102, \"are\": 102, \"too.\": 67, \"seen\": 104, \"admit\": 104, \"coming...\": 104, \"know,\": 291, \"has\": 291, \"eternal.\": 291, \"made\": 291, \"wow,\": 61, \"sorry.\": 61, \"later!\": 197, \"chore.\": 275, \"glad!\": 288, \"something.\": 104, \"time\": 104, \"snack\": 104, \"ok.\": 289, \"know.\": 284, \"send\": 362, \"big\": 148, \"super\": 214, \"telephone\": 240, \"call\": 240, \"available\": 240, \"hope\": 240, \"around\": 240, \"clock.\": 240, \"or\": 240, \"nap.\": 290}", "index_docs": "{\"1\": 38098, \"4\": 4797, \"18\": 1751, \"289\": 276, \"123\": 337, \"93\": 552, \"288\": 276, \"287\": 276, \"2\": 38098, \"35\": 1098, \"286\": 276, \"386\": 208, \"55\": 751, \"7\": 3790, \"387\": 208, \"385\": 208, \"34\": 1106, \"139\": 291, \"57\": 725, \"74\": 582, \"138\": 291, \"342\": 259, \"14\": 2024, \"24\": 1271, \"340\": 259, \"8\": 3609, \"31\": 1270, \"341\": 259, \"280\": 283, \"96\": 523, \"281\": 283, \"86\": 573, \"279\": 283, \"325\": 267, \"90\": 558, \"67\": 667, \"326\": 267, \"38\": 979, \"141\": 291, \"140\": 291, \"30\": 1300, \"249\": 288, \"248\": 288, \"246\": 288, \"250\": 288, \"247\": 288, \"16\": 1866, \"463\": 132, \"44\": 945, \"144\": 291, \"142\": 291, \"143\": 291, \"382\": 210, \"380\": 210, \"381\": 210, \"311\": 269, \"43\": 947, \"89\": 559, \"5\": 4585, \"309\": 269, \"25\": 1532, \"95\": 533, \"92\": 557, \"310\": 269, \"312\": 269, \"308\": 269, \"265\": 286, \"266\": 286, \"267\": 286, \"445\": 148, \"444\": 148, \"446\": 148, \"11\": 2328, \"145\": 291, \"77\": 581, \"273\": 284, \"271\": 284, \"272\": 284, \"83\": 574, \"321\": 268, \"9\": 3124, \"58\": 725, \"322\": 268, \"36\": 1090, \"147\": 291, \"146\": 291, \"148\": 291, \"215\": 290, \"214\": 290, \"211\": 290, \"213\": 290, \"63\": 683, \"212\": 290, \"216\": 290, \"61\": 693, \"150\": 291, \"149\": 291, \"152\": 291, \"153\": 291, \"41\": 953, \"151\": 291, \"154\": 291, \"155\": 291, \"121\": 360, \"330\": 264, \"334\": 264, \"333\": 264, \"329\": 264, \"332\": 264, \"331\": 264, \"399\": 189, \"398\": 189, \"217\": 290, \"440\": 150, \"439\": 150, \"441\": 150, \"111\": 400, \"410\": 167, \"412\": 167, \"416\": 167, \"418\": 167, \"411\": 167, \"414\": 167, \"417\": 167, \"409\": 167, \"415\": 167, \"413\": 167, \"70\": 594, \"129\": 297, \"130\": 297, \"73\": 584, \"133\": 292, \"135\": 292, \"134\": 292, \"157\": 291, \"156\": 291, \"158\": 291, \"75\": 582, \"222\": 290, \"78\": 581, \"219\": 290, \"221\": 290, \"220\": 290, \"218\": 290, \"223\": 290, \"160\": 291, \"161\": 291, \"159\": 291, \"76\": 582, \"169\": 291, \"165\": 291, \"163\": 291, \"166\": 291, \"167\": 291, \"168\": 291, \"170\": 291, \"171\": 291, \"162\": 291, \"164\": 291, \"460\": 145, \"459\": 145, \"112\": 393, \"113\": 393, \"22\": 786, \"114\": 393, \"23\": 786, \"115\": 393, \"509\": 61, \"510\": 61, \"512\": 61, \"511\": 61, \"301\": 272, \"300\": 272, \"302\": 272, \"303\": 272, \"346\": 252, \"348\": 252, \"347\": 252, \"88\": 572, \"285\": 282, \"470\": 113, \"471\": 113, \"37\": 996, \"406\": 170, \"404\": 170, \"405\": 170, \"429\": 161, \"124\": 335, \"94\": 547, \"437\": 154, \"430\": 161, \"432\": 161, \"431\": 161, \"506\": 63, \"375\": 217, \"374\": 217, \"435\": 155, \"519\": 59, \"520\": 59, \"503\": 66, \"428\": 166, \"504\": 66, \"131\": 297, \"448\": 148, \"447\": 148, \"252\": 288, \"253\": 288, \"251\": 288, \"493\": 97, \"225\": 290, \"81\": 578, \"226\": 290, \"224\": 290, \"485\": 103, \"486\": 103, \"455\": 146, \"456\": 146, \"294\": 275, \"372\": 236, \"370\": 236, \"371\": 236, \"100\": 471, \"403\": 183, \"105\": 433, \"106\": 433, \"373\": 219, \"465\": 116, \"466\": 116, \"467\": 116, \"464\": 116, \"497\": 69, \"496\": 69, \"393\": 191, \"394\": 191, \"395\": 191, \"290\": 276, \"488\": 102, \"500\": 67, \"501\": 67, \"499\": 67, \"474\": 104, \"473\": 104, \"475\": 104, \"172\": 291, \"173\": 291, \"174\": 291, \"175\": 291, \"514\": 61, \"513\": 61, \"391\": 197, \"296\": 275, \"295\": 275, \"254\": 288, \"478\": 104, \"476\": 104, \"477\": 104, \"244\": 289, \"274\": 284, \"275\": 284, \"449\": 148, \"176\": 291, \"177\": 291, \"378\": 214, \"377\": 214, \"98\": 480, \"357\": 240, \"360\": 240, \"361\": 240, \"356\": 240, \"359\": 240, \"362\": 240, \"358\": 240, \"99\": 480, \"40\": 480, \"355\": 240, \"354\": 240, \"353\": 244, \"352\": 244, \"229\": 290, \"228\": 290, \"227\": 290, \"10\": 2629, \"28\": 1392, \"291\": 276, \"15\": 1877, \"17\": 1820, \"292\": 276, \"293\": 276, \"53\": 790, \"389\": 208, \"388\": 208, \"13\": 1845, \"3\": 7517, \"179\": 291, \"46\": 894, \"178\": 291, \"343\": 259, \"345\": 259, \"21\": 1585, \"19\": 1726, \"49\": 864, \"344\": 259, \"284\": 283, \"29\": 1327, \"282\": 283, \"283\": 283, \"68\": 667, \"327\": 267, \"32\": 1235, \"91\": 558, \"12\": 2375, \"328\": 267, \"181\": 291, \"71\": 588, \"180\": 291, \"259\": 288, \"260\": 288, \"256\": 288, \"258\": 288, \"255\": 288, \"257\": 288, \"45\": 926, \"48\": 869, \"182\": 291, \"122\": 360, \"384\": 210, \"383\": 210, \"314\": 269, \"313\": 269, \"319\": 269, \"315\": 269, \"318\": 269, \"119\": 373, \"316\": 269, \"317\": 269, \"320\": 269, \"26\": 1532, \"27\": 1529, \"268\": 286, \"269\": 286, \"103\": 439, \"450\": 148, \"451\": 148, \"97\": 483, \"452\": 148, \"183\": 291, \"47\": 873, \"62\": 684, \"277\": 284, \"85\": 574, \"84\": 574, \"20\": 1390, \"276\": 284, \"323\": 268, \"324\": 268, \"51\": 833, \"59\": 725, \"72\": 588, \"6\": 3838, \"109\": 407, \"184\": 291, \"185\": 291, \"230\": 290, \"64\": 683, \"232\": 290, \"33\": 1228, \"233\": 290, \"231\": 290, \"234\": 290, \"186\": 291, \"187\": 291, \"189\": 291, \"87\": 573, \"42\": 949, \"188\": 291, \"190\": 291, \"69\": 624, \"191\": 291, \"335\": 264, \"336\": 264, \"126\": 325, \"338\": 264, \"339\": 264, \"337\": 264, \"52\": 536, \"402\": 189, \"401\": 189, \"400\": 189, \"235\": 290, \"443\": 150, \"442\": 150, \"65\": 682, \"424\": 167, \"425\": 167, \"421\": 167, \"423\": 167, \"427\": 167, \"419\": 167, \"420\": 167, \"426\": 167, \"422\": 167, \"125\": 167, \"132\": 297, \"137\": 292, \"136\": 292, \"192\": 291, \"193\": 291, \"194\": 291, \"80\": 290, \"236\": 290, \"54\": 753, \"237\": 290, \"238\": 290, \"239\": 290, \"50\": 856, \"79\": 581, \"198\": 291, \"196\": 291, \"197\": 291, \"195\": 291, \"199\": 291, \"201\": 291, \"205\": 291, \"204\": 291, \"39\": 969, \"203\": 291, \"200\": 291, \"206\": 291, \"202\": 291, \"104\": 435, \"390\": 206, \"461\": 145, \"462\": 145, \"117\": 393, \"116\": 393, \"118\": 393, \"516\": 61, \"515\": 61, \"110\": 405, \"128\": 301, \"304\": 272, \"305\": 272, \"306\": 272, \"351\": 252, \"349\": 252, \"350\": 252, \"472\": 113, \"66\": 674, \"407\": 170, \"408\": 170, \"433\": 161, \"307\": 272, \"438\": 154, \"102\": 451, \"434\": 161, \"101\": 451, \"508\": 63, \"507\": 63, \"376\": 217, \"436\": 155, \"521\": 59, \"60\": 699, \"505\": 66, \"492\": 100, \"491\": 100, \"56\": 730, \"127\": 322, \"453\": 148, \"262\": 288, \"263\": 288, \"261\": 288, \"494\": 97, \"241\": 290, \"242\": 290, \"240\": 290, \"82\": 578, \"270\": 286, \"487\": 103, \"457\": 146, \"458\": 146, \"297\": 275, \"298\": 275, \"495\": 71, \"108\": 433, \"107\": 433, \"468\": 116, \"469\": 116, \"498\": 69, \"396\": 191, \"397\": 191, \"490\": 102, \"489\": 102, \"502\": 67, \"480\": 104, \"479\": 104, \"481\": 104, \"207\": 291, \"208\": 291, \"210\": 291, \"209\": 291, \"517\": 61, \"518\": 61, \"392\": 197, \"299\": 275, \"264\": 288, \"484\": 104, \"482\": 104, \"483\": 104, \"245\": 289, \"278\": 284, \"120\": 362, \"454\": 148, \"379\": 214, \"364\": 240, \"368\": 240, \"365\": 240, \"363\": 240, \"366\": 240, \"367\": 240, \"369\": 240, \"243\": 290}", "index_word": "{\"1\": \"<start>\", \"2\": \"<end>\", \"3\": \"i\", \"4\": \"no\", \"5\": \"a\", \"6\": \"you\", \"7\": \"me\", \"8\": \"que\", \"9\": \"te\", \"10\": \"i'm\", \"11\": \"lo\", \"12\": \"to\", \"13\": \"the\", \"14\": \"es\", \"15\": \"don't\", \"16\": \"un\", \"17\": \"have\", \"18\": \"tengo\", \"19\": \"that\", \"20\": \"love\", \"21\": \"is\", \"22\": \"na,\", \"23\": \"nana,\", \"24\": \"de\", \"25\": \"pero\", \"26\": \"but\", \"27\": \"like\", \"28\": \"not\", \"29\": \"my\", \"30\": \"una\", \"31\": \"la\", \"32\": \"you.\", \"33\": \"it\", \"34\": \"el\", \"35\": \"en\", \"36\": \"por\", \"37\": \"genial.\", \"38\": \"estoy\", \"39\": \"it's\", \"40\": \"717\", \"41\": \"gusta\", \"42\": \"see\", \"43\": \"he\", \"44\": \"soy\", \"45\": \"am\", \"46\": \"for\", \"47\": \"it.\", \"48\": \"so\", \"49\": \"on\", \"50\": \"what\", \"51\": \"would\", \"52\": \"we\", \"53\": \"at\", \"54\": \"say\", \"55\": \"se\", \"56\": \"thank\", \"57\": \"para\", \"58\": \"si\", \"59\": \"if\", \"60\": \"good\", \"61\": \"mi\", \"62\": \"all\", \"63\": \"esto\", \"64\": \"this\", \"65\": \"am.\", \"66\": \"brilliant.\", \"67\": \"aqu\\u00ed\", \"68\": \"here\", \"69\": \"your\", \"70\": \"bot\", \"71\": \"created\", \"72\": \"by\", \"73\": \"digital,\", \"74\": \"hardware\", \"75\": \"oh,\", \"76\": \"zumba.\", \"77\": \"nada\", \"78\": \"\\u00bfqu\\u00e9\", \"79\": \"does\", \"80\": \"bed\", \"81\": \"\\u00a1hola!\", \"82\": \"hello!\", \"83\": \"o\\u00eddo\", \"84\": \"i've\", \"85\": \"heard\", \"86\": \"mis\", \"87\": \"way\", \"88\": \"como\", \"89\": \"otro\", \"90\": \"y\", \"91\": \"and\", \"92\": \"bien.\", \"93\": \"bots\", \"94\": \"puedo.\", \"95\": \"nos\", \"96\": \"est\\u00e1\", \"97\": \"think\", \"98\": \"003\", \"99\": \"https://www.telefonodelaesperanza.org/prevencion-del-suicidio.\", \"100\": \"\\u00a1me\", \"101\": \"there's\", \"102\": \"nothing\", \"103\": \"about\", \"104\": \"i'll\", \"105\": \"abrazo\", \"106\": \"virtual.\", \"107\": \"virtual\", \"108\": \"hug.\", \"109\": \"know\", \"110\": \"you're\", \"111\": \"estoy.\", \"112\": \"nanan\\u00e1.\", \"113\": \"todo\", \"114\": \"puedo\", \"115\": \"dar.\", \"116\": \"nanana.\", \"117\": \"can\", \"118\": \"give\", \"119\": \"haven't\", \"120\": \"send\", \"121\": \"tu\", \"122\": \"only\", \"123\": \"los\", \"124\": \"creo\", \"125\": \"something\", \"126\": \"make\", \"127\": \"great.\", \"128\": \"go\", \"129\": \"creado\", \"130\": \"humanos.\", \"131\": \"\\u00a1hasta\", \"132\": \"humans.\", \"133\": \"as\\u00ed\", \"134\": \"simplemente\", \"135\": \"aqu\\u00ed.\", \"136\": \"just\", \"137\": \"here.\", \"138\": \"necesario\", \"139\": \"eso.\", \"140\": \"crearon\", \"141\": \"personas.\", \"142\": \"\\u00a1soy\", \"143\": \"tan\", \"144\": \"feliz!\", \"145\": \"claro.\", \"146\": \"ganas\", \"147\": \"goleada...\", \"148\": \"sabes.\", \"149\": \"tecnolog\\u00eda\", \"150\": \"mundo.\", \"151\": \"veo,\", \"152\": \"c\\u00f3mo\", \"153\": \"eres.\", \"154\": \"escucha\", \"155\": \"coraz\\u00f3n.\", \"156\": \"b\\u00e1sicamente\", \"157\": \"esto.\", \"158\": \"vaya.\", \"159\": \"hace\", \"160\": \"abeja\", \"161\": \"gimnasio?\", \"162\": \"dif\\u00edcil\", \"163\": \"tener\", \"164\": \"gracia\", \"165\": \"bajo\", \"166\": \"demanda,\", \"167\": \"quiz\\u00e1\", \"168\": \"sorprenda\", \"169\": \"momento\", \"170\": \"menos\", \"171\": \"pensado.\", \"172\": \"s\\u00e9,\", \"173\": \"ha\", \"174\": \"hecho\", \"175\": \"eterno.\", \"176\": \"encanta\", \"177\": \"encante.\", \"178\": \"necessary\", \"179\": \"that.\", \"180\": \"people\", \"181\": \"me.\", \"182\": \"happy!\", \"183\": \"clear\", \"184\": \"beat\", \"185\": \"rout...\", \"186\": \"technology\", \"187\": \"world.\", \"188\": \"you,\", \"189\": \"are.\", \"190\": \"listen\", \"191\": \"heart.\", \"192\": \"basically\", \"193\": \"this.\", \"194\": \"wow.\", \"195\": \"bee\", \"196\": \"do\", \"197\": \"in\", \"198\": \"gym?\", \"199\": \"hard\", \"200\": \"grace\", \"201\": \"demand,\", \"202\": \"might\", \"203\": \"surprise\", \"204\": \"least\", \"205\": \"thought\", \"206\": \"of.\", \"207\": \"know,\", \"208\": \"has\", \"209\": \"made\", \"210\": \"eternal.\", \"211\": \"fuera\", \"212\": \"concurso\", \"213\": \"(que\", \"214\": \"es),\", \"215\": \"ganar\\u00edas\", \"216\": \"t\\u00fa.\", \"217\": \"momentos.\", \"218\": \"le\", \"219\": \"dice\", \"220\": \"chinche\", \"221\": \"chinche?\", \"222\": \"quiero\", \"223\": \"chincheramente.\", \"224\": \"yo,\", \"225\": \"saludar\\u00e9\", \"226\": \"igualmente.\", \"227\": \"hay\", \"228\": \"buena\", \"229\": \"siesta.\", \"230\": \"were\", \"231\": \"contest\", \"232\": \"(which\", \"233\": \"isn't),\", \"234\": \"win.\", \"235\": \"moments.\", \"236\": \"bug\", \"237\": \"another\", \"238\": \"bug?\", \"239\": \"sincerely.\", \"240\": \"me,\", \"241\": \"greet\", \"242\": \"anyway.\", \"243\": \"nap.\", \"244\": \"vale.\", \"245\": \"ok.\", \"246\": \"vengo\", \"247\": \"larga\", \"248\": \"saga\", \"249\": \"c\\u00f3digo.\", \"250\": \"familia.\", \"251\": \"muy\", \"252\": \"\\u00a1gracias\", \"253\": \"preguntar!\", \"254\": \"alegro!\", \"255\": \"coming\", \"256\": \"from\", \"257\": \"long\", \"258\": \"code\", \"259\": \"saga.\", \"260\": \"family.\", \"261\": \"very\", \"262\": \"good.\", \"263\": \"asking!\", \"264\": \"glad!\", \"265\": \"gustan\", \"266\": \"tantas\", \"267\": \"cosas...\", \"268\": \"many\", \"269\": \"things...\", \"270\": \"you!\", \"271\": \"amor\", \"272\": \"mueve\", \"273\": \"monta\\u00f1as.\", \"274\": \"bueno\", \"275\": \"saberlo.\", \"276\": \"moves\", \"277\": \"mountains.\", \"278\": \"know.\", \"279\": \"eso\", \"280\": \"entre\", \"281\": \"talentos.\", \"282\": \"that's\", \"283\": \"among\", \"284\": \"talents.\", \"285\": \"soy.\", \"286\": \"realidad,\", \"287\": \"edad.\", \"288\": \"cumplimos\", \"289\": \"a\\u00f1os.\", \"290\": \"eres\", \"291\": \"actually,\", \"292\": \"old.\", \"293\": \"birthday.\", \"294\": \"encantar\\u00eda,\", \"295\": \"menuda\", \"296\": \"faena.\", \"297\": \"to,\", \"298\": \"can't.\", \"299\": \"chore.\", \"300\": \"podr\\u00edamos\", \"301\": \"decir\", \"302\": \"\\\"en\", \"303\": \"construcci\\u00f3n\\\".\", \"304\": \"could\", \"305\": \"\\u201cunder\", \"306\": \"construction\\u201d.\", \"307\": \"can.\", \"308\": \"conocido\", \"309\": \"ning\\u00fan\", \"310\": \"bot,\", \"311\": \"seguro\", \"312\": \"llevar\\u00edamos\", \"313\": \"met\", \"314\": \"any\", \"315\": \"other\", \"316\": \"bots,\", \"317\": \"sure\", \"318\": \"we'd\", \"319\": \"get\", \"320\": \"along.\", \"321\": \"supiera,\", \"322\": \"dir\\u00eda.\", \"323\": \"knew,\", \"324\": \"tell\", \"325\": \"charlar\", \"326\": \"ayudarte.\", \"327\": \"chat\", \"328\": \"help\", \"329\": \"compartimos\", \"330\": \"cosa:\", \"331\": \"hacerte\", \"332\": \"vida\", \"333\": \"m\\u00e1s\", \"334\": \"f\\u00e1cil.\", \"335\": \"share\", \"336\": \"one\", \"337\": \"thing:\", \"338\": \"life\", \"339\": \"easier.\", \"340\": \"verdad\", \"341\": \"dependo\", \"342\": \"nadie.\", \"343\": \"truth\", \"344\": \"depend\", \"345\": \"anyone.\", \"346\": \"ve\", \"347\": \"hoy\", \"348\": \"d\\u00eda.\", \"349\": \"seems\", \"350\": \"today\", \"351\": \"day.\", \"352\": \"ya\", \"353\": \"veo\", \"354\": \"tel\\u00e9fono\", \"355\": \"esperanza\", \"356\": \"disponible\", \"357\": \"cualquier\", \"358\": \"hora.\", \"359\": \"llama\", \"360\": \"al\", \"361\": \"o\", \"362\": \"entra\", \"363\": \"hope\", \"364\": \"telephone\", \"365\": \"available\", \"366\": \"around\", \"367\": \"clock.\", \"368\": \"call\", \"369\": \"or\", \"370\": \"best\", \"371\": \"friends\", \"372\": \"forever!\", \"373\": \"mando\", \"374\": \"hasta\", \"375\": \"luego.\", \"376\": \"later.\", \"377\": \"env\\u00edo\", \"378\": \"s\\u00faper\", \"379\": \"super\", \"380\": \"solo\", \"381\": \"alimento\", \"382\": \"conocimiento.\", \"383\": \"feed\", \"384\": \"knowledge.\", \"385\": \"da\", \"386\": \"mejor\", \"387\": \"responder.\", \"388\": \"better\", \"389\": \"answering.\", \"390\": \"up.\", \"391\": \"luego!\", \"392\": \"later!\", \"393\": \"gracias.\", \"394\": \"mismo\", \"395\": \"digo.\", \"396\": \"same\", \"397\": \"thing.\", \"398\": \"claro\", \"399\": \"no.\", \"400\": \"of\", \"401\": \"course\", \"402\": \"not.\", \"403\": \"encantas!\", \"404\": \"alegro\", \"405\": \"haga\", \"406\": \"gracia.\", \"407\": \"glad\", \"408\": \"amused.\", \"409\": \"respuesta\", \"410\": \"cada\", \"411\": \"pregunta.\", \"412\": \"quieres\", \"413\": \"escuchar\", \"414\": \"algo\", \"415\": \"distinto,\", \"416\": \"pregunta\", \"417\": \"otra\", \"418\": \"cosa.\", \"419\": \"an\", \"420\": \"answer\", \"421\": \"every\", \"422\": \"question.\", \"423\": \"want\", \"424\": \"hear\", \"425\": \"different,\", \"426\": \"ask\", \"427\": \"else.\", \"428\": \"ma\\u00f1ana!\", \"429\": \"preocupes.\", \"430\": \"\\u00a1no\", \"431\": \"pasa\", \"432\": \"nada!\", \"433\": \"worry.\", \"434\": \"wrong!\", \"435\": \"\\u00a1hey!\", \"436\": \"hey!\", \"437\": \"\\u00a1genial!\", \"438\": \"great!\", \"439\": \"\\u00fanico\", \"440\": \"compromiso\", \"441\": \"amistad.\", \"442\": \"commitment\", \"443\": \"friendship.\", \"444\": \"ahora\", \"445\": \"pienso...\", \"446\": \"nombre.\", \"447\": \"gracias\", \"448\": \"preguntar.\", \"449\": \"gran\", \"450\": \"now\", \"451\": \"it...\", \"452\": \"name.\", \"453\": \"asking.\", \"454\": \"big\", \"455\": \"poca\", \"456\": \"novedad.\", \"457\": \"little\", \"458\": \"news.\", \"459\": \"vale,\", \"460\": \"callo.\", \"461\": \"okay,\", \"462\": \"shut\", \"463\": \"bot.\", \"464\": \"conozco\", \"465\": \"tanto,\", \"466\": \"hablar\", \"467\": \"contigo.\", \"468\": \"much,\", \"469\": \"talking\", \"470\": \"\\u00a1lo\", \"471\": \"siento!\", \"472\": \"sorry!\", \"473\": \"reconozco\", \"474\": \"visto\", \"475\": \"venir...\", \"476\": \"hora\", \"477\": \"picar\", \"478\": \"algo.\", \"479\": \"admit\", \"480\": \"seen\", \"481\": \"coming...\", \"482\": \"time\", \"483\": \"snack\", \"484\": \"something.\", \"485\": \"\\u00a1gracias!\", \"486\": \"\\u00a1igualmente!\", \"487\": \"equally!\", \"488\": \"amor.\", \"489\": \"are\", \"490\": \"sweetheart.\", \"491\": \"until\", \"492\": \"tomorrow!\", \"493\": \"placer.\", \"494\": \"pleasure.\", \"495\": \"sending\", \"496\": \"tienes\", \"497\": \"encanto.\", \"498\": \"charm.\", \"499\": \"yo\", \"500\": \"tambi\\u00e9n\", \"501\": \"quiero.\", \"502\": \"too.\", \"503\": \"\\u00a1buenos\", \"504\": \"d\\u00edas\", \"505\": \"morning!\", \"506\": \"sigo...\", \"507\": \"follow\", \"508\": \"you...\", \"509\": \"vas\", \"510\": \"hacer\", \"511\": \"suban\", \"512\": \"colores.\", \"513\": \"vaya,\", \"514\": \"siento.\", \"515\": \"going\", \"516\": \"colors\", \"517\": \"wow,\", \"518\": \"sorry.\", \"519\": \"\\u00a1buenas\", \"520\": \"tardes!\", \"521\": \"afternoon!\"}", "word_index": "{\"<start>\": 1, \"<end>\": 2, \"i\": 3, \"no\": 4, \"a\": 5, \"you\": 6, \"me\": 7, \"que\": 8, \"te\": 9, \"i'm\": 10, \"lo\": 11, \"to\": 12, \"the\": 13, \"es\": 14, \"don't\": 15, \"un\": 16, \"have\": 17, \"tengo\": 18, \"that\": 19, \"love\": 20, \"is\": 21, \"na,\": 22, \"nana,\": 23, \"de\": 24, \"pero\": 25, \"but\": 26, \"like\": 27, \"not\": 28, \"my\": 29, \"una\": 30, \"la\": 31, \"you.\": 32, \"it\": 33, \"el\": 34, \"en\": 35, \"por\": 36, \"genial.\": 37, \"estoy\": 38, \"it's\": 39, \"717\": 40, \"gusta\": 41, \"see\": 42, \"he\": 43, \"soy\": 44, \"am\": 45, \"for\": 46, \"it.\": 47, \"so\": 48, \"on\": 49, \"what\": 50, \"would\": 51, \"we\": 52, \"at\": 53, \"say\": 54, \"se\": 55, \"thank\": 56, \"para\": 57, \"si\": 58, \"if\": 59, \"good\": 60, \"mi\": 61, \"all\": 62, \"esto\": 63, \"this\": 64, \"am.\": 65, \"brilliant.\": 66, \"aqu\\u00ed\": 67, \"here\": 68, \"your\": 69, \"bot\": 70, \"created\": 71, \"by\": 72, \"digital,\": 73, \"hardware\": 74, \"oh,\": 75, \"zumba.\": 76, \"nada\": 77, \"\\u00bfqu\\u00e9\": 78, \"does\": 79, \"bed\": 80, \"\\u00a1hola!\": 81, \"hello!\": 82, \"o\\u00eddo\": 83, \"i've\": 84, \"heard\": 85, \"mis\": 86, \"way\": 87, \"como\": 88, \"otro\": 89, \"y\": 90, \"and\": 91, \"bien.\": 92, \"bots\": 93, \"puedo.\": 94, \"nos\": 95, \"est\\u00e1\": 96, \"think\": 97, \"003\": 98, \"https://www.telefonodelaesperanza.org/prevencion-del-suicidio.\": 99, \"\\u00a1me\": 100, \"there's\": 101, \"nothing\": 102, \"about\": 103, \"i'll\": 104, \"abrazo\": 105, \"virtual.\": 106, \"virtual\": 107, \"hug.\": 108, \"know\": 109, \"you're\": 110, \"estoy.\": 111, \"nanan\\u00e1.\": 112, \"todo\": 113, \"puedo\": 114, \"dar.\": 115, \"nanana.\": 116, \"can\": 117, \"give\": 118, \"haven't\": 119, \"send\": 120, \"tu\": 121, \"only\": 122, \"los\": 123, \"creo\": 124, \"something\": 125, \"make\": 126, \"great.\": 127, \"go\": 128, \"creado\": 129, \"humanos.\": 130, \"\\u00a1hasta\": 131, \"humans.\": 132, \"as\\u00ed\": 133, \"simplemente\": 134, \"aqu\\u00ed.\": 135, \"just\": 136, \"here.\": 137, \"necesario\": 138, \"eso.\": 139, \"crearon\": 140, \"personas.\": 141, \"\\u00a1soy\": 142, \"tan\": 143, \"feliz!\": 144, \"claro.\": 145, \"ganas\": 146, \"goleada...\": 147, \"sabes.\": 148, \"tecnolog\\u00eda\": 149, \"mundo.\": 150, \"veo,\": 151, \"c\\u00f3mo\": 152, \"eres.\": 153, \"escucha\": 154, \"coraz\\u00f3n.\": 155, \"b\\u00e1sicamente\": 156, \"esto.\": 157, \"vaya.\": 158, \"hace\": 159, \"abeja\": 160, \"gimnasio?\": 161, \"dif\\u00edcil\": 162, \"tener\": 163, \"gracia\": 164, \"bajo\": 165, \"demanda,\": 166, \"quiz\\u00e1\": 167, \"sorprenda\": 168, \"momento\": 169, \"menos\": 170, \"pensado.\": 171, \"s\\u00e9,\": 172, \"ha\": 173, \"hecho\": 174, \"eterno.\": 175, \"encanta\": 176, \"encante.\": 177, \"necessary\": 178, \"that.\": 179, \"people\": 180, \"me.\": 181, \"happy!\": 182, \"clear\": 183, \"beat\": 184, \"rout...\": 185, \"technology\": 186, \"world.\": 187, \"you,\": 188, \"are.\": 189, \"listen\": 190, \"heart.\": 191, \"basically\": 192, \"this.\": 193, \"wow.\": 194, \"bee\": 195, \"do\": 196, \"in\": 197, \"gym?\": 198, \"hard\": 199, \"grace\": 200, \"demand,\": 201, \"might\": 202, \"surprise\": 203, \"least\": 204, \"thought\": 205, \"of.\": 206, \"know,\": 207, \"has\": 208, \"made\": 209, \"eternal.\": 210, \"fuera\": 211, \"concurso\": 212, \"(que\": 213, \"es),\": 214, \"ganar\\u00edas\": 215, \"t\\u00fa.\": 216, \"momentos.\": 217, \"le\": 218, \"dice\": 219, \"chinche\": 220, \"chinche?\": 221, \"quiero\": 222, \"chincheramente.\": 223, \"yo,\": 224, \"saludar\\u00e9\": 225, \"igualmente.\": 226, \"hay\": 227, \"buena\": 228, \"siesta.\": 229, \"were\": 230, \"contest\": 231, \"(which\": 232, \"isn't),\": 233, \"win.\": 234, \"moments.\": 235, \"bug\": 236, \"another\": 237, \"bug?\": 238, \"sincerely.\": 239, \"me,\": 240, \"greet\": 241, \"anyway.\": 242, \"nap.\": 243, \"vale.\": 244, \"ok.\": 245, \"vengo\": 246, \"larga\": 247, \"saga\": 248, \"c\\u00f3digo.\": 249, \"familia.\": 250, \"muy\": 251, \"\\u00a1gracias\": 252, \"preguntar!\": 253, \"alegro!\": 254, \"coming\": 255, \"from\": 256, \"long\": 257, \"code\": 258, \"saga.\": 259, \"family.\": 260, \"very\": 261, \"good.\": 262, \"asking!\": 263, \"glad!\": 264, \"gustan\": 265, \"tantas\": 266, \"cosas...\": 267, \"many\": 268, \"things...\": 269, \"you!\": 270, \"amor\": 271, \"mueve\": 272, \"monta\\u00f1as.\": 273, \"bueno\": 274, \"saberlo.\": 275, \"moves\": 276, \"mountains.\": 277, \"know.\": 278, \"eso\": 279, \"entre\": 280, \"talentos.\": 281, \"that's\": 282, \"among\": 283, \"talents.\": 284, \"soy.\": 285, \"realidad,\": 286, \"edad.\": 287, \"cumplimos\": 288, \"a\\u00f1os.\": 289, \"eres\": 290, \"actually,\": 291, \"old.\": 292, \"birthday.\": 293, \"encantar\\u00eda,\": 294, \"menuda\": 295, \"faena.\": 296, \"to,\": 297, \"can't.\": 298, \"chore.\": 299, \"podr\\u00edamos\": 300, \"decir\": 301, \"\\\"en\": 302, \"construcci\\u00f3n\\\".\": 303, \"could\": 304, \"\\u201cunder\": 305, \"construction\\u201d.\": 306, \"can.\": 307, \"conocido\": 308, \"ning\\u00fan\": 309, \"bot,\": 310, \"seguro\": 311, \"llevar\\u00edamos\": 312, \"met\": 313, \"any\": 314, \"other\": 315, \"bots,\": 316, \"sure\": 317, \"we'd\": 318, \"get\": 319, \"along.\": 320, \"supiera,\": 321, \"dir\\u00eda.\": 322, \"knew,\": 323, \"tell\": 324, \"charlar\": 325, \"ayudarte.\": 326, \"chat\": 327, \"help\": 328, \"compartimos\": 329, \"cosa:\": 330, \"hacerte\": 331, \"vida\": 332, \"m\\u00e1s\": 333, \"f\\u00e1cil.\": 334, \"share\": 335, \"one\": 336, \"thing:\": 337, \"life\": 338, \"easier.\": 339, \"verdad\": 340, \"dependo\": 341, \"nadie.\": 342, \"truth\": 343, \"depend\": 344, \"anyone.\": 345, \"ve\": 346, \"hoy\": 347, \"d\\u00eda.\": 348, \"seems\": 349, \"today\": 350, \"day.\": 351, \"ya\": 352, \"veo\": 353, \"tel\\u00e9fono\": 354, \"esperanza\": 355, \"disponible\": 356, \"cualquier\": 357, \"hora.\": 358, \"llama\": 359, \"al\": 360, \"o\": 361, \"entra\": 362, \"hope\": 363, \"telephone\": 364, \"available\": 365, \"around\": 366, \"clock.\": 367, \"call\": 368, \"or\": 369, \"best\": 370, \"friends\": 371, \"forever!\": 372, \"mando\": 373, \"hasta\": 374, \"luego.\": 375, \"later.\": 376, \"env\\u00edo\": 377, \"s\\u00faper\": 378, \"super\": 379, \"solo\": 380, \"alimento\": 381, \"conocimiento.\": 382, \"feed\": 383, \"knowledge.\": 384, \"da\": 385, \"mejor\": 386, \"responder.\": 387, \"better\": 388, \"answering.\": 389, \"up.\": 390, \"luego!\": 391, \"later!\": 392, \"gracias.\": 393, \"mismo\": 394, \"digo.\": 395, \"same\": 396, \"thing.\": 397, \"claro\": 398, \"no.\": 399, \"of\": 400, \"course\": 401, \"not.\": 402, \"encantas!\": 403, \"alegro\": 404, \"haga\": 405, \"gracia.\": 406, \"glad\": 407, \"amused.\": 408, \"respuesta\": 409, \"cada\": 410, \"pregunta.\": 411, \"quieres\": 412, \"escuchar\": 413, \"algo\": 414, \"distinto,\": 415, \"pregunta\": 416, \"otra\": 417, \"cosa.\": 418, \"an\": 419, \"answer\": 420, \"every\": 421, \"question.\": 422, \"want\": 423, \"hear\": 424, \"different,\": 425, \"ask\": 426, \"else.\": 427, \"ma\\u00f1ana!\": 428, \"preocupes.\": 429, \"\\u00a1no\": 430, \"pasa\": 431, \"nada!\": 432, \"worry.\": 433, \"wrong!\": 434, \"\\u00a1hey!\": 435, \"hey!\": 436, \"\\u00a1genial!\": 437, \"great!\": 438, \"\\u00fanico\": 439, \"compromiso\": 440, \"amistad.\": 441, \"commitment\": 442, \"friendship.\": 443, \"ahora\": 444, \"pienso...\": 445, \"nombre.\": 446, \"gracias\": 447, \"preguntar.\": 448, \"gran\": 449, \"now\": 450, \"it...\": 451, \"name.\": 452, \"asking.\": 453, \"big\": 454, \"poca\": 455, \"novedad.\": 456, \"little\": 457, \"news.\": 458, \"vale,\": 459, \"callo.\": 460, \"okay,\": 461, \"shut\": 462, \"bot.\": 463, \"conozco\": 464, \"tanto,\": 465, \"hablar\": 466, \"contigo.\": 467, \"much,\": 468, \"talking\": 469, \"\\u00a1lo\": 470, \"siento!\": 471, \"sorry!\": 472, \"reconozco\": 473, \"visto\": 474, \"venir...\": 475, \"hora\": 476, \"picar\": 477, \"algo.\": 478, \"admit\": 479, \"seen\": 480, \"coming...\": 481, \"time\": 482, \"snack\": 483, \"something.\": 484, \"\\u00a1gracias!\": 485, \"\\u00a1igualmente!\": 486, \"equally!\": 487, \"amor.\": 488, \"are\": 489, \"sweetheart.\": 490, \"until\": 491, \"tomorrow!\": 492, \"placer.\": 493, \"pleasure.\": 494, \"sending\": 495, \"tienes\": 496, \"encanto.\": 497, \"charm.\": 498, \"yo\": 499, \"tambi\\u00e9n\": 500, \"quiero.\": 501, \"too.\": 502, \"\\u00a1buenos\": 503, \"d\\u00edas\": 504, \"morning!\": 505, \"sigo...\": 506, \"follow\": 507, \"you...\": 508, \"vas\": 509, \"hacer\": 510, \"suban\": 511, \"colores.\": 512, \"vaya,\": 513, \"siento.\": 514, \"going\": 515, \"colors\": 516, \"wow,\": 517, \"sorry.\": 518, \"\\u00a1buenas\": 519, \"tardes!\": 520, \"afternoon!\": 521}"}}