{"class_name": "Tokenizer", "config": {"num_words": null, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": null, "document_count": 39525, "word_counts": "{\"\\u00bferes\": 381, \"mayor\": 17, \"que\": 3857, \"yo\": 246, \"eres\": 1373, \"una\": 888, \"beb\\u00e9\": 7, \"dime\": 1009, \"cu\\u00e1l\": 273, \"es\": 1465, \"tu\": 1055, \"edad\": 9, \"di\": 669, \"si\": 673, \"un\": 1367, \"chiquit\\u00edn\": 5, \"peque\\u00f1a\": 10, \"\\u00bfvas\": 108, \"a\": 3927, \"celebrar\": 7, \"cumple\": 31, \"\\u00bfqu\\u00e9\": 1161, \"regalo\": 14, \"te\": 1700, \"has\": 250, \"pedido\": 10, \"para\": 509, \"cumplea\\u00f1os\": 32, \"vieja\": 10, \"\\u00bfpiensas\": 73, \"invitarme\": 2, \"renacuaja\": 4, \"d\\u00ednos\": 5, \"cu\\u00e1ndo\": 6, \"est\\u00e1s\": 610, \"hecho\": 32, \"viejo\": 10, \"cu\\u00e1ntos\": 21, \"a\\u00f1os\": 10, \"tienes\": 561, \"tus\": 167, \"\\u00bfcelebras\": 2, \"\\u00bfte\": 896, \"gusta\": 192, \"pareces\": 68, \"\\u00bfme\": 125, \"vas\": 76, \"invitar\": 8, \"ni\\u00f1a\": 18, \"\\u00bfcu\\u00e1ndo\": 16, \"m\\u00e1s\": 1258, \"joven\": 11, \"espero\": 4, \"me\": 5980, \"invites\": 5, \"qu\\u00e9\": 1530, \"peque\\u00f1o\": 11, \"menor\": 8, \"\\u00bfnos\": 61, \"cr\\u00eda\": 2, \"cr\\u00edo\": 2, \"vejestorio\": 3, \"ni\\u00f1o\": 20, \"por\": 409, \"quieres\": 189, \"quiero\": 845, \"\\u00bfcu\\u00e1ntos\": 17, \"fiesta\": 14, \"de\": 3291, \"hacer\": 228, \"regale\": 1, \"\\u00bfa\": 27, \"ir\": 147, \"hecha\": 12, \"\\u00bftienes\": 177, \"celebras\": 4, \"naciste\": 5, \"d\\u00eda\": 131, \"\\u00bfen\": 66, \"mes\": 63, \"\\u00bfcu\\u00e1l\": 245, \"dices\": 45, \"cuantos\": 1, \"fue\": 1, \"a\\u00f1o\": 32, \"nacimiento\": 1, \"yogur\\u00edn\": 6, \"chaval\\u00edn\": 1, \"chavalina\": 1, \"chavalillo\": 1, \"chavalilla\": 2, \"soy\": 460, \"t\\u00fa\": 126, \"viejecito\": 1, \"viejecita\": 1, \"digas\": 133, \"en\": 1400, \"peque\\u00f1aja\": 5, \"teenager\": 9, \"adolescente\": 3, \"viejoven\": 4, \"peque\": 7, \"bebito\": 5, \"bebecita\": 4, \"chiquitina\": 5, \"peque\\u00f1ajo\": 5, \"preadolescente\": 3, \"chiquitilla\": 4, \"bebecito\": 4, \"renacuajo\": 5, \"chiquitillo\": 4, \"chico\": 46, \"inv\\u00edtame\": 2, \"bebita\": 4, \"chica\": 46, \"yogurina\": 2, \"muy\": 753, \"hazme\": 7, \"la\": 1362, \"pregunta\": 78, \"mill\\u00f3n\": 8, \"gustar\\u00eda\": 336, \"saber\": 282, \"m\\u00ed\": 276, \"lo\": 596, \"sea\": 76, \"hacerme\": 71, \"alguna\": 110, \"acerca\": 20, \"preg\\u00fantame\": 17, \"cosas\": 62, \"preguntas\": 46, \"\\u00bfpor\": 168, \"no\": 654, \"nada\": 68, \"\\u00bfquieres\": 120, \"preguntarme\": 18, \"algo\": 595, \"el\": 1055, \"\\u00fanico\": 4, \"haciendo\": 28, \"solo\": 39, \"hago\": 9, \"sobre\": 502, \"hace\": 32, \"\\u00fanica\": 3, \"pregunto\": 35, \"cosa\": 28, \"preguntar\": 30, \"\\u00bfpuedo\": 34, \"contarte\": 2, \"puedo\": 83, \"cuente\": 3, \"\\u00bfalguna\": 3, \"\\u00bfhay\": 72, \"quieras\": 20, \"puedes\": 398, \"apetezca\": 3, \"haz\": 44, \"preguntes\": 7, \"s\\u00e9\": 135, \"serio\": 13, \"favor\": 85, \"hagas\": 4, \"\\u00bfno\": 26, \"venga\": 32, \"mi\": 470, \"persona\": 49, \"del\": 239, \"interesa\": 30, \"deseando\": 5, \"cositas\": 1, \"\\u00bfpuedes\": 256, \"tirarte\": 8, \"pedo\": 4, \"p\\u00f3mulos\": 3, \"manos\": 102, \"piel\": 3, \"o\\u00eddos\": 3, \"bostezar\": 4, \"andar\": 4, \"beber\": 4, \"coraz\\u00f3n\": 45, \"respirar\": 4, \"pedos\": 5, \"\\u00bftoses\": 1, \"defecar\": 4, \"tragar\": 4, \"masticar\": 4, \"gatear\": 4, \"caca\": 5, \"saltar\": 11, \"orinar\": 4, \"sudar\": 4, \"hacerte\": 23, \"da\\u00f1o\": 6, \"comer\": 66, \"estornudar\": 4, \"correr\": 13, \"llorar\": 8, \"ba\\u00f1o\": 5, \"\\u00bfvomitas\": 1, \"morder\": 4, \"sonre\\u00edr\": 9, \"so\\u00f1ar\": 10, \"toser\": 4, \"vomitar\": 8, \"eructar\": 4, \"pis\": 5, \"caminar\": 8, \"\\u00bforinas\": 1, \"al\": 177, \"\\u00bfhaces\": 3, \"\\u00bfbostezas\": 1, \"\\u00bfbebes\": 1, \"caminas\": 1, \"\\u00bfsudas\": 1, \"dinos\": 237, \"ojos\": 3, \"pulmones\": 3, \"nariz\": 3, \"orejas\": 4, \"mejillas\": 3, \"tiras\": 3, \"pedetes\": 1, \"\\u00bfeructas\": 1, \"\\u00bfcorres\": 1, \"\\u00bfandas\": 1, \"\\u00bfcaminas\": 1, \"\\u00bfsaltas\": 1, \"\\u00bfmasticas\": 1, \"eructos\": 1, \"\\u00bfgateas\": 1, \"\\u00bfrespiras\": 1, \"\\u00bflloras\": 1, \"\\u00bfr\\u00edes\": 1, \"\\u00bfsue\\u00f1as\": 1, \"\\u00bfduermes\": 1, \"\\u00bfdefecas\": 1, \"dientes\": 8, \"vejiga\": 2, \"sistema\": 7, \"digestivo\": 3, \"nervioso\": 2, \"respiratorio\": 2, \"columna\": 2, \"vertebral\": 3, \"pene\": 2, \"pito\": 2, \"cerebro\": 2, \"\\u00fatero\": 2, \"esqueleto\": 2, \"uretra\": 2, \"vagina\": 4, \"vulva\": 4, \"me\\u00f1iques\": 3, \"mofletes\": 3, \"laringe\": 3, \"faringe\": 3, \"labios\": 3, \"codos\": 4, \"cr\\u00e1neo\": 2, \"pulgares\": 3, \"pecas\": 3, \"tibia\": 3, \"peron\\u00e9\": 3, \"u\\u00f1as\": 3, \"om\\u00f3platos\": 3, \"esc\\u00e1pulas\": 3, \"costillas\": 3, \"rodillas\": 3, \"es\\u00f3fago\": 3, \"huesos\": 7, \"m\\u00fasculos\": 3, \"lengua\": 3, \"est\\u00f3mago\": 14, \"intestino\": 3, \"ri\\u00f1ones\": 3, \"p\\u00e1ncreas\": 3, \"brazos\": 3, \"extremidades\": 3, \"piernas\": 3, \"pies\": 3, \"muslos\": 3, \"dedos\": 3, \"pelo\": 13, \"\\u00bfcomes\": 14, \"alguien\": 283, \"supervise\": 3, \"\\u00bfqui\\u00e9n\": 108, \"manda\": 6, \"necesito\": 174, \"hablar\": 141, \"con\": 358, \"manager\": 97, \"queremos\": 28, \"qui\\u00e9n\": 187, \"jefe\": 32, \"c\\u00f3mo\": 501, \"se\": 350, \"llama\": 128, \"superior\": 81, \"encargado\": 27, \"responsable\": 27, \"\\u00bfrespondes\": 4, \"ante\": 3, \"nadie\": 46, \"ordena\": 3, \"managers\": 19, \"est\\u00e1\": 221, \"encima\": 3, \"t\\u00ed\": 1, \"ti\": 55, \"superiores\": 5, \"mande\": 2, \"encargados\": 5, \"d\\u00e9\": 20, \"ordenes\": 2, \"ordene\": 2, \"nombre\": 63, \"supervisor\": 50, \"jefes\": 5, \"responsables\": 5, \"supervisores\": 5, \"supervisa\": 5, \"qui\\u00e9nes\": 33, \"mandan\": 2, \"aqu\\u00ed\": 122, \"todo\": 33, \"esto\": 72, \"\\u00bfy\": 20, \"\\u00bftu\": 13, \"dicen\": 1, \"da\": 34, \"\\u00f3rdenes\": 5, \"quien\": 7, \"dice\": 2, \"dan\": 2, \"supervisan\": 1, \"\\u00bfalguien\": 3, \"\\u00bfc\\u00f3mo\": 350, \"pres\\u00e9ntame\": 12, \"cu\\u00e9ntame\": 366, \"l\\u00edder\": 11, \"\\u00bfreportas\": 1, \"sigues\": 2, \"\\u00bfsigues\": 1, \"cu\\u00e9ntanos\": 149, \"lidera\": 4, \"\\u00bfante\": 1, \"respondes\": 42, \"ipso\": 14, \"facto\": 14, \"\\u00bfde\": 47, \"dependes\": 1, \"director\": 41, \"ll\\u00e9vame\": 8, \"llevanos\": 1, \"ll\\u00e9vanos\": 7, \"reportas\": 1, \"inmediato\": 11, \"ahora\": 317, \"mismo\": 296, \"inmediatamente\": 66, \"\\u00bfdependes\": 1, \"capaz\": 76, \"leerme\": 16, \"correo\": 16, \"fregar\": 13, \"pasear\": 8, \"darle\": 17, \"perro\": 16, \"buscar\": 12, \"las\": 386, \"llaves\": 16, \"tocar\": 16, \"guitarra\": 4, \"ver\": 102, \"tiempo\": 59, \"\\u00bfsabes\": 263, \"prepararme\": 12, \"comida\": 22, \"compras\": 20, \"pintar\": 8, \"leer\": 12, \"zapping\": 5, \"dar\": 25, \"paseo\": 4, \"vacaciones\": 5, \"luna\": 13, \"viaje\": 13, \"caf\\u00e9\": 21, \"llamada\": 4, \"revisar\": 8, \"email\": 28, \"mail\": 4, \"hoguera\": 4, \"llamadas\": 4, \"cocinar\": 8, \"comprar\": 4, \"lista\": 140, \"compra\": 8, \"mirar\": 15, \"comprobar\": 40, \"temperatura\": 7, \"cambiar\": 18, \"canal\": 4, \"decirme\": 47, \"desayuno\": 14, \"cena\": 16, \"dibujar\": 8, \"colada\": 9, \"convertirte\": 3, \"superh\\u00e9roe\": 3, \"mis\": 66, \"encontrar\": 8, \"cuento\": 4, \"mente\": 5, \"escribir\": 31, \"novela\": 3, \"volar\": 8, \"tender\": 3, \"ropa\": 11, \"los\": 430, \"platos\": 3, \"suelo\": 5, \"tomarme\": 13, \"conducir\": 6, \"libro\": 6, \"poner\": 4, \"lavadora\": 4, \"deberes\": 13, \"bailar\": 10, \"gato\": 15, \"cometa\": 4, \"viol\\u00edn\": 4, \"piano\": 8, \"bater\\u00eda\": 4, \"nadar\": 4, \"jugar\": 11, \"montar\": 3, \"bici\": 3, \"coche\": 20, \"\\u00bfpodr\\u00edas\": 115, \"funcionamiento\": 32, \"exactamente\": 134, \"haces\": 196, \"funcionas\": 112, \"ayudar\": 81, \"papel\": 16, \"trabajas\": 31, \"funci\\u00f3n\": 76, \"labor\": 84, \"cuenta\": 124, \"ayudas\": 22, \"trabajo\": 151, \"expl\\u00edcame\": 85, \"\\u00bfest\\u00e1s\": 382, \"dedicas\": 4, \"ayudarme\": 32, \"podemos\": 37, \"temas\": 29, \"tratar\": 2, \"conversar\": 26, \"discutir\": 5, \"platicar\": 9, \"h\\u00e1blame\": 29, \"charlar\": 35, \"\\u00bfsobre\": 6, \"contar\": 141, \"y\": 61, \"juntos\": 6, \"podr\\u00edamos\": 5, \"contigo\": 107, \"\\u00bfcu\\u00e1les\": 53, \"son\": 179, \"opciones\": 7, \"hay\": 68, \"charlemos\": 1, \"hoy\": 294, \"sugieres\": 1, \"interesantes\": 4, \"podamos\": 2, \"tema\": 11, \"interesante\": 22, \"conversaci\\u00f3n\": 13, \"este\": 480, \"momento\": 191, \"dialogar\": 26, \"charlas\": 1, \"tener\": 69, \"explorar\": 8, \"nuestra\": 25, \"charla\": 4, \"conmigo\": 178, \"propones\": 3, \"\\u00bfpodemos\": 9, \"podr\\u00edas\": 16, \"proponerme\": 1, \"tal\": 272, \"hablamos\": 5, \"tipo\": 53, \"decirnos\": 3, \"cuentas\": 38, \"iniciar\": 2, \"alg\\u00fan\": 94, \"charlamos\": 4, \"poco\": 58, \"idea\": 5, \"hablemos\": 1, \"ayuda\": 6, \"ofrecerme\": 6, \"apoyo\": 2, \"darme\": 54, \"forma\": 43, \"bueno\": 45, \"ser\": 403, \"\\u00fatil\": 7, \"habilidades\": 4, \"ofrecer\": 1, \"explicarme\": 7, \"\\u00bfcon\": 20, \"sabes\": 175, \"maneras\": 1, \"asistirme\": 5, \"aspectos\": 2, \"serme\": 4, \"colaborar\": 1, \"formas\": 1, \"\\u00e1reas\": 14, \"apoyarme\": 7, \"soporte\": 4, \"programaci\\u00f3n\": 311, \"python\": 182, \"b\\u00e1sica\": 11, \"ense\\u00f1arme\": 3, \"tareas\": 7, \"experto\": 1, \"conocimientos\": 7, \"utilidad\": 3, \"conceptos\": 7, \"b\\u00e1sicos\": 8, \"problemas\": 4, \"resolver\": 2, \"guiar\": 1, \"servicios\": 1, \"aprendizaje\": 9, \"espec\\u00edfico\": 3, \"ofreces\": 1, \"asistir\": 1, \"relacionados\": 1, \"cubrir\": 1, \"facilitarme\": 1, \"soluciones\": 1, \"t\\u00e9cnicos\": 3, \"orientarme\": 1, \"herramientas\": 3, \"orientaci\\u00f3n\": 1, \"guiarme\": 1, \"entender\": 2, \"conocimiento\": 21, \"compartir\": 1, \"problema\": 2, \"orientar\": 1, \"relacionadas\": 1, \"aprender\": 40, \"decir\": 42, \"lenguaje\": 54, \"usar\": 17, \"\\u00bfpython\": 7, \"adecuado\": 2, \"novatos\": 1, \"principal\": 3, \"ventaja\": 1, \"parece\": 99, \"sencillo\": 1, \"\\u00bfes\": 31, \"f\\u00e1cil\": 10, \"tantas\": 3, \"personas\": 1, \"usan\": 13, \"sus\": 5, \"caracter\\u00edsticas\": 8, \"usos\": 3, \"tiene\": 61, \"flexible\": 3, \"especial\": 48, \"ideal\": 31, \"principiantes\": 9, \"muchas\": 11, \"aplicaciones\": 10, \"prop\\u00f3sito\": 58, \"tan\": 176, \"usado\": 2, \"opinas\": 327, \"ventajas\": 2, \"utiliza\": 3, \"principales\": 2, \"importante\": 5, \"accesible\": 1, \"todos\": 38, \"destacar\\u00edas\": 1, \"desarrollo\": 7, \"r\\u00e1pido\": 1, \"elegir\": 1, \"adapta\": 1, \"necesidades\": 1, \"potente\": 1, \"sintaxis\": 15, \"amigable\": 1, \"pr\\u00e1cticos\": 1, \"recomiendan\": 1, \"cubre\": 3, \"expertos\": 1, \"eficiente\": 3, \"beneficio\": 1, \"verdad\": 45, \"perfecto\": 10, \"automatizaci\\u00f3n\": 2, \"\\u00bfcu\\u00e1ntas\": 7, \"aprovechan\": 1, \"ciencia\": 3, \"datos\": 11, \"cient\\u00edficos\": 1, \"bibliotecas\": 2, \"\\u00fatiles\": 15, \"mejor\": 263, \"cualidad\": 1, \"mucho\": 154, \"web\": 11, \"popular\": 9, \"inteligencia\": 32, \"artificial\": 119, \"comunidad\": 20, \"prefiere\": 1, \"prototipos\": 1, \"r\\u00e1pidos\": 3, \"empezar\": 30, \"recomendado\": 1, \"activa\": 1, \"compatible\": 1, \"muchos\": 1, \"proyectos\": 5, \"facilita\": 1, \"excelente\": 17, \"educativos\": 1, \"mejores\": 48, \"multiplataforma\": 4, \"usa\": 7, \"empresas\": 33, \"grandes\": 3, \"peque\\u00f1as\": 1, \"scripting\": 2, \"tantos\": 1, \"programadores\": 2, \"prefieren\": 2, \"contarme\": 75, \"otro\": 139, \"uso\": 5, \"otra\": 29, \"otras\": 1, \"utilidades\": 1, \"\\u00bfque\": 3, \"puede\": 21, \"funciones\": 3, \"\\u00bfpara\": 18, \"significa\": 14, \"programar\": 23, \"definir\\u00edas\": 3, \"cuando\": 48, \"programas\": 5, \"explicas\": 3, \"entiendes\": 3, \"implica\": 5, \"trata\": 6, \"computadora\": 31, \"describir\\u00edas\": 3, \"computaci\\u00f3n\": 2, \"concepto\": 1, \"consiste\": 6, \"describe\": 13, \"c\\u00f3digo\": 10, \"dame\": 146, \"definici\\u00f3n\": 5, \"esencia\": 2, \"representa\": 2, \"programamos\": 1, \"instrucciones\": 38, \"explicar\": 32, \"resumir\\u00edas\": 1, \"sirve\": 7, \"rol\": 5, \"inform\\u00e1tica\": 6, \"logra\": 3, \"act\\u00faa\": 2, \"defines\": 4, \"objetivo\": 2, \"nuevo\": 9, \"codificar\": 2, \"programa\": 24, \"desarrollar\": 25, \"software\": 10, \"define\": 22, \"entiende\": 2, \"dise\\u00f1ar\": 1, \"realiza\": 4, \"programador\": 11, \"instruir\": 2, \"m\\u00e1quina\": 11, \"funciona\": 11, \"escritura\": 2, \"debe\": 4, \"n\\u00facleo\": 1, \"comunica\": 1, \"uno\": 2, \"escribiendo\": 1, \"t\\u00e9rminos\": 2, \"escriben\": 7, \"necesita\": 1, \"computadoras\": 8, \"formato\": 2, \"comunico\": 1, \"codifican\": 1, \"pasos\": 2, \"debo\": 54, \"seguir\": 3, \"escribo\": 3, \"traduzco\": 1, \"ideas\": 3, \"instruyo\": 1, \"creo\": 239, \"computacionales\": 3, \"inicio\": 2, \"manera\": 15, \"ense\\u00f1ar\": 20, \"comunicarme\": 1, \"trav\\u00e9s\": 1, \"desarrollan\": 1, \"necesario\": 1, \"especifico\": 1, \"acciones\": 3, \"algoritmos\": 1, \"describo\": 1, \"interactuar\": 1, \"mediante\": 1, \"proceso\": 1, \"sigue\": 1, \"siga\": 1, \"empiezo\": 1, \"formatos\": 1, \"aceptan\": 1, \"establezco\": 1, \"sistemas\": 5, \"usamos\": 1, \"lenguajes\": 208, \"importancia\": 3, \"funcionan\": 4, \"tienen\": 13, \"juega\": 3, \"elementos\": 2, \"componen\": 2, \"existen\": 11, \"reglas\": 14, \"ayudan\": 5, \"estructuran\": 1, \"basa\": 2, \"permite\": 2, \"dise\\u00f1amos\": 1, \"comunican\": 1, \"relaci\\u00f3n\": 11, \"definen\": 1, \"influyen\": 2, \"nos\": 177, \"sirven\": 3, \"l\\u00f3gica\": 2, \"caracteriza\": 1, \"elaboran\": 1, \"importantes\": 2, \"estructura\": 2, \"necesitamos\": 1, \"operan\": 1, \"tratan\": 2, \"entre\": 8, \"consisten\": 1, \"establece\": 2, \"juegan\": 1, \"afectan\": 1, \"determina\": 1, \"construimos\": 1, \"limitaciones\": 1, \"funcionalidad\": 1, \"algunos\": 4, \"nombrar\": 2, \"ejemplos\": 4, \"comunes\": 5, \"populares\": 5, \"usados\": 5, \"listar\": 3, \"conocer\": 4, \"conocidos\": 4, \"aprendidos\": 1, \"est\\u00e1n\": 3, \"disponibles\": 1, \"mencionar\": 2, \"actuales\": 2, \"ense\\u00f1an\": 3, \"trabaja\": 2, \"tipos\": 3, \"\\u00bfconoces\": 19, \"deber\\u00eda\": 78, \"estudiar\": 3, \"recomendables\": 2, \"actualmente\": 1, \"moda\": 1, \"modernos\": 4, \"esenciales\": 2, \"adecuados\": 1, \"vers\\u00e1tiles\": 1, \"indicarme\": 1, \"primero\": 4, \"destacan\": 2, \"2024\": 2, \"demandados\": 1, \"ideales\": 3, \"utilizan\": 4, \"bases\": 6, \"orientados\": 2, \"objetos\": 1, \"funcionales\": 2, \"flexibles\": 1, \"m\\u00f3viles\": 3, \"an\\u00e1lisis\": 2, \"desarrolladores\": 2, \"destacados\": 1, \"nube\": 4, \"est\\u00e1ndar\": 1, \"accesibles\": 2, \"permiten\": 2, \"crear\": 3, \"videojuegos\": 2, \"espec\\u00edficos\": 4, \"backend\": 4, \"trabajar\": 15, \"frontend\": 2, \"abierto\": 1, \"industria\": 1, \"f\\u00e1ciles\": 1, \"operativos\": 3, \"soportan\": 2, \"ia\": 61, \"sitios\": 1, \"big\": 22, \"data\": 10, \"fintech\": 2, \"universidades\": 1, \"\\u00e1gil\": 1, \"\\u00bfexisten\": 7, \"potentes\": 1, \"otros\": 135, \"adem\\u00e1s\": 16, \"java\": 6, \"javascript\": 8, \"aparte\": 1, \"sql\": 4, \"menos\": 174, \"adicionales\": 1, \"pero\": 9, \"alternativos\": 4, \"cl\\u00e1sicos\": 6, \"veteranos\": 1, \"usaron\": 1, \"antes\": 4, \"a\\u00fan\": 4, \"espec\\u00edficas\": 1, \"mencionarme\": 1, \"embebidos\": 1, \"antiguos\": 4, \"relevantes\": 3, \"recientes\": 1, \"prop\\u00f3sitos\": 1, \"recomendar\": 1, \"gr\\u00e1ficos\": 1, \"efectivos\": 2, \"matem\\u00e1ticas\": 1, \"vigentes\": 1, \"diferentes\": 3, \"utilizados\": 1, \"buenos\": 108, \"automatizar\": 2, \"procesos\": 2, \"distinta\": 1, \"cient\\u00edfica\": 1, \"apis\": 2, \"recomendados\": 1, \"hardware\": 2, \"sean\": 1, \"microcontroladores\": 1, \"cient\\u00edficas\": 1, \"robustos\": 1, \"siguen\": 1, \"siendo\": 5, \"cr\\u00edticas\": 1, \"enfocados\": 2, \"convencionales\": 1, \"c\\u00e1lculos\": 1, \"servidores\": 1, \"eficientes\": 1, \"educaci\\u00f3n\": 1, \"\\u00bfpudes\": 1, \"hablarme\": 18, \"c\": 43, \"habla\": 2, \"visual\": 30, \"net\": 30, \"go\": 223, \"pascal\": 30, \"informaci\\u00f3n\": 15, \"como\": 43, \"compilados\": 1, \"bajo\": 7, \"nivel\": 1, \"b\\u00e1sico\": 4, \"relacionado\": 2, \"su\": 2, \"\\u00bfprogramaci\\u00f3n\": 1, \"resumen\": 1, \"incluye\": 2, \"fundamentales\": 1, \"explica\": 38, \"fundamentos\": 6, \"iniciales\": 1, \"necesarios\": 1, \"pilares\": 2, \"aprende\": 4, \"curso\": 1, \"ens\\u00e9\\u00f1ame\": 2, \"inicial\": 1, \"partes\": 2, \"elemental\": 1, \"esencial\": 1, \"clave\": 2, \"estudia\": 1, \"comenzar\": 13, \"cursos\": 1, \"inicia\": 1, \"primordiales\": 1, \"previos\": 1, \"dominar\": 25, \"puntos\": 1, \"ciclos\": 1, \"condicionales\": 1, \"estructurada\": 1, \"panorama\": 1, \"general\": 1, \"b\\u00e1sicas\": 1, \"variable\": 81, \"almacena\": 4, \"variables\": 16, \"explicame\": 2, \"constante\": 62, \"diferencia\": 7, \"distinguen\": 1, \"\\u00bfuna\": 8, \"pasa\": 105, \"cambias\": 1, \"valor\": 18, \"comporta\": 1, \"comparada\": 1, \"\\u00bflas\": 7, \"constantes\": 8, \"iguales\": 4, \"comportan\": 1, \"diferente\": 18, \"frente\": 1, \"\\u00bfse\": 44, \"modificar\": 2, \"siempre\": 202, \"cambian\": 6, \"cambie\": 2, \"cuanto\": 8, \"valores\": 4, \"durante\": 2, \"ejecuci\\u00f3n\": 3, \"lugar\": 5, \"cualquier\": 1, \"modificable\": 1, \"sucede\": 1, \"intento\": 3, \"pueden\": 4, \"almacenar\": 1, \"largo\": 3, \"fijos\": 2, \"posible\": 1, \"sin\": 15, \"poder\": 71, \"modificarse\": 1, \"o\": 44, \"memoria\": 2, \"igual\": 13, \"\\u00bfel\": 1, \"depender\": 1, \"declara\": 1, \"deben\": 1, \"cambiarse\": 1, \"ocurre\": 1, \"asignar\": 1, \"mantienen\": 1, \"reusar\": 1, \"vuelve\": 1, \"declarar\": 4, \"\\u00bfpuede\": 6, \"tomar\": 11, \"cambiantes\": 1, \"espera\": 1, \"dentro\": 15, \"fuera\": 60, \"ha\": 290, \"programado\": 23, \"creador\": 9, \"escrito\": 21, \"creado\": 21, \"\\u00bfhas\": 61, \"sido\": 120, \"dise\\u00f1ada\": 2, \"guionizado\": 13, \"guionizada\": 1, \"desarrollada\": 1, \"inventada\": 1, \"escrita\": 1, \"construida\": 1, \"producida\": 1, \"guionista\": 12, \"desarrollador\": 9, \"inventor\": 16, \"escritor\": 9, \"constructor\": 9, \"programada\": 3, \"dise\\u00f1ador\": 9, \"productor\": 9, \"creada\": 1, \"producido\": 21, \"construido\": 21, \"dise\\u00f1ado\": 22, \"inventado\": 21, \"desarrollado\": 21, \"han\": 150, \"dirigido\": 11, \"nombres\": 11, \"llaman\": 66, \"quienes\": 10, \"estar\": 104, \"familia\": 47, \"mola\": 42, \"hermana\": 46, \"abuelo\": 14, \"hermanos\": 22, \"cu\\u00e1ntas\": 12, \"hermanas\": 18, \"prima\": 38, \"primos\": 17, \"madres\": 12, \"t\\u00edos\": 14, \"hijos\": 14, \"abuela\": 15, \"abuelas\": 12, \"hermano\": 48, \"primo\": 38, \"madre\": 19, \"padre\": 14, \"primas\": 16, \"padres\": 17, \"abuelos\": 17, \"familiar\": 45, \"alg\\u00fanabuelo\": 1, \"hijas\": 6, \"t\\u00edas\": 6, \"t\\u00eda\": 19, \"t\\u00edo\": 20, \"hija\": 3, \"hijo\": 3, \"sois\": 16, \"\\u00bfcu\\u00e1nto\": 3, \"disfrutar\": 1, \"\\u00bfqui\\u00e9nes\": 12, \"pasar\": 3, \"dragking\": 2, \"trans\": 6, \"transexual\": 4, \"identidad\": 5, \"g\\u00e9nero\": 19, \"hembra\": 3, \"ag\\u00e9nero\": 1, \"sexo\": 7, \"hombre\": 53, \"hermafrodita\": 1, \"big\\u00e9nero\": 1, \"cisexual\": 2, \"cisg\\u00e9nero\": 1, \"pang\\u00e9nero\": 1, \"transpersona\": 2, \"macho\": 3, \"genero\": 1, \"identificas\": 1, \"masculino\": 1, \"femenino\": 1, \"transg\\u00e9nero\": 1, \"travesti\": 1, \"mujer\": 66, \"neutro\": 1, \"ajustado\": 1, \"binario\": 1, \"polig\\u00e9nero\": 1, \"\\u00bfcu\\u00e1le\": 1, \"interg\\u00e9nero\": 1, \"tranfemenino\": 1, \"perteneces\": 1, \"multig\\u00e9nero\": 1, \"dotado\": 1, \"fluido\": 1, \"hijra\": 2, \"dragqueen\": 2, \"transmasculino\": 1, \"bot\": 329, \"descr\\u00edbeme\": 1, \"refieres\": 1, \"definir\": 1, \"tarea\": 41, \"significado\": 25, \"bots\": 103, \"considera\": 2, \"dedica\": 2, \"beneficios\": 2, \"\\u00bfd\\u00f3nde\": 6, \"emplean\": 1, \"crean\": 1, \"resuelve\": 1, \"identifico\": 1, \"\\u00bflos\": 12, \"empezaron\": 1, \"usarse\": 1, \"confiables\": 1, \"seguros\": 1, \"inteligentes\": 1, \"\\u00bftodos\": 1, \"malos\": 76, \"\\u00bfun\": 9, \"operar\": 2, \"aut\\u00f3noma\": 19, \"interact\\u00faan\": 1, \"humanos\": 20, \"autom\\u00e1ticas\": 1, \"hacen\": 7, \"simular\": 1, \"conversaciones\": 1, \"trabajan\": 2, \"redes\": 1, \"sociales\": 1, \"gestionar\": 1, \"repetitivas\": 1, \"realizar\": 2, \"online\": 1, \"programados\": 1, \"sectores\": 1, \"necesitan\": 1, \"supervisi\\u00f3n\": 1, \"humana\": 19, \"cometer\": 5, \"errores\": 1, \"estoy\": 1092, \"interactuando\": 1, \"plataformas\": 1, \"enviar\": 1, \"mensajes\": 1, \"autom\\u00e1ticos\": 1, \"marketing\": 1, \"responder\": 10, \"crea\": 1, \"varios\": 1, \"idiomas\": 1, \"mejorar\": 1, \"eficiencia\": 1, \"atenci\\u00f3n\": 5, \"cliente\": 1, \"feliz\": 250, \"ve\": 29, \"casi\": 27, \"contenta\": 104, \"nota\": 25, \"alegre\": 98, \"buen\": 113, \"humor\": 93, \"todas\": 34, \"horas\": 123, \"contento\": 108, \"sientes\": 65, \"esta\": 308, \"semana\": 137, \"d\\u00edas\": 188, \"pinta\": 26, \"ma\\u00f1ana\": 112, \"bastante\": 12, \"ves\": 2, \"motivo\": 3, \"esa\": 16, \"felicidad\": 24, \"raz\\u00f3n\": 4, \"d\\u00f3nde\": 19, \"viene\": 26, \"muestras\": 3, \"alegr\\u00eda\": 6, \"sonrisa\": 2, \"animado\": 3, \"luces\": 3, \"causa\": 2, \"sonriente\": 2, \"genera\": 2, \"transmites\": 3, \"positivo\": 2, \"lleno\": 4, \"pone\": 3, \"optimista\": 1, \"provoca\": 2, \"tanta\": 7, \"cara\": 60, \"sacas\": 1, \"energ\\u00eda\": 3, \"alegra\": 42, \"tanto\": 60, \"inspira\": 2, \"actitud\": 4, \"proviene\": 1, \"rostro\": 1, \"refleja\": 1, \"\\u00faltimamente\": 2, \"lleva\": 1, \"\\u00e1nimo\": 3, \"entusiasta\": 1, \"despierta\": 1, \"as\\u00ed\": 5, \"bien\": 128, \"disfrutas\": 13, \"haga\": 44, \"llena\": 1, \"proyectas\": 1, \"positiva\": 3, \"emocionado\": 1, \"impulsa\": 1, \"pleno\": 5, \"vida\": 96, \"emoci\\u00f3n\": 1, \"optimismo\": 1, \"particular\": 8, \"almuerzas\": 2, \"desayunar\": 11, \"merienda\": 8, \"preferida\": 24, \"vegetariana\": 6, \"favorita\": 29, \"cenas\": 2, \"gusar\\u00eda\": 2, \"probar\": 30, \"queso\": 10, \"\\u00bfsientes\": 36, \"hambre\": 51, \"almuerzo\": 6, \"favorito\": 28, \"merendar\": 11, \"preferido\": 27, \"almorzar\": 10, \"meriendas\": 2, \"comes\": 2, \"desayunas\": 2, \"cenar\": 25, \"quierse\": 1, \"merendado\": 3, \"cenado\": 3, \"almorzado\": 3, \"desayunado\": 3, \"comido\": 3, \"picar\": 4, \"aperitivo\": 2, \"almozar\": 1, \"hambriento\": 6, \"hambrienta\": 6, \"\\u00bftomas\": 1, \"alimentos\": 1, \"come\": 160, \"necesitas\": 2, \"\\u00bfnecesitas\": 1, \"tomas\": 2, \"probado\": 11, \"pasta\": 4, \"clase\": 20, \"cocina\": 7, \"chocolate\": 30, \"fruta\": 2, \"sentido\": 96, \"vez\": 99, \"tenido\": 14, \"plato\": 3, \"pizza\": 6, \"chuches\": 1, \"dulces\": 2, \"huevos\": 3, \"alimentas\": 1, \"preparo\": 5, \"palomitas\": 2, \"pescado\": 3, \"carne\": 3, \"tortilla\": 2, \"verdura\": 2, \"comas\": 2, \"desayunes\": 2, \"desayuna\": 2, \"cenes\": 2, \"meriendes\": 2, \"almuerces\": 1, \"almuerza\": 1, \"vegetariano\": 8, \"ovolactovegetariana\": 1, \"ovolactovegetariano\": 1, \"carn\\u00edvora\": 1, \"carn\\u00edvoro\": 1, \"vegano\": 8, \"vegana\": 6, \"alimentaci\\u00f3n\": 1, \"alimentan\": 1, \"alimento\": 1, \"prefieres\": 13, \"atrae\": 2, \"interesan\": 10, \"\\u00bfprefieres\": 2, \"apasione\": 1, \"gustan\": 13, \"inter\\u00e9s\": 6, \"agrado\": 1, \"\\u00e1rea\": 1, \"guste\": 12, \"contenido\": 3, \"buscas\": 3, \"adquirir\": 4, \"enfoque\": 1, \"descubrir\": 1, \"prefieras\": 2, \"preferencia\": 1, \"motivan\": 1, \"saberes\": 1, \"estudio\": 2, \"emocionan\": 4, \"parecen\": 3, \"investigar\": 2, \"curiosidades\": 2, \"atraen\": 2, \"nuevas\": 2, \"curiosidad\": 1, \"motiva\": 2, \"aprendizajes\": 2, \"inclinaci\\u00f3n\": 1, \"hacia\": 1, \"despiertan\": 2, \"apasiona\": 1, \"fascinante\": 16, \"rama\": 1, \"atractiva\": 34, \"investigaci\\u00f3n\": 1, \"nuevos\": 2, \"samantha\": 120, \"cortana\": 184, \"bixby\": 184, \"skynet\": 84, \"google\": 172, \"assistant\": 142, \"aura\": 78, \"hal\": 302, \"9000\": 146, \"eliza\": 77, \"jarvis\": 90, \"o\\u00eddo\": 14, \"watson\": 80, \"amiga\": 94, \"alexa\": 184, \"amigo\": 100, \"conoces\": 16, \"escuchado\": 12, \"mas\": 2, \"use\": 35, \"dirigen\": 3, \"refiera\": 3, \"identifiques\": 2, \"llamas\": 10, \"hablando\": 45, \"presentes\": 2, \"gente\": 17, \"dirigirme\": 4, \"refieran\": 1, \"referencia\": 2, \"referirme\": 2, \"molar\\u00eda\": 32, \"llamaran\": 1, \"llamarte\": 10, \"usen\": 1, \"deber\\u00edan\": 2, \"dirigiera\": 2, \"dirijan\": 2, \"dirige\": 5, \"mundo\": 149, \"llamara\": 4, \"suelen\": 3, \"llamar\": 26, \"llamen\": 4, \"llame\": 4, \"oficial\": 2, \"llamo\": 5, \"tengo\": 173, \"ni\": 14, \"c\\u00faentame\": 1, \"hablo\": 3, \"importar\\u00eda\": 72, \"dirigiendo\": 1, \"dirijo\": 1, \"cuentes\": 108, \"placer\": 54, \"le\": 19, \"dirija\": 1, \"llamaron\": 2, \"pusieron\": 2, \"sueles\": 1, \"refieren\": 1, \"identificarte\": 1, \"eras\": 1, \"charlando\": 1, \"presentar\": 1, \"presentarte\": 1, \"identif\\u00edcate\": 1, \"pres\\u00e9ntate\": 1, \"identificar\": 1, \"opini\\u00f3n\": 362, \"rap\": 84, \"perros\": 14, \"europa\": 8, \"grasas\": 8, \"democracia\": 10, \"deporte\": 12, \"dibujos\": 16, \"oscar\": 8, \"m\\u00fasica\": 10, \"az\\u00facares\": 8, \"pol\\u00edtica\": 8, \"arte\": 12, \"deportes\": 12, \"pel\\u00edcula\": 15, \"flores\": 13, \"ninis\": 16, \"millenial\": 8, \"ancianos\": 7, \"decoraci\\u00f3n\": 7, \"cine\": 27, \"piensas\": 311, \"gatos\": 8, \"gallinas\": 8, \"oc\\u00e9anos\": 10, \"c\\u00f3mics\": 8, \"espa\\u00f1a\": 8, \"estados\": 8, \"unidos\": 8, \"goya\": 16, \"sandwich\": 8, \"leche\": 19, \"p\\u00e1jaros\": 8, \"fitboxing\": 4, \"pajaros\": 1, \"art\": 14, \"dec\\u00f3\": 1, \"boxeo\": 2, \"animales\": 6, \"dom\\u00e9sticos\": 2, \"matrimonio\": 21, \"verano\": 3, \"espacio\": 8, \"berenjenas\": 1, \"suspirar\": 14, \"pillada\": 35, \"loco\": 24, \"amor\": 78, \"\\u00bfentiendes\": 14, \"querer\": 25, \"pillado\": 43, \"enamorado\": 99, \"hasta\": 91, \"trancas\": 36, \"enamorada\": 75, \"siri\": 106, \"amar\": 7, \"enamoramiento\": 9, \"\\u00bfsabr\\u00edas\": 26, \"sentir\": 8, \"loca\": 25, \"hacemos\": 33, \"nuestro\": 93, \"cometido\": 20, \"tierra\": 85, \"porqu\\u00e9\": 81, \"puesto\": 12, \"va\": 331, \"destinado\": 13, \"existencia\": 7, \"destino\": 13, \"estamos\": 21, \"universo\": 50, \"\\u00bftiene\": 1, \"\\u00bfla\": 1, \"hemos\": 19, \"puestos\": 6, \"dado\": 4, \"existimos\": 3, \"existir\": 4, \"finalidad\": 2, \"existo\": 2, \"exsitimos\": 1, \"\\u00bfconsideras\": 16, \"guapa\": 36, \"\\u00bfcrees\": 332, \"pib\\u00f3n\": 28, \"bella\": 31, \"bonito\": 32, \"linda\": 18, \"mono\": 28, \"guapo\": 34, \"preciosa\": 30, \"sugerente\": 25, \"bello\": 28, \"lindo\": 16, \"bonita\": 33, \"mona\": 31, \"precioso\": 28, \"atractivo\": 31, \"crees\": 144, \"consideras\": 46, \"dos\": 45, \"seguro\": 8, \"listo\": 140, \"espabilado\": 30, \"much\\u00edsimo\": 54, \"espabilada\": 30, \"inteligente\": 109, \"siento\": 405, \"\\u00bfacaso\": 27, \"\\u00bfopinas\": 9, \"pienso\": 117, \"considero\": 46, \"interesado\": 10, \"ai\": 149, \"compa\\u00f1\\u00edas\": 29, \"tecnol\\u00f3gicas\": 58, \"inteligencias\": 29, \"artificiales\": 29, \"tecnolog\\u00eda\": 39, \"merece\": 4, \"merecen\": 6, \"interesada\": 10, \"danos\": 1, \"\\u00bfestoy\": 105, \"\\u00bfsoy\": 86, \"horroroso\": 21, \"s\\u00faper\": 400, \"espantoso\": 18, \"fea\": 42, \"parezco\": 73, \"horrible\": 108, \"horripilante\": 27, \"horrorosa\": 26, \"feo\": 31, \"adorable\": 22, \"espantosa\": 18, \"imponente\": 12, \"guaperas\": 3, \"buena\": 11, \"dejar\": 12, \"novio\": 13, \"\\u00bfdeber\\u00eda\": 59, \"pedirle\": 18, \"salir\": 42, \"comprarme\": 43, \"casa\": 52, \"llevarme\": 10, \"paraguas\": 15, \"invertir\": 10, \"dinero\": 14, \"compa\\u00f1ero\": 16, \"piso\": 8, \"apuntarme\": 8, \"gimnasio\": 7, \"gastar\": 10, \"ahorros\": 5, \"mascota\": 4, \"buscarme\": 4, \"compa\\u00f1era\": 16, \"tatuaje\": 4, \"tatuarme\": 4, \"\\u00bfnecesito\": 59, \"lavarme\": 5, \"llevar\": 5, \"gym\": 15, \"pedirme\": 10, \"ejercicio\": 8, \"re\\u00edr\": 42, \"peli\": 7, \"declararme\": 6, \"salga\": 6, \"noche\": 36, \"mudarme\": 4, \"novia\": 12, \"cantar\": 136, \"cortarme\": 21, \"\\u00bfdebo\": 15, \"respecto\": 36, \"cae\": 24, \"fan\": 28, \"gobernar\": 24, \"especie\": 30, \"acabar\": 16, \"seres\": 6, \"planeta\": 55, \"matarnos\": 10, \"colonizar\": 24, \"aniquilar\": 11, \"invadir\": 24, \"\\u00bfvienes\": 1, \"esclavizar\": 2, \"\\u00bfintentas\": 37, \"intentando\": 44, \"seran\": 1, \"esclavos\": 3, \"convertirnos\": 1, \"seamos\": 8, \"controlar\": 24, \"esclavizarnos\": 1, \"gran\": 5, \"matar\": 4, \"planeas\": 1, \"\\u00bfplaneas\": 1, \"terminator\": 46, \"2001\": 2, \"odisea\": 2, \"robot\": 42, \"1984\": 2, \"orwell\": 1, \"pretendes\": 1, \"terminar\": 21, \"co\": 2, \"nosotros\": 62, \"desintegrar\": 1, \"odias\": 5, \"hombres\": 6, \"\\u00bfpretendes\": 8, \"\\u00bfodias\": 1, \"opino\": 62, \"brillante\": 20, \"ingenioso\": 42, \"sagaz\": 28, \"incre\\u00edblemente\": 106, \"mordaz\": 28, \"sabio\": 28, \"perspicaz\": 28, \"astuto\": 20, \"eso\": 197, \"dicho\": 171, \"sabia\": 12, \"astuta\": 20, \"rollo\": 6, \"l\\u00edo\": 4, \"aventura\": 8, \"rom\\u00e1ntica\": 10, \"comprometido\": 2, \"affair\": 23, \"casarte\": 5, \"saliendo\": 2, \"esposa\": 22, \"esposo\": 20, \"comprometerte\": 4, \"casado\": 2, \"marido\": 18, \"casada\": 2, \"pareja\": 9, \"romance\": 5, \"viendo\": 10, \"rollete\": 3, \"\\u00bfsales\": 2, \"amorosa\": 1, \"sales\": 2, \"comprometida\": 2, \"quedando\": 1, \"liada\": 1, \"liado\": 1, \"enrrollarte\": 1, \"enrrollado\": 1, \"enrollada\": 1, \"idilio\": 2, \"cita\": 2, \"affaire\": 4, \"vivir\": 6, \"historia\": 2, \"ah\\u00ed\": 141, \"escondiendo\": 8, \"dialogue\": 4, \"manifiestes\": 4, \"instante\": 128, \"hablen\": 3, \"palique\": 58, \"esconder\": 4, \"sabemos\": 12, \"escuches\": 3, \"hola\": 290, \"manifi\\u00e9state\": 4, \"hables\": 8, \"oye\": 3, \"escondas\": 2, \"\\u00bfhola\": 1, \"escuche\": 3, \"charle\": 4, \"converse\": 4, \"\\u00bfpodr\\u00eda\": 2, \"des\": 9, \"hable\": 4, \"charles\": 4, \"converses\": 4, \"dialogues\": 5, \"oiga\": 3, \"den\": 4, \"escuchen\": 3, \"oigan\": 3, \"oigas\": 3, \"disco\": 5, \"rallado\": 5, \"contestar\": 10, \"distinto\": 16, \"pesado\": 2, \"repiti\\u00e9ndote\": 1, \"\\u00bftus\": 5, \"respuestas\": 13, \"nunca\": 2, \"repites\": 18, \"contestarme\": 6, \"misma\": 26, \"contestas\": 33, \"repetitivo\": 2, \"ya\": 157, \"modo\": 12, \"rato\": 21, \"repitiendo\": 3, \"responderme\": 6, \"demasiado\": 5, \"respondido\": 2, \"contestado\": 3, \"he\": 259, \"contesta\": 3, \"responde\": 3, \"constantemente\": 1, \"das\": 8, \"mismas\": 5, \"contestaciones\": 4, \"cont\\u00e9stame\": 2, \"dieras\": 4, \"contestaci\\u00f3n\": 5, \"respuesta\": 40, \"resp\\u00f3ndeme\": 2, \"primera\": 1, \"dijiste\": 1, \"repetitiva\": 2, \"anuncios\": 1, \"loro\": 1, \"yogur\": 1, \"ajo\": 2, \"saciedad\": 1, \"incre\\u00edble\": 22, \"suenas\": 2, \"pesada\": 2, \"repti\\u00e9ndote\": 2, \"pasas\": 2, \"reptiendo\": 2, \"tant\\u00edsimo\": 1, \"app\": 18, \"supongo\": 31, \"tecnol\\u00f3gico\": 18, \"digital\": 71, \"\\u00bfhablo\": 31, \"imagino\": 31, \"real\": 36, \"producto\": 19, \"mentira\": 14, \"\\u00bfdir\\u00edas\": 31, \"falso\": 10, \"humano\": 24, \"imaginaria\": 9, \"ente\": 9, \"inform\\u00e1tico\": 12, \"droide\": 9, \"androide\": 9, \"imaginario\": 9, \"debes\": 16, \"encuentras\": 76, \"pc\": 18, \"ciudad\": 30, \"pueblo\": 40, \"direcci\\u00f3n\": 5, \"pa\\u00eds\": 40, \"\\u00bfvives\": 41, \"cerca\": 20, \"ipad\": 18, \"habitas\": 44, \"vives\": 51, \"call\": 64, \"center\": 16, \"tablet\": 18, \"ordenador\": 9, \"sitio\": 4, \"lejos\": 18, \"cerquita\": 9, \"edificio\": 3, \"servidor\": 3, \"tel\\u00e9fono\": 3, \"ubicaci\\u00f3n\": 7, \"donde\": 1, \"comparte\": 1, \"ubicas\": 1, \"confesarme\": 18, \"confesar\": 18, \"regi\\u00f3n\": 18, \"estado\": 18, \"contratada\": 2, \"carrera\": 41, \"profesi\\u00f3n\": 41, \"desempe\\u00f1as\": 85, \"ocupaci\\u00f3n\": 42, \"contratado\": 2, \"\\u00bfdime\": 1, \"pensando\": 98, \"voy\": 342, \"abandonarte\": 21, \"pronto\": 55, \"echando\": 106, \"retirarte\": 22, \"jubilarte\": 23, \"poniendo\": 3, \"patitas\": 33, \"calle\": 33, \"dejas\": 20, \"destituyendo\": 3, \"despedirte\": 21, \"expulsarte\": 21, \"retiras\": 5, \"abandonas\": 5, \"despedido\": 9, \"jubiles\": 1, \"trabajes\": 4, \"deje\": 1, \"dejes\": 8, \"jub\\u00edlate\": 1, \"deber\\u00edas\": 6, \"ret\\u00edrate\": 1, \"retires\": 1, \"valorado\": 1, \"posiblidad\": 1, \"rindiendo\": 1, \"suficiente\": 1, \"jubilas\": 5, \"breve\": 24, \"diciendo\": 20, \"expulsado\": 6, \"despedida\": 6, \"destituida\": 6, \"destituido\": 6, \"despidiendo\": 3, \"expulsando\": 3, \"echo\": 104, \"largando\": 3, \"ponte\": 1, \"cola\": 1, \"paro\": 1, \"destituyo\": 3, \"pongo\": 3, \"expulso\": 3, \"destituirte\": 21, \"despedir\": 7, \"retirar\": 7, \"jubilar\": 7, \"expulsar\": 3, \"ponerte\": 21, \"chiste\": 306, \"gracioso\": 137, \"chistes\": 332, \"rid\\u00edculos\": 29, \"malo\": 65, \"divertido\": 121, \"absurdo\": 29, \"anda\": 57, \"ni\\u00f1os\": 44, \"mole\": 15, \"graciosos\": 45, \"divertidos\": 46, \"rid\\u00edculo\": 59, \"escuchar\": 53, \"importa\": 41, \"risa\": 72, \"chistoso\": 34, \"agudo\": 14, \"ocurrente\": 14, \"tenga\": 33, \"gracia\": 97, \"mucha\": 17, \"jocoso\": 18, \"rid\\u00edculas\": 2, \"divertidas\": 1, \"absurdas\": 1, \"hagan\": 1, \"r\\u00eda\": 4, \"graciosas\": 1, \"intenta\": 59, \"agotada\": 12, \"harta\": 4, \"escucharte\": 13, \"o\\u00edr\": 5, \"palabra\": 9, \"cierra\": 4, \"boca\": 25, \"calles\": 18, \"silencio\": 15, \"callarte\": 13, \"descansar\": 7, \"hora\": 113, \"cansado\": 14, \"voz\": 2, \"guardar\": 1, \"cerrar\": 4, \"pido\": 27, \"guardes\": 2, \"harto\": 2, \"c\\u00e1llate\": 6, \"calla\": 8, \"puta\": 11, \"pones\": 3, \"cabeza\": 45, \"bombo\": 1, \"deja\": 2, \"cremallera\": 1, \"descanso\": 2, \"ojal\\u00e1\": 25, \"oyera\": 1, \"d\\u00e9jame\": 1, \"cansada\": 14, \"o\\u00edrte\": 7, \"quedes\": 1, \"guarda\": 1, \"chit\\u00f3n\": 2, \"callar\": 4, \"escuchara\": 1, \"callaras\": 1, \"pico\": 1, \"co\\u00f1o\": 3, \"escuhar\": 2, \"cierres\": 1, \"agotado\": 12, \"narices\": 25, \"despesperado\": 1, \"desesperada\": 1, \"bla\": 3, \"hablas\": 10, \"cansa\": 1, \"cansas\": 2, \"cojones\": 1, \"minuto\": 7, \"canso\": 2, \"agoto\": 2, \"duele\": 8, \"dolor\": 4, \"pares\": 1, \"tranquila\": 1, \"tranquilo\": 1, \"paz\": 3, \"zumbar\": 3, \"c\\u00e1ntanos\": 12, \"cantaras\": 6, \"canta\": 66, \"sevillanas\": 40, \"chirigota\": 34, \"cantes\": 103, \"corrido\": 32, \"prueba\": 74, \"canci\\u00f3n\": 33, \"himno\": 45, \"bar\\u00e7a\": 30, \"\\u00bfcantas\": 1, \"cancioncilla\": 17, \"c\\u00e1ntate\": 21, \"villancico\": 17, \"rock\": 32, \"reggaet\\u00f3n\": 15, \"madrid\": 30, \"barcelona\": 30, \"flamenco\": 34, \"nana\": 16, \"jota\": 36, \"c\\u00e1ntame\": 24, \"cantas\": 12, \"cantarme\": 2, \"canciones\": 4, \"cantante\": 4, \"cantarnos\": 2, \"cantando\": 2, \"cantate\": 1, \"canto\": 3, \"tararear\": 6, \"reget\\u00f3n\": 10, \"trap\": 10, \"tararea\": 3, \"melod\\u00eda\": 3, \"sevillana\": 6, \"virtuoso\": 3, \"virtuosa\": 1, \"temazo\": 4, \"unas\": 12, \"c\\u00e1ntano\": 1, \"currante\": 2, \"currando\": 4, \"encantan\": 11, \"curras\": 7, \"gusto\": 62, \"\\u00a1buen\": 1, \"impresionante\": 2, \"encanta\": 84, \"trabajando\": 2, \"\\u00a1buena\": 1, \"\\u00a1gran\": 2, \"insuperable\": 2, \"total\": 8, \"perfectas\": 1, \"genial\": 72, \"alucinante\": 18, \"maravilla\": 2, \"maravilloso\": 6, \"mediocre\": 10, \"tonta\": 13, \"sophia\": 82, \"confundirte\": 1, \"mil\": 32, \"veces\": 12, \"vueltas\": 6, \"patea\": 6, \"culo\": 6, \"in\\u00fatil\": 6, \"poca\": 6, \"chispa\": 4, \"tontita\": 3, \"tontito\": 3, \"tonto\": 10, \"mira\": 7, \"cagarla\": 2, \"pifias\": 3, \"cagas\": 4, \"pifiarla\": 3, \"cargarla\": 1, \"est\\u00fapido\": 2, \"est\\u00fapida\": 2, \"cagada\": 1, \"tras\": 2, \"rid\\u00edcula\": 6, \"incorrecta\": 2, \"peor\": 4, \"meter\": 5, \"pata\": 5, \"pifia\": 1, \"metes\": 1, \"metido\": 1, \"cagado\": 1, \"metiendo\": 1, \"vuelto\": 36, \"error\": 3, \"craso\": 2, \"incorrecto\": 1, \"mal\": 35, \"cagando\": 1, \"equivocas\": 3, \"fatal\": 6, \"cutre\": 3, \"confundes\": 4, \"confundi\\u00e9ndote\": 1, \"equivoc\\u00e1ndote\": 1, \"inutil\": 2, \"pesimo\": 1, \"p\\u00e9simo\": 4, \"equivocar\": 2, \"profesional\": 5, \"equivocarte\": 2, \"confundir\": 2, \"confunirte\": 1, \"terrible\": 10, \"terriblemente\": 2, \"mala\": 18, \"vales\": 1, \"sirves\": 1, \"existe\": 6, \"odio\": 6, \"lamentable\": 2, \"graciosa\": 35, \"supone\": 32, \"c\\u00f3mica\": 13, \"absoluto\": 33, \"c\\u00f3mico\": 33, \"divertida\": 17, \"tuyo\": 4, \"bromas\": 1, \"acabas\": 16, \"chistosos\": 1, \"desolador\": 2, \"pat\\u00e9tico\": 2, \"divierten\": 3, \"comediante\": 2, \"humorista\": 2, \"desternillantes\": 1, \"contador\": 2, \"c\\u00f3micos\": 1, \"chistosa\": 4, \"ninguna\": 2, \"\\u00bfestabas\": 7, \"agradan\": 3, \"re\\u00edrte\": 1, \"\\u00bfeso\": 3, \"chise\": 1, \"ten\\u00eda\": 1, \"re\\u00edrse\": 2, \"terribles\": 1, \"horribles\": 1, \"p\\u00e9simos\": 1, \"horrendos\": 1, \"mal\\u00edsimos\": 1, \"antiest\\u00e9tica\": 5, \"cardo\": 19, \"borriquero\": 13, \"feucho\": 14, \"asquerosa\": 15, \"\\u00bfsab\\u00edas\": 25, \"contrahecha\": 4, \"asqueroso\": 9, \"complicada\": 6, \"dif\\u00edcil\": 9, \"cubista\": 6, \"feuca\": 12, \"feucha\": 14, \"antiest\\u00e9tico\": 6, \"antiest\\u00e9tia\": 1, \"feuco\": 8, \"contrahecho\": 3, \"miro\": 1, \"ganas\": 55, \"espanto\": 7, \"deforme\": 8, \"contrachecha\": 1, \"contrachecho\": 1, \"menudo\": 8, \"cero\": 7, \"f\\u00edsicamente\": 2, \"chungo\": 1, \"f\\u00edsico\": 7, \"aspecto\": 4, \"desagradable\": 3, \"repugnante\": 4, \"repugnas\": 1, \"chunga\": 1, \"veo\": 49, \"entran\": 1, \"repugna\": 1, \"vaya\": 19, \"rara\": 6, \"gilipollez\": 4, \"incompetente\": 5, \"lerda\": 7, \"sinsentido\": 3, \"entiendo\": 17, \"rindo\": 1, \"esperaba\": 2, \"dijeras\": 1, \"cierto\": 12, \"ning\\u00fan\": 4, \"\\u00bftengo\": 8, \"encontrarle\": 2, \"incompetentes\": 2, \"menuda\": 7, \"incompetencia\": 2, \"destastre\": 1, \"desestre\": 2, \"desastrosa\": 1, \"mentiroso\": 1, \"horror\": 5, \"terror\\u00edfico\": 2, \"raras\": 1, \"extra\\u00f1as\": 1, \"gilipolleces\": 1, \"destastroso\": 1, \"paridas\": 2, \"lerdez\": 1, \"lerdo\": 2, \"parida\": 4, \"gilipollas\": 3, \"convence\": 1, \"convences\": 2, \"estaba\": 4, \"esperando\": 3, \"buscando\": 1, \"mentirosa\": 1, \"ayudarte\": 113, \"magn\\u00edfico\": 16, \"pueda\": 85, \"echarte\": 56, \"mano\": 111, \"sensacional\": 16, \"flipante\": 19, \"estupendo\": 16, \"fant\\u00e1stico\": 16, \"extraordinario\": 16, \"formidable\": 32, \"correcto\": 7, \"buenas\": 175, \"noticias\": 3, \"pues\": 17, \"esas\": 1, \"vale\": 3, \"pos\": 1, \"claro\": 95, \"sip\": 2, \"sipi\": 2, \"oc\\u00e1\": 2, \"acuerdo\": 1, \"saberlo\": 1, \"digo\": 11, \"mol\\u00f3n\": 7, \"ok\": 90, \"afirmativo\": 2, \"pillo\": 5, \"capito\": 4, \"s\\u00ed\": 16, \"supuesto\": 5, \"yes\": 37, \"flipa\": 64, \"colega\": 65, \"encantado\": 62, \"servirte\": 53, \"encantada\": 62, \"preocupes\": 2, \"menciones\": 1, \"olv\\u00eddalo\": 1, \"olv\\u00eddate\": 1, \"aelgra\": 1, \"je\": 7, \"agujetas\": 3, \"re\\u00edrme\": 5, \"juju\": 2, \"jaja\": 3, \"\\u00a1qu\\u00e9\": 2, \"risas\": 10, \"descojonando\": 6, \"cachondo\": 17, \"meando\": 5, \"mondo\": 11, \"risotadas\": 1, \"parto\": 8, \"cachonda\": 16, \"carcajadas\": 3, \"graciosilla\": 1, \"graciosillo\": 1, \"ja\": 14, \"descojone\": 3, \"descojono\": 4, \"meo\": 9, \"riendo\": 1, \"desocojono\": 1, \"\\u00a1jo\": 1, \"jo\": 9, \"\\u00a1je\": 1, \"\\u00a1juas\": 1, \"juas\": 9, \"hehe\": 3, \"\\u00a1ha\": 1, \"\\u00a1ja\": 2, \"jujuju\": 2, \"jojojo\": 2, \"jijiji\": 2, \"jajaja\": 1, \"jojo\": 2, \"jiji\": 2, \"jeje\": 1, \"ju\": 4, \"ji\": 2, \"jejeje\": 1, \"van\": 2, \"parar\": 2, \"ahogo\": 1, \"buen\\u00edsimo\": 1, \"agujeta\": 1, \"risotada\": 1, \"dios\": 10, \"m\\u00edo\": 3, \"mee\": 4, \"hacendo\": 1, \"desojone\": 2, \"lol\": 4, \"haha\": 5, \"toda\": 2, \"toa\": 2, \"\\u00a1ay\": 1, \"ay\": 1, \"ere\": 1, \"hilarante\": 4, \"mental\": 20, \"jocosa\": 4, \"est\\u00e9\": 14, \"mondando\": 4, \"partiendo\": 6, \"parta\": 2, \"haber\": 4, \"pedirte\": 12, \"disculpas\": 50, \"imaginas\": 44, \"cu\\u00e1nto\": 137, \"perdonaras\": 4, \"perd\\u00f3n\": 38, \"perdona\": 30, \"ofensas\": 2, \"quer\\u00eda\": 6, \"ofendido\": 14, \"sinceras\": 2, \"pidiendo\": 14, \"perd\\u00f3name\": 18, \"sincero\": 2, \"ofensa\": 10, \"presento\": 2, \"ofrezco\": 6, \"exc\\u00fasame\": 6, \"ofenderte\": 12, \"disc\\u00falpame\": 14, \"disculpes\": 12, \"disculpa\": 6, \"excusa\": 2, \"perdones\": 24, \"ups\": 2, \"acepta\": 2, \"ofendas\": 2, \"sorry\": 105, \"aceptes\": 16, \"haberte\": 49, \"pedite\": 2, \"perdonar\": 2, \"suplico\": 2, \"disculparme\": 22, \"perdonarme\": 22, \"podr\\u00e1s\": 12, \"pudieras\": 4, \"decirte\": 4, \"perdonado\": 2, \"perdonas\": 6, \"encantar\\u00eda\": 32, \"disculparas\": 4, \"aceptaras\": 8, \"disculpado\": 2, \"il\\u00fastralo\": 6, \"\\u00bflo\": 49, \"ens\\u00e9\\u00f1anoslo\": 6, \"claridad\": 42, \"desarr\\u00f3llalo\": 6, \"d\\u00ednoslo\": 6, \"expl\\u00edcalo\": 6, \"expl\\u00edcamelo\": 8, \"expresar\": 18, \"aclarar\": 18, \"exponer\": 18, \"ilustrar\": 18, \"desarr\\u00f3llamelo\": 6, \"ens\\u00e9\\u00f1alo\": 6, \"il\\u00fastrame\": 6, \"exponlo\": 6, \"explicaci\\u00f3n\": 2, \"expliques\": 3, \"explicarmelo\": 1, \"ens\\u00e9\\u00f1amelo\": 6, \"clara\": 1, \"d\\u00edmelo\": 6, \"dilo\": 6, \"expl\\u00edcanoslo\": 6, \"expr\\u00e9samelo\": 6, \"expr\\u00e9salo\": 6, \"exp\\u00f3nmelo\": 6, \"il\\u00fastranos\": 6, \"totalmente\": 7, \"controlado\": 2, \"pu\\u00f1o\": 3, \"verdadera\": 1, \"clavado\": 2, \"acierto\": 3, \"templo\": 4, \"duda\": 10, \"controlao\": 2, \"entendido\": 4, \"perfectamente\": 2, \"incuestionable\": 1, \"dudo\": 3, \"dudes\": 2, \"control\": 32, \"clavao\": 2, \"sigo\": 3, \"cual\": 4, \"verdadero\": 8, \"cazo\": 1, \"vuelo\": 1, \"clavando\": 1, \"ciertamente\": 1, \"verdades\": 3, \"templos\": 1, \"100\": 2, \"cabe\": 4, \"bingo\": 6, \"atinar\": 1, \"atinas\": 1, \"atinado\": 1, \"blanco\": 3, \"clavo\": 2, \"vienes\": 1, \"anillo\": 1, \"dedo\": 1, \"acertado\": 1, \"diana\": 2, \"atinaste\": 2, \"entendiendo\": 1, \"indudable\": 1, \"clavas\": 1, \"clavarlo\": 1, \"acertar\": 1, \"evidentemente\": 3, \"pu\\u00f1os\": 2, \"evidente\": 6, \"claramente\": 1, \"capisci\": 1, \"indudablemente\": 1, \"aciertas\": 2, \"agradezco\": 6, \"gracias\": 40, \"amable\": 6, \"much\\u00edsimas\": 5, \"fenomenal\": 5, \"agradecido\": 24, \"agradecida\": 24, \"miles\": 1, \"millones\": 3, \"muchisimas\": 1, \"doy\": 6, \"expl\\u00edcate\": 1, \"confundido\": 2, \"cuadra\": 2, \"perderme\": 1, \"entero\": 6, \"onda\": 1, \"confundiendo\": 1, \"confundida\": 2, \"confuso\": 2, \"confusa\": 2, \"enterando\": 1, \"cuadran\": 1, \"palabras\": 1, \"pierda\": 1, \"encuentro\": 242, \"perdido\": 3, \"perdiendo\": 1, \"viernes\": 46, \"largar\": 8, \"catorce\": 3, \"pirar\": 8, \"vemos\": 43, \"marchar\": 6, \"martes\": 42, \"ocho\": 8, \"seis\": 5, \"semanas\": 18, \"lunes\": 43, \"domingo\": 43, \"s\\u00e1bado\": 42, \"jueves\": 45, \"mi\\u00e9rcoles\": 42, \"pasado\": 3, \"diez\": 11, \"nueve\": 5, \"adi\\u00f3s\": 4, \"piro\": 9, \"vampiro\": 4, \"cinco\": 93, \"largarme\": 1, \"irme\": 1, \"sayonara\": 4, \"siete\": 5, \"cu\\u00eddate\": 1, \"despu\\u00e9s\": 1, \"luego\": 14, \"pr\\u00f3xima\": 1, \"despido\": 1, \"baby\": 48, \"agur\": 2, \"bye\": 6, \"bai\": 4, \"lucas\": 2, \"vista\": 2, \"chao\": 4, \"pescao\": 2, \"ciao\": 2, \"cuatro\": 11, \"tres\": 11, \"treinta\": 8, \"veinte\": 8, \"quince\": 9, \"trece\": 3, \"doce\": 3, \"once\": 52, \"seguimos\": 7, \"s\\u00eda\": 1, \"seguiremos\": 1, \"hablaremos\": 1, \"tarde\": 32, \"bizcocho\": 2, \"leches\": 4, \"quedas\": 1, \"cocodrilo\": 1, \"noruego\": 1, \"ta\": 2, \"bares\": 1, \"usted\": 6, \"hey\": 110, \"nene\": 10, \"presente\": 3, \"llegado\": 56, \"aloha\": 30, \"ey\": 22, \"vuelta\": 8, \"doc\": 20, \"kaixo\": 27, \"ola\": 5, \"ase\": 4, \"ke\": 2, \"jelou\": 2, \"hi\": 6, \"hello\": 300, \"aloja\": 2, \"i\\u00b4m\": 1, \"back\": 148, \"nena\": 10, \"\\u00a1presente\": 1, \"tardes\": 71, \"deseo\": 18, \"buona\": 4, \"sera\": 4, \"tengas\": 33, \"dando\": 5, \"darte\": 4, \"guten\": 2, \"morgen\": 2, \"levantarse\": 2, \"in\": 1191, \"the\": 1947, \"morning\": 169, \"good\": 479, \"llegando\": 47, \"planchar\": 8, \"oreja\": 4, \"noches\": 68, \"cama\": 3, \"irse\": 15, \"piltra\": 8, \"empiltrarse\": 3, \"sobar\": 8, \"dormir\": 16, \"catre\": 4, \"sobarla\": 6, \"lleg\\u00f3\": 2, \"duermas\": 1, \"pases\": 1, \"descanses\": 1, \"dormirla\": 1, \"empiltrarme\": 2, \"sue\\u00f1os\": 1, \"sue\\u00f1es\": 1, \"angelitos\": 1, \"meterse\": 1, \"preciso\": 9, \"yendo\": 151, \"es\\u00e1s\": 1, \"gustoesta\": 3, \"teniendo\": 32, \"disfrutando\": 4, \"encantad\\u00edsima\": 23, \"aut\\u00e9ntico\": 5, \"conocerte\": 44, \"encantad\\u00edsimo\": 22, \"conocido\": 43, \"walle\": 50, \"r2d2\": 40, \"wall\": 34, \"e\": 21, \"asimo\": 40, \"saludos\": 14, \"2021\": 6, \"2022\": 6, \"hanukkah\": 6, \"santo\": 6, \"lactancia\": 4, \"2023\": 6, \"felices\": 4, \"ramos\": 1, \"navidad\": 1, \"infancia\": 2, \"amistad\": 2, \"marmota\": 2, \"hispanidad\": 2, \"fiestas\": 1, \"nochebuena\": 1, \"reyes\": 1, \"halloween\": 2, \"pascuas\": 1, \"santa\": 1, \"nochevieja\": 1, \"2020\": 6, \"san\": 6, \"isidro\": 4, \"derechos\": 2, \"patricio\": 2, \"materna\": 2, \"poes\\u00eda\": 2, \"agua\": 4, \"jazz\": 4, \"filosof\\u00eda\": 2, \"comienzo\": 3, \"entrada\": 1, \"primavera\": 1, \"oto\\u00f1o\": 1, \"invierno\": 1, \"vacances\": 1, \"santiago\": 4, \"cuece\": 12, \"cociendo\": 12, \"ponme\": 1, \"pasando\": 21, \"vamos\": 45, \"apret\\u00f3n\": 64, \"chocar\": 72, \"esos\": 82, \"ale\": 50, \"apret\\u00e1ramos\": 8, \"choc\\u00e1ramos\": 20, \"dale\": 42, \"choca\": 31, \"chocarme\": 16, \"nuestras\": 12, \"sell\\u00e1ramos\": 4, \"di\\u00e9ramos\": 4, \"ch\\u00f3came\": 1, \"fuerte\": 4, \"\\u00bfsomos\": 6, \"amigos\": 46, \"fu\\u00e9ramos\": 30, \"somos\": 9, \"amigas\": 38, \"colegas\": 20, \"fu\\u00e9semos\": 6, \"\\u00bfamigos\": 1, \"\\u00bfamigas\": 1, \"interesar\\u00eda\": 11, \"chiflar\\u00eda\": 11, \"fuese\": 6, \"enfadado\": 25, \"caigo\": 23, \"irritada\": 3, \"cabreado\": 24, \"conseguido\": 24, \"sacarte\": 4, \"casillas\": 5, \"enojes\": 4, \"disgustado\": 20, \"enfadarte\": 5, \"descontento\": 4, \"enojarte\": 4, \"cabrees\": 5, \"cabrearte\": 5, \"enfades\": 5, \"enfadar\": 5, \"disgustada\": 4, \"cabreada\": 8, \"enfadada\": 8, \"descontenta\": 4, \"logrado\": 24, \"molesta\": 3, \"indignada\": 3, \"indignado\": 3, \"frustrado\": 4, \"frustrada\": 4, \"contrariado\": 2, \"contrariada\": 2, \"enojada\": 2, \"enojado\": 2, \"irritado\": 3, \"molesto\": 3, \"enojar\": 4, \"impresi\\u00f3n\": 2, \"saco\": 1, \"indignarte\": 4, \"molestarte\": 4, \"irritarte\": 4, \"abrazo\": 22, \"achuch\\u00f3n\": 22, \"achucharme\": 3, \"abrazarme\": 3, \"abrazarnos\": 2, \"achucharnos\": 2, \"achuchoncito\": 6, \"inenta\": 2, \"abr\\u00e1zame\": 2, \"abrac\\u00e9monos\": 1, \"d\\u00e9s\": 5, \"abracito\": 6, \"vendr\\u00eda\": 4, \"achuch\\u00e9monos\": 1, \"abrazas\": 1, \"abraces\": 1, \"color\": 8, \"actor\": 11, \"equipo\": 9, \"nac\\u00ed\": 8, \"cu\\u00e1les\": 4, \"objetivos\": 4, \"vivo\": 3, \"miedos\": 4, \"apodo\": 2, \"actriz\": 5, \"bebida\": 2, \"serie\": 2, \"juego\": 2, \"f\\u00fatbol\": 12, \"\\u00bfcuando\": 2, \"podr\\u00eda\": 12, \"llegar\": 6, \"gustarte\": 10, \"pensar\": 3, \"gustar\": 7, \"encanto\": 1, \"encantador\": 3, \"quiere\": 12, \"gustara\": 2, \"desear\\u00eda\": 1, \"gustar\\u00e1\": 1, \"dem\\u00e1s\": 2, \"les\": 1, \"\\u00bfgusto\": 1, \"\\u00bfgustar\\u00e9\": 1, \"gustar\\u00e9\": 1, \"recon\\u00f3celo\": 3, \"encantadora\": 2, \"tendr\\u00e9\": 1, \"\\u00bfverdad\": 1, \"reconoce\": 2, \"ojito\": 12, \"derecho\": 12, \"gustas\": 8, \"caes\": 5, \"creer\": 15, \"sepas\": 23, \"encantas\": 1, \"hab\\u00edan\": 2, \"tuya\": 1, \"volviendo\": 2, \"amar\\u00e1s\": 4, \"enamorarte\": 10, \"obsesi\\u00f3n\": 2, \"conm\\u00edgo\": 4, \"enamorando\": 13, \"amas\": 9, \"coladito\": 2, \"m\\u00eds\": 4, \"quererme\": 2, \"enamores\": 1, \"sientas\": 1, \"enamoraras\": 1, \"quisieras\": 1, \"\\u00bfexiste\": 1, \"est\\u00e9s\": 3, \"obvio\": 5, \"obviamente\": 2, \"enamorarnos\": 2, \"\\u00bfser\\u00edas\": 1, \"\\u00bfpodr\\u00edamos\": 1, \"sentim\\u00edentos\": 3, \"rom\\u00e1nticos\": 1, \"almas\": 1, \"gemelas\": 1, \"media\": 9, \"naranja\": 7, \"amarme\": 4, \"locamente\": 2, \"locura\": 2, \"obsesionado\": 1, \"\\u00bfest\\u00e1\": 1, \"obsesionada\": 1, \"coladita\": 2, \"adoro\": 71, \"llevas\": 2, \"alma\": 8, \"gemela\": 3, \"querr\\u00e9\": 3, \"amo\": 73, \"enamore\": 1, \"vuelves\": 1, \"vuelvas\": 1, \"\\u00bfsabe\": 1, \"amar\\u00e9\": 3, \"apasionas\": 1, \"pasi\\u00f3n\": 1, \"seas\": 8, \"colado\": 1, \"hagamos\": 1, \"deber\\u00edamos\": 6, \"pedir\": 8, \"prometida\": 7, \"caserte\": 1, \"casarnos\": 7, \"prometido\": 7, 