{"class_name": "Tokenizer", "config": {"num_words": null, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": null, "document_count": 31714, "word_counts": "{\"\\u00bfcu\\u00e1l\": 219, \"es\": 231, \"la\": 2625, \"forma\": 162, \"de\": 11114, \"imprimir\": 203, \"en\": 15502, \"javascript\": 15872, \"sintaxis\": 149, \"correcta\": 4, \"para\": 6852, \"python\": 15827, \"funci\\u00f3n\": 1004, \"escribe\": 3350, \"un\": 6666, \"script\": 1065, \"\\u00bfc\\u00f3mo\": 659, \"se\": 335, \"mu\\u00e9strame\": 96, \"c\\u00f3mo\": 727, \"puedo\": 158, \"pantalla\": 53, \"\\u00bfpuedes\": 86, \"el\": 5171, \"c\\u00f3digo\": 4362, \"dame\": 167, \"b\\u00e1sica\": 180, \"con\": 2517, \"\\u00bfqu\\u00e9\": 16, \"necesito\": 10, \"m\\u00e1s\": 216, \"simple\": 1045, \"por\": 3730, \"favor\": 4, \"comando\": 8, \"ayudarme\": 4, \"a\": 8999, \"demuestra\": 311, \"b\\u00e1sico\": 333, \"escribir\": 165, \"usa\": 12, \"ejemplo\": 1804, \"hace\": 2, \"uso\": 190, \"proporciona\": 1207, \"explicar\\u00edas\": 2, \"usando\": 1115, \"f\\u00e1cil\": 44, \"darme\": 8, \"har\\u00edas\": 2, \"fragmento\": 471, \"escribes\": 20, \"programa\": 453, \"podr\\u00eda\": 2, \"mostrarme\": 16, \"una\": 3669, \"quiero\": 2, \"muestra\": 1177, \"usar\": 158, \"ayuda\": 2, \"da\": 65, \"escribo\": 30, \"genera\": 2713, \"declarar\": 1146, \"variables\": 510, \"no\": 84, \"declaradas\": 24, \"tipo\": 1026, \"boolean\": 345, \"anulables\": 24, \"flotante\": 171, \"valor\": 72, \"defecto\": 48, \"tipos\": 36, \"expl\\u00edcitos\": 24, \"doble\": 171, \"variable\": 528, \"sola\": 112, \"l\\u00ednea\": 88, \"directamente\": 24, \"expl\\u00edcitamente\": 24, \"temporales\": 24, \"caracter\": 171, \"comillas\": 24, \"simples\": 42, \"valores\": 44, \"interpolados\": 24, \"globales\": 24, \"entero\": 171, \"modo\": 12, \"estricto\": 12, \"string\": 358, \"limpia\": 33, \"y\": 558, \"sencilla\": 131, \"general\": 48, \"var\": 12, \"depuraci\\u00f3n\": 24, \"inicial\": 48, \"siguiendo\": 72, \"convenciones\": 24, \"nombres\": 24, \"nombre\": 48, \"descriptivo\": 24, \"solo\": 24, \"lectura\": 12, \"inferidos\": 12, \"temporal\": 24, \"nuevo\": 24, \"\\u00e1mbito\": 24, \"buenas\": 48, \"pr\\u00e1cticas\": 48, \"privada\": 24, \"din\\u00e1mica\": 53, \"est\\u00e1ticas\": 12, \"como\": 105, \"mutables\": 12, \"din\\u00e1micamente\": 43, \"dobles\": 272, \"p\\u00fablica\": 24, \"template\": 32, \"literals\": 12, \"modificables\": 12, \"locales\": 24, \"manera\": 80, \"min\\u00fasculas\": 24, \"corto\": 70, \"let\": 6, \"vol\\u00e1tiles\": 12, \"su\": 60, \"constante\": 510, \"crear\": 391, \"arreglo\": 1300, \"dimensi\\u00f3n\": 650, \"caracteres\": 260, \"enteros\": 260, \"generar\": 140, \"flotantes\": 260, \"inicializar\": 100, \"e\": 40, \"inicializarlo\": 20, \"poblar\": 60, \"modificar\": 20, \"strings\": 563, \"paso\": 170, \"define\": 200, \"incluye\": 20, \"definir\": 160, \"vac\\u00edo\": 20, \"crea\": 1395, \"recorrer\": 20, \"que\": 1494, \"contenga\": 73, \"llenar\": 20, \"mu\\u00e9stralo\": 20, \"mostrar\": 56, \"correcto\": 20, \"inicializa\": 20, \"implementaci\\u00f3n\": 908, \"devuelva\": 20, \"acceder\": 20, \"los\": 5554, \"elementos\": 44, \"genere\": 20, \"explica\": 449, \"dos\": 650, \"dimensiones\": 650, \"bucle\": 896, \"for\": 5839, \"do\": 1505, \"while\": 612, \"implementar\": 398, \"m\\u00ednimo\": 215, \"ve\": 25, \"escrito\": 59, \"r\\u00e1pido\": 63, \"estructura\": 304, \"sencillo\": 44, \"codifica\": 327, \"limpio\": 12, \"entender\": 18, \"haz\": 41, \"hacer\": 24, \"hago\": 6, \"construir\": 32, \"codificar\": 38, \"programo\": 14, \"muestre\": 45, \"peque\\u00f1o\": 89, \"creo\": 6, \"haces\": 6, \"implemento\": 6, \"r\\u00e1pida\": 6, \"claro\": 6, \"if\": 3342, \"igual\": 585, \"o\": 390, \"mayor\": 388, \"else\": 2020, \"menor\": 392, \"plantilla\": 20, \"sentencia\": 436, \"redacta\": 546, \"manejar\": 265, \"implementa\": 194, \"bloque\": 451, \"demostrando\": 53, \"demuestre\": 110, \"incluya\": 124, \"demostrar\": 171, \"ilustra\": 445, \"demostraci\\u00f3n\": 94, \"use\": 356, \"funciona\": 46, \"funcional\": 76, \"condicional\": 172, \"ternaria\": 172, \"switch\": 348, \"utilidades\": 50, \"calcular\": 65, \"algoritmo\": 8231, \"busqueda\": 4764, \"lineal\": 784, \"eficiente\": 30, \"construye\": 365, \"funcionalidad\": 58, \"saltos\": 820, \"fibonacci\": 1574, \"utilizando\": 69, \"recursi\\u00f3n\": 20, \"interpolaci\\u00f3n\": 792, \"binaria\": 823, \"quick\": 1273, \"sort\": 6119, \"ordenamiento\": 2971, \"burbuja\": 892, \"esboza\": 282, \"m\\u00e9todo\": 645, \"basado\": 34, \"resolver\": 269, \"mezcla\": 873, \"heap\": 1852, \"caracter\\u00edsticas\": 27, \"typescript\": 31, \"dise\\u00f1a\": 121, \"l\\u00f3gica\": 1133, \"aplicar\": 27, \"arreglos\": 14, \"aplicaci\\u00f3n\": 12, \"scripts\": 40, \"dise\\u00f1ados\": 6, \"del\": 5196, \"ejemplos\": 93, \"probar\": 32, \"entradas\": 12, \"programas\": 32, \"validar\": 11, \"librer\\u00eda\": 31, \"est\\u00e1ndar\": 14, \"memoizaci\\u00f3n\": 25, \"ejecutar\": 108, \"aplicaciones\": 26, \"nivel\": 11, \"principiante\": 5, \"inserci\\u00f3n\": 277, \"casos\": 49, \"exponencial\": 781, \"manejo\": 13, \"datos\": 87, \"json\": 19, \"enfoques\": 15, \"problema\": 63, \"alternativas\": 8, \"lograr\": 39, \"rutina\": 22, \"desarrolla\": 363, \"procesamiento\": 12, \"tiempo\": 5, \"real\": 14, \"estrategia\": 8, \"divide\": 30, \"vencer\\u00e1s\": 14, \"problemas\": 52, \"peque\\u00f1a\": 22, \"escala\": 7, \"optimizada\": 14, \"selecci\\u00f3n\": 916, \"tareas\": 30, \"manipulaci\\u00f3n\": 23, \"dom\": 19, \"orientadas\": 11, \"eventos\": 11, \"hilos\": 10, \"enfoque\": 77, \"calcule\": 10, \"archivo\": 21, \"soluci\\u00f3n\": 166, \"camino\": 12, \"clara\": 21, \"concisa\": 91, \"m\\u00e9todos\": 95, \"implementaciones\": 21, \"ligeras\": 9, \"software\": 15, \"clase\": 39, \"fundamental\": 40, \"clases\": 11, \"ordenar\": 10, \"grandes\": 28, \"vol\\u00famenes\": 28, \"operaciones\": 37, \"event\": 33, \"listeners\": 23, \"grafos\": 31, \"las\": 41, \"principales\": 54, \"decoradores\": 20, \"cadenas\": 13, \"optimizar\": 9, \"enfocada\": 17, \"desplegar\": 10, \"optimizaci\\u00f3n\": 14, \"recursivo\": 16, \"metodolog\\u00eda\": 7, \"bucles\": 5, \"b\\u00e1sicos\": 48, \"versi\\u00f3n\": 103, \"pasos\": 39, \"realizar\": 60, \"componentes\": 46, \"modularizar\": 15, \"detallada\": 7, \"centradas\": 3, \"amigable\": 7, \"principiantes\": 15, \"implementar\\u00edas\": 5, \"m\\u00f3dulos\": 63, \"es6\": 53, \"fundamentales\": 12, \"plantillas\": 16, \"escenarios\": 23, \"pr\\u00e1cticos\": 7, \"bloques\": 10, \"resuelvan\": 10, \"estructuras\": 19, \"instrucciones\": 22, \"tarea\": 44, \"promesas\": 18, \"optimizaciones\": 20, \"rendimiento\": 11, \"funciones\": 124, \"m\\u00ednima\": 85, \"complejidad\": 17, \"iterativa\": 25, \"enfocadas\": 15, \"adaptar\": 8, \"extremos\": 8, \"m\\u00f3dulo\": 21, \"b\\u00e1sicas\": 36, \"voraz\": 13, \"soluciones\": 50, \"basadas\": 22, \"paralelo\": 7, \"iniciales\": 4, \"iteraciones\": 21, \"apoyo\": 8, \"pr\\u00e1ctica\": 2, \"rutinas\": 17, \"claridad\": 24, \"lenguaje\": 6, \"soportar\": 11, \"contextos\": 23, \"navegador\": 11, \"b\\u00fasqueda\": 24, \"produce\": 71, \"basada\": 23, \"refinar\": 16, \"resuelva\": 13, \"proyectos\": 37, \"desaf\\u00edo\": 11, \"sin\": 685, \"dependencias\": 20, \"implemente\": 67, \"externas\": 22, \"\\u00bfes\": 8, \"posible\": 8, \"sistemas\": 7, \"distribuidos\": 7, \"encapsular\": 22, \"sencillos\": 4, \"enfoc\\u00e1ndote\": 22, \"acciones\": 6, \"herramientas\": 8, \"asincr\\u00f3nicas\": 11, \"elementales\": 12, \"comentarios\": 7, \"asincr\\u00f3nico\": 5, \"comparte\": 15, \"proceso\": 23, \"educativos\": 18, \"simplicidad\": 20, \"pyspark\": 34, \"adaptadas\": 8, \"ay\\u00fadame\": 10, \"programar\": 21, \"eficiencia\": 12, \"librer\\u00edas\": 21, \"adicionales\": 5, \"interfaz\": 10, \"usuario\": 6, \"marco\": 6, \"respuestas\": 7, \"numpy\": 14, \"procesos\": 7, \"abordar\": 4, \"programaci\\u00f3n\": 17, \"interactiva\": 8, \"incorporar\": 8, \"objeto\": 17, \"simplificar\": 9, \"caminos\": 7, \"cortos\": 7, \"fragmentos\": 106, \"integrar\": 15, \"legibilidad\": 8, \"pandas\": 37, \"completar\": 14, \"automatizar\": 10, \"pipelines\": 21, \"procedimientos\": 9, \"manejen\": 11, \"aplicado\": 18, \"apis\": 19, \"fines\": 6, \"ilustrar\": 13, \"m\\u00ednimas\": 16, \"peque\\u00f1as\": 6, \"entrada\": 7, \"m\\u00ednimos\": 16, \"\\u00bfpodr\\u00edas\": 12, \"avanzadas\": 9, \"formato\": 9, \"caso\": 6, \"c\\u00e1lculo\": 5, \"avanzados\": 5, \"calculen\": 6, \"resultados\": 6, \"recorridos\": 9, \"concurrencia\": 10, \"ligeros\": 8, \"gr\\u00e1fica\": 4, \"resoluci\\u00f3n\": 11, \"recursiva\": 11, \"manejador\": 7, \"plan\": 14, \"introductorios\": 9, \"objetivo\": 7, \"coloreado\": 10, \"multithreading\": 9, \"elemental\": 5, \"conceptos\": 16, \"entornos\": 8, \"controlados\": 8, \"validaci\\u00f3n\": 9, \"escenario\": 6, \"num\\u00e9ricas\": 7, \"ejecute\": 5, \"desglosar\": 5, \"explorar\": 9, \"dise\\u00f1o\": 9, \"\\u00fanicamente\": 7, \"llevar\": 6, \"cabo\": 6, \"flujos\": 6, \"trabajo\": 6, \"mejor\": 7, \"marcos\": 6, \"resuelve\": 6, \"detallado\": 9, \"al\": 10, \"modelos\": 10, \"ia\": 10, \"coincidencia\": 6, \"patrones\": 6, \"aborden\": 14, \"ense\\u00f1ar\": 5, \"proyecto\": 8, \"peque\\u00f1os\": 12, \"conjuntos\": 12, \"navegadores\": 4, \"depurar\": 8, \"recorrido\": 6, \"secuencia\": 33, \"recursivamente\": 5, \"gestionar\": 6, \"explicar\": 4, \"muestren\": 6, \"ejecuci\\u00f3n\": 6, \"frameworks\": 22, \"archivos\": 2, \"implementen\": 2, \"ejercicios\": 4, \"manejadores\": 6, \"requisitos\": 8, \"demuestren\": 6, \"backtracking\": 11, \"esenciales\": 39, \"integraci\\u00f3n\": 4, \"ifs\": 5840, \"loops\": 6399, \"lista\": 221, \"todos\": 128, \"extra\\u00eddos\": 168, \"extrae\": 470, \"utilizados\": 175, \"implementan\": 71, \"resalta\": 241, \"todas\": 34, \"ocurrencias\": 34, \"representar\": 74, \"\\u00bfcu\\u00e1les\": 29, \"son\": 54, \"borrador\": 43, \"extraer\": 114, \"expl\\u00edcame\": 30, \"dibuja\": 34, \"desglose\": 25, \"mostrando\": 120, \"usados\": 23, \"ejemplifique\": 26, \"esquematiza\": 49, \"ilustre\": 56, \"resalte\": 24, \"parte\": 100, \"secci\\u00f3n\": 380, \"principal\": 79, \"utilizan\": 23, \"necesaria\": 28, \"l\\u00f3gico\": 81, \"conciso\": 74, \"necesario\": 25, \"representaci\\u00f3n\": 27, \"esquema\": 26, \"funcionan\": 63, \"flujo\": 79, \"clave\": 25, \"dentro\": 29, \"escr\\u00edbelos\": 25, \"escriben\": 20, \"represente\": 26, \"ilustraci\\u00f3n\": 31, \"detalla\": 55, \"ilustrativo\": 50, \"describe\": 52, \"necesarios\": 27, \"presentes\": 29, \"par\\u00e1metros\": 1217, \"puedes\": 8, \"javascriptescribe\": 4, \"prueba\": 23, \"pr\\u00e1ctico\": 15, \"presenta\": 31, \"puede\": 8, \"codificas\": 7, \"crear\\u00edas\": 5, \"borra\": 8, \"write\": 3665, \"to\": 4322, \"print\": 252, \"in\": 12187, \"show\": 1378, \"me\": 368, \"how\": 1442, \"i\": 323, \"need\": 10, \"the\": 17291, \"code\": 5016, \"on\": 175, \"screen\": 56, \"program\": 407, \"can\": 254, \"you\": 231, \"an\": 1382, \"example\": 1937, \"of\": 6126, \"give\": 268, \"what\": 233, \"is\": 348, \"provide\": 1296, \"easiest\": 22, \"with\": 2406, \"using\": 1442, \"demonstrate\": 532, \"way\": 107, \"help\": 24, \"what\\u2019s\": 86, \"please\": 4, \"explain\": 473, \"needed\": 2, \"command\": 8, \"simplest\": 132, \"function\": 1002, \"would\": 19, \"basic\": 602, \"syntax\": 179, \"correct\": 24, \"proper\": 26, \"right\": 2, \"used\": 285, \"snippet\": 510, \"want\": 2, \"scrren\": 2, \"generates\": 1084, \"declare\": 1204, \"type\": 1044, \"specific\": 24, \"value\": 144, \"single\": 136, \"float\": 477, \"double\": 174, \"default\": 72, \"line\": 87, \"and\": 580, \"initialize\": 103, \"it\": 94, \"explicitly\": 24, \"public\": 24, \"char\": 174, \"initial\": 50, \"explicit\": 36, \"types\": 48, \"integer\": 174, \"following\": 24, \"best\": 54, \"practices\": 48, \"lowercase\": 24, \"directly\": 24, \"private\": 24, \"strict\": 12, \"mode\": 12, \"clean\": 48, \"temporary\": 48, \"local\": 24, \"dynamically\": 65, \"statement\": 442, \"naming\": 24, \"conventions\": 24, \"debug\": 34, \"non\": 12, \"modifiable\": 12, \"assigned\": 24, \"global\": 24, \"nullable\": 24, \"short\": 64, \"name\": 48, \"interpolated\": 24, \"values\": 44, \"its\": 45, \"form\": 45, \"new\": 24, \"scope\": 24, \"descriptive\": 24, \"volatile\": 12, \"readonly\": 12, \"static\": 12, \"inferred\": 12, \"undeclared\": 24, \"as\": 73, \"mutable\": 12, \"constants\": 258, \"const\": 264, \"populate\": 60, \"one\": 735, \"dimensional\": 1475, \"array\": 1514, \"chars\": 304, \"accessing\": 20, \"elements\": 47, \"integers\": 302, \"generate\": 1868, \"creating\": 100, \"doubles\": 302, \"implementation\": 936, \"that\": 380, \"create\": 1764, \"generating\": 40, \"return\": 20, \"defining\": 40, \"loop\": 947, \"through\": 20, \"step\": 140, \"by\": 70, \"initializing\": 59, \"display\": 34, \"dimension\": 39, \"containing\": 101, \"include\": 20, \"fill\": 20, \"modify\": 20, \"empty\": 20, \"two\": 758, \"most\": 32, \"implement\": 522, \"structure\": 285, \"out\": 9, \"does\": 20, \"look\": 38, \"like\": 20, \"showing\": 65, \"make\": 73, \"minimal\": 327, \"beginner\": 37, \"friendly\": 18, \"small\": 130, \"down\": 11, \"written\": 167, \"easy\": 14, \"clear\": 23, \"looks\": 6, \"build\": 390, \"equals\": 387, \"or\": 387, \"greater\": 387, \"than\": 779, \"equal\": 196, \"less\": 392, \"sample\": 188, \"draft\": 883, \"handle\": 213, \"block\": 435, \"demonstrating\": 152, \"includes\": 121, \"coding\": 20, \"uses\": 32, \"illustrate\": 478, \"demonstration\": 94, \"works\": 99, \"working\": 65, \"ternary\": 176, \"conditional\": 176, \"without\": 683, \"parameters\": 1255, \"method\": 682, \"coded\": 24, \"construct\": 36, \"develop\": 358, \"test\": 49, \"functional\": 24, \"present\": 61, \"javascriptwrite\": 3, \"implemented\": 65, \"practical\": 20, \"be\": 8, \"usage\": 39, \"linear\": 815, \"search\": 4949, \"algorithm\": 8523, \"promises\": 16, \"jump\": 848, \"operations\": 38, \"interpolation\": 810, \"goal\": 6, \"binary\": 841, \"performance\": 8, \"optimizations\": 16, \"apply\": 18, \"bubble\": 926, \"data\": 56, \"merge\": 940, \"decorators\": 17, \"solving\": 163, \"external\": 20, \"dependencies\": 23, \"based\": 101, \"implementations\": 22, \"readability\": 7, \"mind\": 7, \"steps\": 46, \"logic\": 1248, \"instructions\": 17, \"task\": 27, \"snippets\": 108, \"integrating\": 10, \"into\": 10, \"async\": 16, \"functions\": 122, \"solve\": 123, \"straightforward\": 18, \"utilities\": 43, \"cases\": 48, \"compute\": 42, \"insertion\": 269, \"exponential\": 817, \"solutions\": 57, \"execute\": 84, \"implementing\": 79, \"components\": 42, \"modularize\": 17, \"library\": 29, \"focused\": 21, \"manipulation\": 22, \"tasks\": 37, \"handling\": 83, \"elementary\": 15, \"methods\": 97, \"files\": 5, \"selection\": 928, \"focusing\": 27, \"clarity\": 31, \"simplicity\": 20, \"design\": 117, \"adapt\": 9, \"edge\": 9, \"foundational\": 34, \"basics\": 10, \"centered\": 10, \"beginners\": 7, \"optimized\": 14, \"problem\": 76, \"sorting\": 24, \"large\": 25, \"datasets\": 46, \"exercises\": 9, \"class\": 42, \"encapsulate\": 25, \"standard\": 14, \"libraries\": 17, \"object\": 17, \"streamline\": 9, \"process\": 24, \"ai\": 8, \"models\": 8, \"recursion\": 18, \"projects\": 32, \"applied\": 10, \"greedy\": 14, \"approach\": 49, \"only\": 23, \"classes\": 18, \"solution\": 171, \"calculate\": 18, \"results\": 6, \"distributed\": 8, \"systems\": 8, \"optimization\": 16, \"level\": 4, \"applications\": 26, \"scenarios\": 20, \"teaching\": 2, \"advanced\": 15, \"what's\": 14, \"efficient\": 17, \"memoization\": 24, \"recursive\": 30, \"version\": 98, \"conquer\": 16, \"share\": 13, \"automate\": 11, \"achieve\": 36, \"parallel\": 6, \"processing\": 15, \"perform\": 47, \"procedures\": 8, \"dynamic\": 17, \"programming\": 17, \"templates\": 13, \"graph\": 33, \"traversal\": 16, \"iteratively\": 19, \"user\": 6, \"interface\": 15, \"routines\": 22, \"modules\": 52, \"support\": 15, \"lightweight\": 12, \"iterative\": 7, \"multi\": 7, \"threading\": 16, \"application\": 15, \"featuring\": 8, \"could\": 20, \"sequence\": 42, \"showcasing\": 119, \"features\": 23, \"workflows\": 5, \"complete\": 9, \"involving\": 18, \"actions\": 9, \"achieving\": 16, \"practice\": 8, \"routine\": 20, \"solves\": 10, \"core\": 20, \"functionality\": 54, \"examples\": 115, \"detailed\": 15, \"seamlessly\": 14, \"blocks\": 8, \"iteration\": 6, \"challenge\": 9, \"alternatives\": 9, \"module\": 24, \"methodology\": 8, \"programs\": 30, \"validate\": 10, \"concise\": 179, \"input\": 16, \"iterations\": 22, \"addressing\": 9, \"requirements\": 6, \"python's\": 6, \"answers\": 10, \"manage\": 8, \"execution\": 6, \"plain\": 8, \"strategy\": 9, \"pattern\": 9, \"matching\": 9, \"performing\": 11, \"comments\": 9, \"time\": 9, \"focus\": 24, \"efficiency\": 9, \"executing\": 8, \"file\": 21, \"optimize\": 9, \"computing\": 5, \"efficiently\": 5, \"gui\": 9, \"essentials\": 7, \"deploying\": 7, \"complexity\": 13, \"stepwise\": 14, \"browser\": 10, \"contexts\": 18, \"integrate\": 7, \"numerical\": 11, \"designed\": 6, \"arrays\": 16, \"python\\u2019s\": 9, \"scale\": 8, \"problems\": 19, \"tailored\": 7, \"educational\": 15, \"purposes\": 7, \"computes\": 7, \"approaches\": 14, \"issue\": 7, \"tools\": 6, \"processes\": 14, \"concurrency\": 8, \"validation\": 9, \"project\": 4, \"language\": 8, \"implements\": 60, \"refine\": 18, \"carry\": 3, \"handlers\": 6, \"inputs\": 8, \"shortest\": 17, \"path\": 17, \"resolving\": 8, \"possible\": 6, \"driven\": 10, \"handler\": 7, \"any\": 6, \"structures\": 17, \"testing\": 9, \"controlled\": 9, \"setups\": 9, \"executes\": 6, \"coloring\": 11, \"run\": 7, \"computation\": 8, \"address\": 6, \"illustrating\": 69, \"applying\": 8, \"additional\": 4, \"format\": 8, \"understand\": 9, \"exploring\": 7, \"integration\": 5, \"break\": 6, \"framework\": 7, \"case\": 4, \"interactively\": 5, \"browsers\": 6, \"scenario\": 4, \"running\": 5, \"embedding\": 6, \"introductory\": 5, \"from\": 1527, \"section\": 353, \"extract\": 607, \"all\": 171, \"occurrences\": 34, \"operates\": 26, \"within\": 56, \"extracted\": 180, \"required\": 27, \"list\": 240, \"represent\": 75, \"breakdown\": 49, \"extracts\": 30, \"highlight\": 187, \"main\": 134, \"outline\": 76, \"flow\": 71, \"essential\": 28, \"highlights\": 29, \"detail\": 48, \"inside\": 26, \"illustrative\": 52, \"part\": 100, \"necessary\": 50, \"representing\": 28, \"representation\": 24, \"illustration\": 29, \"extracting\": 27, \"key\": 29, \"are\": 52, \"demonstrates\": 28, \"showcase\": 27}", "word_docs": "{\"javascript\": 15872, \"imprimir\": 201, \"es\": 231, \"de\": 8877, \"forma\": 162, \"en\": 14523, \"\\u00bfcu\\u00e1l\": 219, \"la\": 2619, \"python\": 15827, \"sintaxis\": 149, \"correcta\": 4, \"para\": 6722, \"funci\\u00f3n\": 998, \"script\": 1065, \"escribe\": 3350, \"un\": 5810, \"\\u00bfc\\u00f3mo\": 659, \"se\": 335, \"mu\\u00e9strame\": 96, \"c\\u00f3mo\": 727, \"pantalla\": 53, \"puedo\": 158, \"\\u00bfpuedes\": 86, \"el\": 4947, \"c\\u00f3digo\": 4362, \"dame\": 167, \"b\\u00e1sica\": 180, \"con\": 2441, \"\\u00bfqu\\u00e9\": 16, \"necesito\": 10, \"m\\u00e1s\": 216, \"simple\": 1045, \"favor\": 4, \"por\": 3730, \"comando\": 8, \"a\": 7900, \"ayudarme\": 4, \"demuestra\": 311, \"b\\u00e1sico\": 333, \"escribir\": 165, \"usa\": 12, \"ejemplo\": 1804, \"hace\": 2, \"uso\": 190, \"proporciona\": 1207, \"explicar\\u00edas\": 2, \"usando\": 1115, \"f\\u00e1cil\": 44, \"darme\": 8, \"har\\u00edas\": 2, \"fragmento\": 471, \"escribes\": 20, \"programa\": 445, \"podr\\u00eda\": 2, \"mostrarme\": 16, \"una\": 3577, \"quiero\": 2, \"muestra\": 1177, \"usar\": 158, \"ayuda\": 2, \"da\": 65, \"escribo\": 30, \"no\": 84, \"boolean\": 345, \"declarar\": 1146, \"declaradas\": 24, \"genera\": 2713, \"tipo\": 1026, \"variables\": 510, \"flotante\": 171, \"anulables\": 24, \"defecto\": 48, \"valor\": 72, \"tipos\": 36, \"expl\\u00edcitos\": 24, \"doble\": 171, \"l\\u00ednea\": 88, \"sola\": 112, \"variable\": 528, \"directamente\": 24, \"expl\\u00edcitamente\": 24, \"temporales\": 24, \"caracter\": 171, \"simples\": 42, \"comillas\": 24, \"interpolados\": 24, \"valores\": 44, \"globales\": 24, \"entero\": 171, \"estricto\": 12, \"modo\": 12, \"string\": 358, \"y\": 558, \"sencilla\": 131, \"limpia\": 33, \"general\": 48, \"var\": 12, \"depuraci\\u00f3n\": 24, \"inicial\": 48, \"nombres\": 24, \"convenciones\": 24, \"siguiendo\": 72, \"descriptivo\": 24, \"nombre\": 48, \"solo\": 24, \"lectura\": 12, \"inferidos\": 12, \"temporal\": 24, \"nuevo\": 24, \"\\u00e1mbito\": 24, \"buenas\": 48, \"pr\\u00e1cticas\": 48, \"privada\": 24, \"din\\u00e1mica\": 53, \"est\\u00e1ticas\": 12, \"como\": 105, \"mutables\": 12, \"din\\u00e1micamente\": 43, \"dobles\": 272, \"p\\u00fablica\": 24, \"literals\": 12, \"template\": 32, \"modificables\": 12, \"locales\": 24, \"manera\": 80, \"min\\u00fasculas\": 24, \"corto\": 70, \"let\": 6, \"vol\\u00e1tiles\": 12, \"su\": 60, \"constante\": 510, \"crear\": 391, \"dimensi\\u00f3n\": 650, \"caracteres\": 260, \"arreglo\": 1300, \"enteros\": 260, \"flotantes\": 260, \"generar\": 140, \"inicializar\": 100, \"e\": 40, \"inicializarlo\": 20, \"poblar\": 60, \"modificar\": 20, \"strings\": 563, \"paso\": 85, \"incluye\": 20, \"define\": 200, \"definir\": 160, \"vac\\u00edo\": 20, \"crea\": 1395, \"recorrer\": 20, \"contenga\": 73, \"que\": 1462, \"llenar\": 20, \"mu\\u00e9stralo\": 20, \"mostrar\": 56, \"correcto\": 20, \"inicializa\": 20, \"implementaci\\u00f3n\": 908, \"devuelva\": 20, \"elementos\": 44, \"los\": 5499, \"acceder\": 20, \"genere\": 20, \"explica\": 449, \"dimensiones\": 650, \"dos\": 650, \"bucle\": 896, \"for\": 5742, \"while\": 612, \"do\": 1458, \"implementar\": 398, \"m\\u00ednimo\": 215, \"ve\": 25, \"escrito\": 59, \"r\\u00e1pido\": 63, \"estructura\": 304, \"sencillo\": 44, \"codifica\": 327, \"limpio\": 12, \"entender\": 18, \"haz\": 41, \"hacer\": 24, \"hago\": 6, \"construir\": 32, \"codificar\": 38, \"programo\": 14, \"muestre\": 45, \"peque\\u00f1o\": 89, \"creo\": 6, \"haces\": 6, \"implemento\": 6, \"r\\u00e1pida\": 6, \"claro\": 6, \"igual\": 585, \"o\": 390, \"if\": 2646, \"mayor\": 388, \"else\": 1672, \"menor\": 392, \"sentencia\": 436, \"plantilla\": 20, \"redacta\": 546, \"manejar\": 265, \"implementa\": 194, \"bloque\": 451, \"demostrando\": 53, \"demuestre\": 110, \"incluya\": 124, \"demostrar\": 171, \"ilustra\": 445, \"demostraci\\u00f3n\": 94, \"use\": 356, \"funciona\": 46, \"funcional\": 76, \"ternaria\": 172, \"condicional\": 172, \"switch\": 348, \"lineal\": 784, \"utilidades\": 50, \"algoritmo\": 8231, \"calcular\": 65, \"busqueda\": 4764, \"eficiente\": 30, \"saltos\": 820, \"funcionalidad\": 58, \"construye\": 365, \"recursi\\u00f3n\": 20, \"fibonacci\": 1574, \"utilizando\": 69, \"interpolaci\\u00f3n\": 792, \"binaria\": 823, \"quick\": 1273, \"sort\": 6119, \"ordenamiento\": 2967, \"burbuja\": 892, \"esboza\": 282, \"mezcla\": 873, \"basado\": 34, \"m\\u00e9todo\": 643, \"resolver\": 269, \"heap\": 1852, \"typescript\": 31, \"caracter\\u00edsticas\": 27, \"dise\\u00f1a\": 121, \"l\\u00f3gica\": 1133, \"arreglos\": 14, \"aplicar\": 27, \"aplicaci\\u00f3n\": 12, \"del\": 5196, \"dise\\u00f1ados\": 6, \"scripts\": 40, \"ejemplos\": 93, \"probar\": 32, \"entradas\": 12, \"programas\": 32, \"validar\": 11, \"est\\u00e1ndar\": 14, \"librer\\u00eda\": 31, \"memoizaci\\u00f3n\": 25, \"ejecutar\": 108, \"aplicaciones\": 26, \"nivel\": 11, \"principiante\": 5, \"inserci\\u00f3n\": 277, \"casos\": 49, \"exponencial\": 781, \"datos\": 87, \"manejo\": 13, \"json\": 19, \"enfoques\": 15, \"problema\": 63, \"lograr\": 39, \"alternativas\": 8, \"rutina\": 22, \"real\": 14, \"tiempo\": 5, \"desarrolla\": 363, \"procesamiento\": 12, \"estrategia\": 8, \"vencer\\u00e1s\": 14, \"divide\": 30, \"peque\\u00f1a\": 22, \"problemas\": 52, \"escala\": 7, \"optimizada\": 14, \"manipulaci\\u00f3n\": 23, \"tareas\": 30, \"dom\": 19, \"selecci\\u00f3n\": 916, \"orientadas\": 11, \"eventos\": 11, \"hilos\": 10, \"enfoque\": 77, \"calcule\": 10, \"archivo\": 21, \"soluci\\u00f3n\": 166, \"camino\": 12, \"clara\": 21, \"concisa\": 91, \"m\\u00e9todos\": 95, \"ligeras\": 9, \"implementaciones\": 21, \"software\": 15, \"clase\": 39, \"fundamental\": 40, \"clases\": 11, \"vol\\u00famenes\": 28, \"ordenar\": 10, \"grandes\": 28, \"operaciones\": 37, \"listeners\": 23, \"event\": 33, \"grafos\": 31, \"principales\": 54, \"las\": 41, \"decoradores\": 20, \"cadenas\": 13, \"optimizar\": 9, \"desplegar\": 10, \"enfocada\": 17, \"optimizaci\\u00f3n\": 14, \"recursivo\": 16, \"metodolog\\u00eda\": 7, \"b\\u00e1sicos\": 48, \"bucles\": 5, \"versi\\u00f3n\": 103, \"realizar\": 60, \"pasos\": 39, \"modularizar\": 15, \"componentes\": 46, \"detallada\": 7, \"centradas\": 3, \"principiantes\": 15, \"amigable\": 7, \"implementar\\u00edas\": 5, \"m\\u00f3dulos\": 63, \"es6\": 53, \"fundamentales\": 12, \"plantillas\": 16, \"escenarios\": 23, \"pr\\u00e1cticos\": 7, \"bloques\": 10, \"resuelvan\": 10, \"estructuras\": 19, \"tarea\": 44, \"instrucciones\": 22, \"promesas\": 18, \"optimizaciones\": 20, \"rendimiento\": 11, \"funciones\": 124, \"m\\u00ednima\": 85, \"complejidad\": 17, \"iterativa\": 25, \"enfocadas\": 15, \"extremos\": 8, \"adaptar\": 8, \"b\\u00e1sicas\": 36, \"m\\u00f3dulo\": 21, \"voraz\": 13, \"basadas\": 22, \"soluciones\": 50, \"paralelo\": 7, \"iniciales\": 4, \"iteraciones\": 21, \"apoyo\": 8, \"pr\\u00e1ctica\": 2, \"rutinas\": 17, \"claridad\": 24, \"lenguaje\": 6, \"soportar\": 11, \"contextos\": 23, \"navegador\": 11, \"b\\u00fasqueda\": 24, \"produce\": 71, \"basada\": 23, \"refinar\": 16, \"resuelva\": 13, \"proyectos\": 37, \"desaf\\u00edo\": 11, \"dependencias\": 20, \"sin\": 683, \"implemente\": 67, \"externas\": 22, \"posible\": 8, \"\\u00bfes\": 8, \"distribuidos\": 7, \"sistemas\": 7, \"sencillos\": 4, \"encapsular\": 22, \"enfoc\\u00e1ndote\": 22, \"acciones\": 6, \"herramientas\": 8, \"asincr\\u00f3nicas\": 11, \"elementales\": 12, \"comentarios\": 7, \"asincr\\u00f3nico\": 5, \"comparte\": 15, \"proceso\": 23, \"educativos\": 18, \"simplicidad\": 20, \"pyspark\": 34, \"adaptadas\": 8, \"ay\\u00fadame\": 10, \"programar\": 21, \"eficiencia\": 12, \"librer\\u00edas\": 21, \"adicionales\": 5, \"usuario\": 6, \"interfaz\": 10, \"marco\": 6, \"respuestas\": 7, \"numpy\": 14, \"procesos\": 7, \"abordar\": 4, \"programaci\\u00f3n\": 17, \"interactiva\": 8, \"incorporar\": 8, \"simplificar\": 9, \"objeto\": 17, \"cortos\": 7, \"caminos\": 7, \"fragmentos\": 106, \"integrar\": 15, \"legibilidad\": 8, \"pandas\": 37, \"completar\": 14, \"automatizar\": 10, \"pipelines\": 21, \"procedimientos\": 9, \"manejen\": 11, \"aplicado\": 18, \"apis\": 19, \"fines\": 6, \"ilustrar\": 13, \"m\\u00ednimas\": 16, \"peque\\u00f1as\": 6, \"m\\u00ednimos\": 16, \"entrada\": 7, \"\\u00bfpodr\\u00edas\": 12, \"avanzadas\": 9, \"formato\": 9, \"caso\": 6, \"c\\u00e1lculo\": 5, \"avanzados\": 5, \"calculen\": 6, \"resultados\": 6, \"recorridos\": 9, \"concurrencia\": 10, \"ligeros\": 8, \"gr\\u00e1fica\": 4, \"recursiva\": 11, \"resoluci\\u00f3n\": 11, \"manejador\": 7, \"plan\": 14, \"introductorios\": 9, \"objetivo\": 7, \"coloreado\": 10, \"multithreading\": 9, \"elemental\": 5, \"conceptos\": 16, \"controlados\": 8, \"entornos\": 8, \"validaci\\u00f3n\": 9, \"escenario\": 6, \"num\\u00e9ricas\": 7, \"ejecute\": 5, \"desglosar\": 5, \"explorar\": 9, \"dise\\u00f1o\": 9, \"\\u00fanicamente\": 7, \"cabo\": 6, \"llevar\": 6, \"trabajo\": 6, \"flujos\": 6, \"mejor\": 7, \"marcos\": 6, \"resuelve\": 6, \"detallado\": 9, \"al\": 10, \"ia\": 10, \"modelos\": 10, \"coincidencia\": 6, \"patrones\": 6, \"aborden\": 14, \"ense\\u00f1ar\": 5, \"proyecto\": 8, \"peque\\u00f1os\": 12, \"conjuntos\": 12, \"navegadores\": 4, \"depurar\": 8, \"recorrido\": 6, \"secuencia\": 33, \"recursivamente\": 5, \"gestionar\": 6, \"explicar\": 4, \"ejecuci\\u00f3n\": 6, \"muestren\": 6, \"frameworks\": 22, \"implementen\": 2, \"archivos\": 2, \"ejercicios\": 4, \"manejadores\": 6, \"requisitos\": 8, \"demuestren\": 6, \"backtracking\": 11, \"esenciales\": 39, \"integraci\\u00f3n\": 4, \"ifs\": 5840, \"loops\": 6399, \"extra\\u00eddos\": 168, \"todos\": 128, \"lista\": 221, \"extrae\": 470, \"utilizados\": 175, \"implementan\": 71, \"resalta\": 241, \"todas\": 34, \"ocurrencias\": 34, \"representar\": 74, \"\\u00bfcu\\u00e1les\": 29, \"son\": 54, \"borrador\": 43, \"extraer\": 114, \"expl\\u00edcame\": 30, \"dibuja\": 34, \"desglose\": 25, \"mostrando\": 120, \"usados\": 23, \"ejemplifique\": 26, \"esquematiza\": 49, \"ilustre\": 56, \"resalte\": 24, \"parte\": 100, \"secci\\u00f3n\": 380, \"principal\": 79, \"utilizan\": 23, \"necesaria\": 28, \"l\\u00f3gico\": 81, \"conciso\": 74, \"necesario\": 25, \"representaci\\u00f3n\": 27, \"esquema\": 26, \"funcionan\": 63, \"flujo\": 79, \"clave\": 25, \"dentro\": 29, \"escr\\u00edbelos\": 25, \"escriben\": 20, \"represente\": 26, \"ilustraci\\u00f3n\": 31, \"detalla\": 55, \"ilustrativo\": 50, \"describe\": 52, \"necesarios\": 27, \"presentes\": 29, \"par\\u00e1metros\": 1213, \"puedes\": 8, \"javascriptescribe\": 4, \"prueba\": 23, \"pr\\u00e1ctico\": 15, \"presenta\": 31, \"puede\": 8, \"codificas\": 7, \"crear\\u00edas\": 5, \"borra\": 8, \"in\": 11374, \"write\": 3665, \"print\": 250, \"to\": 4218, \"me\": 368, \"show\": 1378, \"how\": 1442, \"screen\": 56, \"the\": 10775, \"on\": 175, \"code\": 5016, \"need\": 10, \"i\": 323, \"program\": 407, \"you\": 231, \"can\": 254, \"example\": 1937, \"an\": 1382, \"of\": 6026, \"give\": 268, \"is\": 348, \"what\": 233, \"provide\": 1296, \"easiest\": 22, \"with\": 2331, \"using\": 1442, \"demonstrate\": 532, \"way\": 107, \"help\": 24, \"what\\u2019s\": 86, \"please\": 4, \"explain\": 473, \"needed\": 2, \"command\": 8, \"simplest\": 132, \"function\": 996, \"would\": 19, \"basic\": 602, \"syntax\": 179, \"correct\": 24, \"proper\": 26, \"right\": 2, \"used\": 285, \"snippet\": 510, \"want\": 2, \"scrren\": 2, \"type\": 1044, \"value\": 144, \"declare\": 1204, \"specific\": 24, \"generates\": 1084, \"float\": 477, \"single\": 136, \"default\": 72, \"double\": 174, \"line\": 87, \"it\": 94, \"and\": 580, \"initialize\": 103, \"explicitly\": 24, \"public\": 24, \"char\": 174, \"initial\": 50, \"explicit\": 36, \"types\": 48, \"integer\": 174, \"best\": 54, \"following\": 24, \"practices\": 48, \"lowercase\": 24, \"directly\": 24, \"private\": 24, \"strict\": 12, \"mode\": 12, \"clean\": 48, \"temporary\": 48, \"local\": 24, \"dynamically\": 65, \"statement\": 442, \"conventions\": 24, \"naming\": 24, \"debug\": 34, \"non\": 12, \"modifiable\": 12, \"assigned\": 24, \"global\": 24, \"nullable\": 24, \"short\": 64, \"name\": 48, \"values\": 44, \"interpolated\": 24, \"its\": 45, \"form\": 45, \"new\": 24, \"scope\": 24, \"descriptive\": 24, \"volatile\": 12, \"readonly\": 12, \"static\": 12, \"inferred\": 12, \"undeclared\": 24, \"as\": 73, \"mutable\": 12, \"constants\": 258, \"const\": 264, \"chars\": 304, \"dimensional\": 1475, \"one\": 735, \"populate\": 60, \"array\": 1514, \"elements\": 47, \"integers\": 302, \"accessing\": 20, \"generate\": 1868, \"creating\": 100, \"doubles\": 302, \"implementation\": 936, \"that\": 380, \"create\": 1764, \"generating\": 40, \"return\": 20, \"defining\": 40, \"loop\": 947, \"through\": 20, \"step\": 70, \"by\": 70, \"initializing\": 59, \"display\": 34, \"dimension\": 39, \"containing\": 101, \"include\": 20, \"fill\": 20, \"modify\": 20, \"empty\": 20, \"two\": 758, \"most\": 32, \"implement\": 522, \"structure\": 285, \"out\": 9, \"does\": 20, \"like\": 20, \"look\": 38, \"showing\": 65, \"make\": 73, \"minimal\": 327, \"beginner\": 37, \"friendly\": 18, \"small\": 130, \"down\": 11, \"written\": 167, \"easy\": 14, \"clear\": 23, \"looks\": 6, \"build\": 390, \"greater\": 387, \"than\": 779, \"equals\": 387, \"or\": 387, \"less\": 392, \"equal\": 196, \"sample\": 188, \"draft\": 883, \"handle\": 213, \"demonstrating\": 152, \"block\": 435, \"includes\": 121, \"coding\": 20, \"uses\": 32, \"illustrate\": 478, \"demonstration\": 94, \"works\": 99, \"working\": 65, \"conditional\": 176, \"ternary\": 176, \"parameters\": 1252, \"without\": 681, \"coded\": 24, \"method\": 681, \"construct\": 36, \"develop\": 358, \"test\": 49, \"functional\": 24, \"present\": 61, \"javascriptwrite\": 3, \"implemented\": 65, \"practical\": 20, \"be\": 8, \"usage\": 39, \"promises\": 16, \"algorithm\": 8523, \"linear\": 815, \"search\": 4939, \"jump\": 848, \"goal\": 6, \"operations\": 38, \"interpolation\": 810, \"performance\": 8, \"optimizations\": 16, \"binary\": 840, \"bubble\": 926, \"apply\": 18, \"data\": 56, \"decorators\": 17, \"merge\": 940, \"solving\": 163, \"external\": 20, \"dependencies\": 23, \"implementations\": 22, \"based\": 101, \"mind\": 7, \"readability\": 7, \"steps\": 46, \"logic\": 1248, \"task\": 27, \"instructions\": 17, \"snippets\": 108, \"integrating\": 10, \"into\": 10, \"functions\": 122, \"async\": 16, \"solve\": 123, \"straightforward\": 18, \"cases\": 48, \"utilities\": 43, \"insertion\": 269, \"compute\": 42, \"exponential\": 817, \"solutions\": 57, \"execute\": 84, \"implementing\": 79, \"components\": 42, \"modularize\": 17, \"library\": 29, \"focused\": 21, \"tasks\": 37, \"manipulation\": 22, \"handling\": 83, \"elementary\": 15, \"methods\": 97, \"selection\": 928, \"files\": 5, \"clarity\": 31, \"simplicity\": 20, \"focusing\": 27, \"design\": 117, \"adapt\": 9, \"edge\": 9, \"foundational\": 34, \"basics\": 10, \"centered\": 10, \"beginners\": 7, \"optimized\": 14, \"problem\": 76, \"datasets\": 46, \"large\": 25, \"sorting\": 24, \"exercises\": 9, \"encapsulate\": 25, \"class\": 42, \"libraries\": 17, \"standard\": 14, \"streamline\": 9, \"object\": 17, \"process\": 24, \"ai\": 8, \"models\": 8, \"recursion\": 18, \"projects\": 32, \"applied\": 10, \"greedy\": 14, \"approach\": 49, \"only\": 23, \"classes\": 18, \"solution\": 171, \"results\": 6, \"calculate\": 18, \"systems\": 8, \"distributed\": 8, \"optimization\": 16, \"applications\": 26, \"level\": 4, \"scenarios\": 20, \"teaching\": 2, \"advanced\": 15, \"what's\": 14, \"efficient\": 17, \"memoization\": 24, \"recursive\": 30, \"version\": 98, \"conquer\": 16, \"share\": 13, \"automate\": 11, \"achieve\": 36, \"processing\": 15, \"parallel\": 6, \"perform\": 47, \"procedures\": 8, \"programming\": 17, \"dynamic\": 17, \"templates\": 13, \"graph\": 33, \"traversal\": 16, \"iteratively\": 19, \"interface\": 15, \"user\": 6, \"routines\": 22, \"modules\": 52, \"support\": 15, \"lightweight\": 12, \"iterative\": 7, \"threading\": 16, \"multi\": 7, \"featuring\": 8, \"application\": 15, \"could\": 20, \"sequence\": 42, \"showcasing\": 119, \"features\": 23, \"complete\": 9, \"workflows\": 5, \"involving\": 18, \"achieving\": 16, \"actions\": 9, \"practice\": 8, \"routine\": 20, \"solves\": 10, \"functionality\": 54, \"core\": 20, \"examples\": 115, \"detailed\": 15, \"seamlessly\": 14, \"blocks\": 8, \"iteration\": 6, \"challenge\": 9, \"alternatives\": 9, \"module\": 24, \"methodology\": 8, \"validate\": 10, \"programs\": 30, \"concise\": 179, \"input\": 16, \"iterations\": 22, \"addressing\": 9, \"requirements\": 6, \"python's\": 6, \"answers\": 10, \"manage\": 8, \"execution\": 6, \"plain\": 8, \"strategy\": 9, \"matching\": 9, \"pattern\": 9, \"performing\": 11, \"comments\": 9, \"time\": 9, \"focus\": 24, \"efficiency\": 9, \"executing\": 8, \"file\": 21, \"optimize\": 9, \"computing\": 5, \"efficiently\": 5, \"gui\": 9, \"essentials\": 7, \"deploying\": 7, \"complexity\": 13, \"stepwise\": 14, \"browser\": 10, \"contexts\": 18, \"integrate\": 7, \"numerical\": 11, \"designed\": 6, \"arrays\": 16, \"python\\u2019s\": 9, \"scale\": 8, \"problems\": 19, \"tailored\": 7, \"purposes\": 7, \"educational\": 15, \"computes\": 7, \"issue\": 7, \"approaches\": 14, \"tools\": 6, \"processes\": 14, \"concurrency\": 8, \"validation\": 9, \"project\": 4, \"language\": 8, \"implements\": 60, \"refine\": 18, \"carry\": 3, \"handlers\": 6, \"inputs\": 8, \"shortest\": 17, \"path\": 17, \"resolving\": 8, \"possible\": 6, \"driven\": 10, \"handler\": 7, \"any\": 6, \"structures\": 17, \"testing\": 9, \"controlled\": 9, \"setups\": 9, \"executes\": 6, \"coloring\": 11, \"run\": 7, \"computation\": 8, \"address\": 6, \"illustrating\": 69, \"applying\": 8, \"additional\": 4, \"format\": 8, \"understand\": 9, \"exploring\": 7, \"integration\": 5, \"break\": 6, \"framework\": 7, \"case\": 4, \"interactively\": 5, \"browsers\": 6, \"scenario\": 4, \"running\": 5, \"embedding\": 6, \"introductory\": 5, \"from\": 1527, \"section\": 353, \"extract\": 607, \"all\": 171, \"occurrences\": 34, \"operates\": 26, \"within\": 56, \"extracted\": 180, \"required\": 27, \"list\": 240, \"represent\": 75, \"breakdown\": 49, \"extracts\": 30, \"highlight\": 187, \"main\": 134, \"flow\": 71, \"outline\": 76, \"essential\": 28, \"highlights\": 29, \"detail\": 48, \"inside\": 26, \"illustrative\": 52, \"part\": 100, \"necessary\": 50, \"representing\": 28, \"representation\": 24, \"illustration\": 29, \"extracting\": 27, \"key\": 29, \"are\": 52, \"demonstrates\": 28, \"showcase\": 27}", "index_docs": "{\"2\": 15872, \"189\": 201, \"182\": 231, \"6\": 8877, \"223\": 162, \"4\": 14523, \"185\": 219, \"32\": 2619, \"3\": 15827, \"228\": 149, \"989\": 4, \"10\": 6722, \"69\": 998, \"65\": 1065, \"28\": 3350, \"11\": 5810, \"99\": 659, \"153\": 335, \"267\": 96, \"95\": 727, \"341\": 53, \"225\": 158, \"278\": 86, \"19\": 4947, \"23\": 4362, \"218\": 167, \"196\": 180, \"33\": 2441, \"658\": 16, \"771\": 10, \"186\": 216, \"66\": 1045, \"990\": 4, \"25\": 3730, \"834\": 8, \"7\": 7900, \"991\": 4, \"158\": 311, \"154\": 333, \"221\": 165, \"720\": 12, \"39\": 1804, \"1010\": 2, \"193\": 190, \"58\": 1207, \"1011\": 2, \"63\": 1115, \"383\": 44, \"835\": 8, \"1012\": 2, \"121\": 471, \"585\": 20, \"123\": 445, \"1013\": 2, \"659\": 16, \"26\": 3577, \"1014\": 2, \"60\": 1177, \"226\": 158, \"1015\": 2, \"310\": 65, \"449\": 30, \"281\": 84, \"152\": 345, \"61\": 1146, \"496\": 24, \"31\": 2713, \"68\": 1026, \"115\": 510, \"209\": 171, \"497\": 24, \"360\": 48, \"299\": 72, \"418\": 36, \"498\": 24, \"210\": 171, \"275\": 88, \"249\": 112, \"113\": 528, \"499\": 24, \"500\": 24, \"501\": 24, \"211\": 171, \"392\": 42, \"502\": 24, \"503\": 24, \"384\": 44, \"504\": 24, \"212\": 171, \"722\": 12, \"721\": 12, \"146\": 358, \"110\": 558, \"235\": 131, \"432\": 33, \"361\": 48, \"723\": 12, \"505\": 24, \"362\": 48, \"507\": 24, \"506\": 24, \"300\": 72, \"508\": 24, \"363\": 48, \"509\": 24, \"724\": 12, \"725\": 12, \"510\": 24, \"511\": 24, \"512\": 24, \"364\": 48, \"365\": 48, \"513\": 24, \"342\": 53, \"726\": 12, \"255\": 105, \"727\": 12, \"389\": 43, \"167\": 272, \"514\": 24, \"728\": 12, \"436\": 32, \"729\": 12, \"515\": 24, \"285\": 80, \"516\": 24, \"305\": 70, \"916\": 6, \"730\": 12, \"322\": 60, \"116\": 510, \"134\": 391, \"100\": 650, \"173\": 260, \"52\": 1300, \"174\": 260, \"175\": 260, \"230\": 140, \"260\": 100, \"399\": 40, \"586\": 20, \"323\": 60, \"587\": 20, \"109\": 563, \"216\": 85, \"588\": 20, \"190\": 200, \"224\": 160, \"589\": 20, \"49\": 1395, \"590\": 20, \"296\": 73, \"45\": 1462, \"591\": 20, \"592\": 20, \"331\": 56, \"593\": 20, \"594\": 20, \"77\": 908, \"595\": 20, \"385\": 44, \"17\": 5499, \"596\": 20, \"597\": 20, \"125\": 449, \"102\": 650, \"101\": 650, \"78\": 896, \"16\": 5742, \"104\": 612, \"44\": 1458, \"131\": 398, \"187\": 215, \"487\": 25, \"327\": 59, \"317\": 63, \"159\": 304, \"386\": 44, \"155\": 327, \"731\": 12, \"629\": 18, \"397\": 41, \"517\": 24, \"917\": 6, \"437\": 32, \"410\": 38, \"692\": 14, \"380\": 45, \"274\": 89, \"918\": 6, \"919\": 6, \"920\": 6, \"921\": 6, \"922\": 6, \"107\": 585, \"135\": 390, \"29\": 2646, \"137\": 388, \"35\": 1672, \"132\": 392, \"128\": 436, \"598\": 20, \"111\": 546, \"171\": 265, \"192\": 194, \"124\": 451, \"343\": 53, \"250\": 110, \"238\": 124, \"213\": 171, \"126\": 445, \"269\": 94, \"148\": 356, \"376\": 46, \"290\": 76, \"208\": 172, \"207\": 172, \"150\": 348, \"90\": 784, \"350\": 50, \"9\": 8231, \"311\": 65, \"22\": 4764, \"450\": 30, \"85\": 820, \"329\": 58, \"144\": 365, \"599\": 20, \"41\": 1574, \"307\": 69, \"89\": 792, \"84\": 823, \"54\": 1273, \"14\": 6119, \"30\": 2967, \"79\": 892, \"165\": 282, \"81\": 873, \"423\": 34, \"103\": 643, \"168\": 269, \"38\": 1852, \"443\": 31, \"470\": 27, \"242\": 121, \"62\": 1133, \"693\": 14, \"471\": 27, \"732\": 12, \"18\": 5196, \"923\": 6, \"400\": 40, \"272\": 93, \"438\": 32, \"733\": 12, \"439\": 32, \"752\": 11, \"694\": 14, \"444\": 31, \"488\": 25, \"251\": 108, \"479\": 26, \"753\": 11, \"967\": 5, \"166\": 277, \"355\": 49, \"91\": 781, \"276\": 87, \"712\": 13, \"622\": 19, \"676\": 15, \"318\": 63, \"404\": 39, \"836\": 8, \"562\": 22, \"695\": 14, \"968\": 5, \"145\": 363, \"734\": 12, \"837\": 8, \"696\": 14, \"451\": 30, \"563\": 22, \"345\": 52, \"880\": 7, \"697\": 14, \"549\": 23, \"452\": 30, \"623\": 19, \"76\": 916, \"754\": 11, \"755\": 11, \"772\": 10, \"289\": 77, \"773\": 10, \"575\": 21, \"220\": 166, \"735\": 12, \"576\": 21, \"273\": 91, \"268\": 95, \"797\": 9, \"577\": 21, \"677\": 15, \"405\": 39, \"401\": 40, \"756\": 11, \"465\": 28, \"774\": 10, \"464\": 28, \"413\": 37, \"550\": 23, \"433\": 33, \"445\": 31, \"337\": 54, \"398\": 41, \"600\": 20, \"713\": 13, \"798\": 9, \"775\": 10, \"642\": 17, \"698\": 14, \"660\": 16, \"881\": 7, \"366\": 48, \"969\": 5, \"256\": 103, \"324\": 60, \"406\": 39, \"678\": 15, \"377\": 46, \"882\": 7, \"1007\": 3, \"679\": 15, \"883\": 7, \"970\": 5, \"319\": 63, \"344\": 53, \"736\": 12, \"661\": 16, \"551\": 23, \"884\": 7, \"776\": 10, \"777\": 10, \"624\": 19, \"387\": 44, \"564\": 22, \"630\": 18, \"601\": 20, \"757\": 11, \"239\": 124, \"280\": 85, \"643\": 17, \"489\": 25, \"680\": 15, \"839\": 8, \"838\": 8, \"419\": 36, \"578\": 21, \"714\": 13, \"565\": 22, \"351\": 50, \"885\": 7, \"992\": 4, \"579\": 21, \"840\": 8, \"1016\": 2, \"644\": 17, \"518\": 24, \"924\": 6, \"758\": 11, \"552\": 23, \"759\": 11, \"519\": 24, \"302\": 71, \"553\": 23, \"662\": 16, \"715\": 13, \"414\": 37, \"760\": 11, \"602\": 20, \"96\": 683, \"309\": 67, \"566\": 22, \"842\": 8, \"841\": 8, \"887\": 7, \"886\": 7, \"993\": 4, \"567\": 22, \"568\": 22, \"925\": 6, \"843\": 8, \"761\": 11, \"737\": 12, \"888\": 7, \"971\": 5, \"681\": 15, \"554\": 23, \"631\": 18, \"603\": 20, \"424\": 34, \"844\": 8, \"778\": 10, \"580\": 21, \"738\": 12, \"581\": 21, \"972\": 5, \"926\": 6, \"779\": 10, \"927\": 6, \"889\": 7, \"699\": 14, \"890\": 7, \"994\": 4, \"645\": 17, \"845\": 8, \"846\": 8, \"799\": 9, \"646\": 17, \"892\": 7, \"891\": 7, \"254\": 106, \"682\": 15, \"847\": 8, \"415\": 37, \"700\": 14, \"780\": 10, \"582\": 21, \"800\": 9, \"762\": 11, \"632\": 18, \"625\": 19, \"928\": 6, \"716\": 13, \"663\": 16, \"929\": 6, \"664\": 16, \"893\": 7, \"739\": 12, \"801\": 9, \"802\": 9, \"930\": 6, \"973\": 5, \"974\": 5, \"931\": 6, \"932\": 6, \"803\": 9, \"781\": 10, \"848\": 8, \"995\": 4, \"764\": 11, \"763\": 11, \"894\": 7, \"701\": 14, \"804\": 9, \"895\": 7, \"782\": 10, \"805\": 9, \"975\": 5, \"665\": 16, \"850\": 8, \"849\": 8, \"806\": 9, \"933\": 6, \"896\": 7, \"976\": 5, \"977\": 5, \"807\": 9, \"808\": 9, \"897\": 7, \"935\": 6, \"934\": 6, \"937\": 6, \"936\": 6, \"898\": 7, \"938\": 6, \"939\": 6, \"809\": 9, \"783\": 10, \"785\": 10, \"784\": 10, \"940\": 6, \"941\": 6, \"702\": 14, \"978\": 5, \"851\": 8, \"740\": 12, \"741\": 12, \"996\": 4, \"852\": 8, \"942\": 6, \"434\": 33, \"979\": 5, \"943\": 6, \"997\": 4, \"945\": 6, \"944\": 6, \"569\": 22, \"1018\": 2, \"1017\": 2, \"998\": 4, \"946\": 6, \"853\": 8, \"947\": 6, \"765\": 11, \"407\": 39, \"999\": 4, \"15\": 5840, \"12\": 6399, \"217\": 168, \"237\": 128, \"184\": 221, \"122\": 470, \"202\": 175, \"303\": 71, \"179\": 241, \"425\": 34, \"426\": 34, \"294\": 74, \"457\": 29, \"338\": 54, \"390\": 43, \"248\": 114, \"453\": 30, \"427\": 34, \"490\": 25, \"244\": 120, \"555\": 23, \"480\": 26, \"356\": 49, \"332\": 56, \"520\": 24, \"261\": 100, \"141\": 380, \"286\": 79, \"556\": 23, \"466\": 28, \"284\": 81, \"295\": 74, \"491\": 25, \"472\": 27, \"481\": 26, \"320\": 63, \"287\": 79, \"492\": 25, \"458\": 29, \"493\": 25, \"604\": 20, \"482\": 26, \"446\": 31, \"336\": 55, \"352\": 50, \"346\": 52, \"473\": 27, \"459\": 29, \"57\": 1213, \"854\": 8, \"1000\": 4, \"557\": 23, \"683\": 15, \"447\": 31, \"855\": 8, \"899\": 7, \"980\": 5, \"856\": 8, \"5\": 11374, \"27\": 3665, \"178\": 250, \"24\": 4218, \"143\": 368, \"51\": 1378, \"47\": 1442, \"333\": 56, \"1\": 10775, \"203\": 175, \"20\": 5016, \"786\": 10, \"157\": 323, \"130\": 407, \"183\": 231, \"177\": 254, \"36\": 1937, \"50\": 1382, \"13\": 6026, \"170\": 268, \"151\": 348, \"181\": 233, \"53\": 1296, \"570\": 22, \"34\": 2331, \"48\": 1442, \"112\": 532, \"253\": 107, \"521\": 24, \"279\": 86, \"1001\": 4, \"120\": 473, \"1019\": 2, \"857\": 8, \"234\": 132, \"70\": 996, \"626\": 19, \"106\": 602, \"198\": 179, \"522\": 24, \"483\": 26, \"1020\": 2, \"163\": 285, \"117\": 510, \"1021\": 2, \"1022\": 2, \"67\": 1044, \"229\": 144, \"59\": 1204, \"523\": 24, \"64\": 1084, \"119\": 477, \"232\": 136, \"301\": 72, \"204\": 174, \"277\": 87, \"270\": 94, \"108\": 580, \"257\": 103, \"524\": 24, \"525\": 24, \"205\": 174, \"353\": 50, \"420\": 36, \"367\": 48, \"206\": 174, \"339\": 54, \"526\": 24, \"368\": 48, \"527\": 24, \"528\": 24, \"529\": 24, \"742\": 12, \"743\": 12, \"369\": 48, \"370\": 48, \"530\": 24, \"312\": 65, \"127\": 442, \"532\": 24, \"531\": 24, \"428\": 34, \"744\": 12, \"745\": 12, \"533\": 24, \"534\": 24, \"535\": 24, \"316\": 64, \"371\": 48, \"388\": 44, \"536\": 24, \"381\": 45, \"382\": 45, \"537\": 24, \"538\": 24, \"539\": 24, \"746\": 12, \"747\": 12, \"748\": 12, \"749\": 12, \"540\": 24, \"297\": 73, \"750\": 12, \"176\": 258, \"172\": 264, \"160\": 304, \"46\": 1475, \"94\": 735, \"325\": 60, \"43\": 1514, \"374\": 47, \"161\": 302, \"605\": 20, \"37\": 1868, \"262\": 100, \"162\": 302, \"73\": 936, \"142\": 380, \"40\": 1764, \"402\": 40, \"606\": 20, \"403\": 40, \"71\": 947, \"607\": 20, \"231\": 70, \"306\": 70, \"328\": 59, \"429\": 34, \"408\": 39, \"258\": 101, \"608\": 20, \"609\": 20, \"610\": 20, \"611\": 20, \"93\": 758, \"440\": 32, \"114\": 522, \"164\": 285, \"810\": 9, \"612\": 20, \"613\": 20, \"411\": 38, \"313\": 65, \"298\": 73, \"156\": 327, \"416\": 37, \"633\": 18, \"236\": 130, \"766\": 11, \"219\": 167, \"703\": 14, \"558\": 23, \"948\": 6, \"136\": 390, \"140\": 387, \"92\": 779, \"138\": 387, \"139\": 387, \"133\": 392, \"191\": 196, \"194\": 188, \"80\": 883, \"188\": 213, \"227\": 152, \"129\": 435, \"243\": 121, \"614\": 20, \"441\": 32, \"118\": 478, \"271\": 94, \"264\": 99, \"314\": 65, \"201\": 176, \"200\": 176, \"55\": 1252, \"97\": 681, \"541\": 24, \"98\": 681, \"421\": 36, \"147\": 358, \"357\": 49, \"542\": 24, \"321\": 61, \"1008\": 3, \"315\": 65, \"615\": 20, \"858\": 8, \"409\": 39, \"666\": 16, \"8\": 8523, \"87\": 815, \"21\": 4939, \"82\": 848, \"949\": 6, \"412\": 38, \"88\": 810, \"859\": 8, \"667\": 16, \"83\": 840, \"75\": 926, \"634\": 18, \"334\": 56, \"647\": 17, \"72\": 940, \"222\": 163, \"616\": 20, \"559\": 23, \"571\": 22, \"259\": 101, \"901\": 7, \"900\": 7, \"378\": 46, \"56\": 1248, \"474\": 27, \"648\": 17, \"252\": 108, \"787\": 10, \"788\": 10, \"241\": 122, \"668\": 16, \"240\": 123, \"635\": 18, \"372\": 48, \"391\": 43, \"169\": 269, \"393\": 42, \"86\": 817, \"330\": 57, \"282\": 84, \"288\": 79, \"394\": 42, \"649\": 17, \"460\": 29, \"583\": 21, \"417\": 37, \"572\": 22, \"283\": 83, \"684\": 15, \"266\": 97, \"74\": 928, \"981\": 5, \"448\": 31, \"617\": 20, \"475\": 27, \"246\": 117, \"811\": 9, \"812\": 9, \"430\": 34, \"789\": 10, \"790\": 10, \"902\": 7, \"704\": 14, \"291\": 76, \"379\": 46, \"494\": 25, \"543\": 24, \"813\": 9, \"495\": 25, \"395\": 42, \"650\": 17, \"705\": 14, \"814\": 9, \"651\": 17, \"544\": 24, \"860\": 8, \"861\": 8, \"636\": 18, \"442\": 32, \"791\": 10, \"706\": 14, \"358\": 49, \"560\": 23, \"637\": 18, \"214\": 171, \"950\": 6, \"638\": 18, \"863\": 8, \"862\": 8, \"669\": 16, \"484\": 26, \"1002\": 4, \"618\": 20, \"1023\": 2, \"685\": 15, \"707\": 14, \"652\": 17, \"545\": 24, \"454\": 30, \"265\": 98, \"670\": 16, \"717\": 13, \"767\": 11, \"422\": 36, \"686\": 15, \"951\": 6, \"375\": 47, \"864\": 8, \"654\": 17, \"653\": 17, \"718\": 13, \"435\": 33, \"671\": 16, \"627\": 19, \"687\": 15, \"952\": 6, \"573\": 22, \"347\": 52, \"688\": 15, \"751\": 12, \"903\": 7, \"672\": 16, \"904\": 7, \"865\": 8, \"689\": 15, \"619\": 20, \"396\": 42, \"245\": 119, \"561\": 23, \"815\": 9, \"982\": 5, \"639\": 18, \"673\": 16, \"816\": 9, \"866\": 8, \"620\": 20, \"792\": 10, \"340\": 54, \"621\": 20, \"247\": 115, \"690\": 15, \"708\": 14, \"867\": 8, \"953\": 6, \"817\": 9, \"818\": 9, \"546\": 24, \"868\": 8, \"793\": 10, \"455\": 30, \"199\": 179, \"674\": 16, \"574\": 22, \"819\": 9, \"954\": 6, \"955\": 6, \"794\": 10, \"869\": 8, \"956\": 6, \"870\": 8, \"820\": 9, \"822\": 9, \"821\": 9, \"768\": 11, \"823\": 9, \"824\": 9, \"547\": 24, \"825\": 9, \"871\": 8, \"584\": 21, \"826\": 9, \"983\": 5, \"984\": 5, \"827\": 9, \"905\": 7, \"906\": 7, \"719\": 13, \"709\": 14, \"795\": 10, \"640\": 18, \"907\": 7, \"769\": 11, \"957\": 6, \"675\": 16, \"828\": 9, \"872\": 8, \"628\": 19, \"908\": 7, \"909\": 7, \"691\": 15, \"910\": 7, \"911\": 7, \"710\": 14, \"958\": 6, \"711\": 14, \"873\": 8, \"829\": 9, \"1003\": 4, \"874\": 8, \"326\": 60, \"641\": 18, \"1009\": 3, \"959\": 6, \"875\": 8, \"655\": 17, 