{"class_name": "Tokenizer", "config": {"num_words": null, "filters": "", "lower": true, "split": " ", "char_level": false, "oov_token": null, "document_count": 14990, "word_counts": "{\"<start>\": 14990, \"def\": 6005, \"quick_sort(arr):\\n\": 462, \"if\": 22961, \"len(arr)\": 2772, \"<=\": 7034, \"1:\\n\": 1848, \"return\": 29994, \"arr\\n\": 1386, \"pivot\": 937, \"=\": 88653, \"arr[len(arr)\": 462, \"//\": 4620, \"2]\\n\": 462, \"left\": 3273, \"[x\": 1386, \"for\": 20123, \"x\": 5609, \"in\": 10625, \"arr\": 3696, \"<\": 21627, \"pivot]\\n\": 1386, \"middle\": 1399, \"==\": 4157, \"right\": 2811, \">\": 9844, \"quick_sort(left)\": 462, \"+\": 18750, \"quick_sort(right)\": 462, \"<end>\": 14990, \"function\": 7124, \"mergesort(arr)\": 475, \"{\\n\": 27546, \"(arr.length\": 1425, \"1)\": 1900, \"arr;\\n\": 950, \"const\": 11400, \"mid\": 3748, \"math.floor(arr.length\": 475, \"/\": 5687, \"2);\\n\": 950, \"mergesort(arr.slice(0,\": 475, \"mid));\\n\": 475, \"mergesort(arr.slice(mid));\\n\": 475, \"merge(left,\": 950, \"right);\\n}\\nfunction\": 475, \"right)\": 950, \"let\": 11874, \"result\": 475, \"[];\\n\": 950, \"i\": 31971, \"0,\": 3286, \"j\": 7943, \"0;\\n\": 1425, \"while\": 8882, \"(i\": 950, \"left.length\": 475, \"&&\": 3800, \"right.length)\": 475, \"(left[i]\": 475, \"right[j])\": 475, \"result.push(left[i]);\\n\": 475, \"i++;\\n\": 475, \"}\": 2375, \"else\": 4275, \"result.push(right[j]);\\n\": 475, \"j++;\\n\": 475, \"}\\n\": 9972, \"result.concat(left.slice(i)).concat(right.slice(j));\\n}\": 475, \"linearsearch(arr,\": 475, \"x)\": 9012, \"(let\": 9498, \"0;\": 7123, \"arr.length;\": 3325, \"i++)\": 6174, \"(arr[i]\": 2824, \"===\": 4275, \"i;\\n\": 2850, \"-1;\\n}\": 2375, \"binarysearch(arr,\": 475, \"low\": 4685, \"high\": 4685, \"arr.length\": 1900, \"-\": 31882, \"1;\\n\": 4750, \"(low\": 1412, \"high)\": 1412, \"math.floor((low\": 475, \"(arr[mid]\": 950, \"mid;\\n\": 475, \"\\ndef\": 1386, \"bucket_sort(arr):\\n\": 462, \"arr\\n\\n\": 462, \"min_val\": 1386, \"min(arr)\\n\": 924, \"max_val\": 2310, \"max(arr)\\n\": 924, \"bucket_count\": 462, \"len(arr)\\n\": 3696, \"buckets\": 937, \"[[]\": 462, \"_\": 462, \"range(bucket_count)]\\n\\n\": 462, \"num\": 1386, \"arr:\\n\": 924, \"index\": 937, \"int((num\": 462, \"min_val)\": 924, \"(max_val\": 462, \"*\": 5596, \"(bucket_count\": 462, \"1))\\n\": 462, \"buckets[index].append(num)\\n\\n\": 462, \"sorted_arr\": 462, \"[]\\n\": 462, \"bucket\": 462, \"buckets:\\n\": 462, \"sorted_arr.extend(sorted(bucket))\\n\\n\": 462, \"sorted_arr\\n\": 462, \"exponential_search(arr,\": 462, \"x):\\n\": 2771, \"arr[0]\": 924, \"x:\\n\": 5543, \"0\\n\": 1848, \"n\": 10780, \"1\\n\": 9240, \"and\": 3234, \"arr[i]\": 4658, \"*=\": 1874, \"2\\n\": 1848, \"binary_search(arr[:min(i,\": 462, \"n)],\": 462, \"heapsort(arr)\": 475, \"heapify(arr,\": 3748, \"n,\": 2811, \"i)\": 950, \"largest\": 3273, \"l\": 1399, \"2\": 2336, \"r\": 1399, \"2;\\n\": 950, \"(l\": 475, \"arr[l]\": 937, \"arr[largest])\": 950, \"l;\\n\": 475, \"(r\": 475, \"arr[r]\": 937, \"r;\\n\": 475, \"(largest\": 475, \"!==\": 475, \"[arr[i],\": 1425, \"arr[largest]]\": 475, \"[arr[largest],\": 475, \"arr[i]];\\n\": 950, \"largest);\\n\": 475, \"arr.length;\\n\": 2849, \"math.floor(n\": 475, \"2)\": 475, \"1;\": 4749, \">=\": 3299, \"i--)\": 1900, \"i);\\n\": 475, \"[arr[0],\": 475, \"arr[i]]\": 475, \"arr[0]];\\n\": 475, \"i,\": 937, \"0);\\n\": 475, \"arr;\\n}\": 2374, \"selection_sort(arr):\\n\": 462, \"range(n):\\n\": 1848, \"min_idx\": 924, \"i\\n\": 2771, \"range(i+1,\": 462, \"n):\\n\": 462, \"arr[j]\": 1399, \"arr[min_idx]:\\n\": 462, \"j\\n\": 462, \"arr[i],\": 1386, \"arr[min_idx]\": 462, \"arr[min_idx],\": 462, \"arr[i]\\n\": 2310, \"fibonacci_search(arr,\": 462, \"fib_m2\": 2772, \"fib_m1\": 2772, \"fib_m\": 3696, \"fib_m1\\n\": 2772, \"n:\\n\": 924, \"fib_m\\n\": 462, \"offset\": 2811, \"-1\\n\": 924, \"min(offset\": 462, \"fib_m2,\": 462, \"1)\\n\": 462, \"fib_m2\\n\": 1386, \"elif\": 1848, \"else:\\n\": 2310, \"arr[offset\": 937, \"1]\": 5622, \"-1\": 2309, \"counting_sort_for_radix(arr,\": 924, \"exp):\\n\": 462, \"output\": 1874, \"[0]\": 1848, \"n\\n\": 462, \"count\": 1874, \"10\\n\\n\": 924, \"digit\": 1874, \"exp)\": 2824, \"%\": 1874, \"10\\n\": 924, \"count[digit]\": 924, \"+=\": 6969, \"1\\n\\n\": 2310, \"range(1,\": 1386, \"10):\\n\": 462, \"count[i]\": 1874, \"count[i\": 1874, \"1]\\n\\n\": 924, \"range(n\": 1386, \"1,\": 5609, \"-1,\": 924, \"-1):\\n\": 1386, \"output[count[digit]\": 937, \"-=\": 1386, \"output[i]\\n\\ndef\": 462, \"radix_sort(arr):\\n\": 462, \"max(arr)\\n\\n\": 462, \"exp\": 2336, \"0:\\n\": 462, \"exp)\\n\": 462, \"\\nfunction\": 950, \"bucketsort(arr)\": 475, \"arr;\\n\\n\": 475, \"min\": 1425, \"math.min(...arr);\\n\": 950, \"max\": 1900, \"math.max(...arr);\\n\": 950, \"bucketcount\": 475, \"math.floor(arr.length);\\n\": 475, \"new\": 2375, \"array(bucketcount).fill().map(()\": 475, \"=>\": 2375, \"[]);\\n\\n\": 475, \"math.floor((arr[i]\": 475, \"min)\": 950, \"(max\": 475, \"(bucketcount\": 475, \"1));\\n\": 475, \"buckets[index].push(arr[i]);\\n\": 475, \"}\\n\\n\": 5700, \"sortedarray\": 950, \"buckets.length;\": 475, \"buckets[i].sort((a,\": 475, \"b)\": 475, \"a\": 475, \"b);\\n\": 475, \"sortedarray.concat(buckets[i]);\\n\": 475, \"sortedarray;\\n}\\n\\n\": 475, \"insertion_sort(arr):\\n\": 462, \"len(arr)):\\n\": 462, \"key\": 1399, \"0\": 937, \"arr[j]:\\n\": 462, \"arr[j\": 2822, \"arr[j]\\n\": 924, \"key\\n\": 462, \"selectionsort(arr)\": 475, \"n;\": 1424, \"minidx\": 950, \"j++)\": 949, \"(arr[j]\": 949, \"arr[minidx])\": 475, \"j;\\n\": 475, \"arr[minidx]]\": 475, \"[arr[minidx],\": 475, \"import\": 462, \"math\\ndef\": 462, \"jump_search(arr,\": 462, \"step\": 1874, \"int(math.sqrt(n))\\n\": 924, \"prev\": 2336, \"arr[min(step,\": 462, \"n)\": 1887, \"step\\n\": 462, \"range(prev,\": 462, \"min(step,\": 462, \"n)):\\n\": 462, \"jumpsearch(arr,\": 475, \"math.floor(math.sqrt(n));\\n\": 950, \"(arr[math.min(step,\": 475, \"step;\\n\": 475, \"(prev\": 475, \"-1;\\n\": 1425, \"prev;\": 475, \"math.min(step,\": 475, \"n);\": 475, \"fibonaccisearch(arr,\": 475, \"fibm2\": 2850, \"fibm1\": 2375, \"fibm\": 2850, \"fibm1;\\n\": 2850, \"(fibm\": 950, \"fibm;\\n\": 475, \"math.min(offset\": 475, \"fibm2,\": 475, \"1);\\n\": 475, \"fibm2;\\n\": 1425, \"(fibm1\": 475, \"counting_sort(arr):\\n\": 462, \"range_of_elements\": 462, \"range_of_elements\\n\": 462, \"len(arr)\\n\\n\": 462, \"count[num\": 924, \"min_val]\": 1386, \"len(count)):\\n\": 462, \"reversed(arr):\\n\": 462, \"output[count[num\": 462, \"num\\n\": 462, \"range(len(arr)):\\n\": 923, \"output[i]\\n\\n\": 462, \"countingsort(arr)\": 475, \"range\": 475, \"1;\\n\\n\": 475, \"array(range).fill(0);\\n\": 475, \"array(arr.length);\\n\\n\": 475, \"count[arr[i]\": 950, \"min]++;\\n\": 475, \"count.length;\": 475, \"1];\\n\": 950, \"output[count[arr[i]\": 475, \"min]\": 475, \"arr[i];\\n\": 1425, \"min]--;\\n\": 475, \"output[i];\\n\": 950, \"ternary_search(arr,\": 1848, \"left,\": 1874, \"right,\": 1874, \"target):\\n\": 462, \"right:\\n\": 462, \"-1\\n\\n\": 462, \"mid1\": 2811, \"(right\": 924, \"left)\": 1874, \"3\\n\": 462, \"mid2\": 2811, \"3\\n\\n\": 462, \"arr[mid1]\": 462, \"target:\\n\": 924, \"mid1\\n\": 462, \"arr[mid2]\": 462, \"mid2\\n\\n\": 462, \"target\": 924, \"arr[mid1]:\\n\": 462, \"target)\\n\": 462, \"arr[mid2]:\\n\": 462, \"target)\": 1887, \"\\n\": 462, \"target)\\n\\n\": 462, \"merge_sort(arr):\\n\": 462, \"arr[:mid]\\n\": 462, \"arr[mid:]\\n\": 462, \"merge_sort(left)\\n\": 462, \"merge_sort(right)\\n\": 462, \"k\": 1848, \"len(left)\": 462, \"len(right):\\n\": 924, \"left[i]\": 462, \"right[j]:\\n\": 462, \"arr[k]\": 1848, \"left[i]\\n\": 924, \"right[j]\\n\": 924, \"len(left):\\n\": 462, \"countingsortforradix(arr,\": 950, \"array(arr.length);\\n\": 475, \"array(10).fill(0);\\n\\n\": 475, \"math.floor(arr[i]\": 950, \"10;\\n\": 950, \"count[digit]++;\\n\": 475, \"10;\": 475, \"count[digit]--;\\n\": 475, \"}\\n}\\n\\nfunction\": 475, \"radixsort(arr)\": 475, \"math.max(...arr);\\n\\n\": 475, \"math.floor(max\": 475, \"10)\": 475, \"exp);\\n\": 475, \"arr;\\n}\\n\": 475, \"exponentialsearch(arr,\": 475, \"(arr[0]\": 475, \"binarysearch(arr.slice(0,\": 475, \"math.min(i,\": 475, \"n)),\": 475, \"x);\\n}\": 475, \"interpolationsearch(arr,\": 475, \"arr[low]\": 937, \"arr[high])\": 475, \"pos\": 2811, \"math.floor(((high\": 475, \"low)\": 937, \"(arr[high]\": 937, \"arr[low]))\": 475, \"(x\": 937, \"arr[low]));\\n\": 475, \"(arr[pos]\": 950, \"pos;\\n\": 475, \"heap_sort(arr):\\n\": 462, \"i):\\n\": 462, \"arr[largest]:\\n\": 924, \"l\\n\": 462, \"r\\n\": 462, \"!=\": 462, \"i:\\n\": 462, \"arr[largest]\": 462, \"arr[largest],\": 462, \"largest)\\n\": 462, \"i)\\n\": 462, \"arr[0],\": 462, \"0)\\n\": 462, \"linear_search(arr,\": 461, \"bubblesort(arr)\": 474, \"1])\": 474, \"[arr[j],\": 474, \"1]]\": 474, \"[arr[j\": 474, \"1],\": 474, \"arr[j]];\\n\": 474, \"interpolation_search(arr,\": 462, \"low,\": 924, \"arr[high]:\\n\": 462, \"((high\": 462, \"arr[low])\": 462, \"arr[low]))\\n\": 462, \"arr[pos]\": 924, \"pos\\n\": 462, \"insertionsort(arr)\": 475, \"(j\": 475, \"key)\": 475, \"arr[j];\\n\": 475, \"j--;\\n\": 475, \"key;\\n\": 475, \"bubble_sort(arr):\\n\": 462, \"range(0,\": 462, \"n-i-1):\\n\": 462, \"arr[j+1]:\\n\": 462, \"arr[j],\": 462, \"arr[j+1]\": 462, \"arr[j+1],\": 462, \"ternarysearch(arr,\": 1900, \"(left\": 475, \"math.floor((right\": 950, \"3);\\n\": 475, \"3);\\n\\n\": 475, \"(arr[mid1]\": 475, \"mid1;\\n\": 475, \"(arr[mid2]\": 475, \"mid2;\\n\": 475, \"(target\": 950, \"arr[mid1])\": 475, \"target);\\n\": 1425, \"arr[mid2])\": 475, \"}\\n}\\n\\n\": 475, \"binary_search(arr,\": 462, \"high:\\n\": 462, \"arr[mid]\": 924, \"mid\\n\": 462, \"quicksort(arr)\": 475, \"arr[math.floor(arr.length\": 475, \"2)];\\n\": 475, \"arr.filter(x\": 1425, \"pivot);\\n\": 1425, \"[...quicksort(left),\": 475, \"...middle,\": 475, \"...quicksort(right)];\\n}\": 475}", "word_docs": "{\"[x\": 462, \"<end>\": 14990, \"right\": 2811, \"quick_sort(right)\": 462, \"==\": 3695, \"<start>\": 14990, \"middle\": 937, \"pivot\": 937, \"pivot]\\n\": 462, \"x\": 1874, \"if\": 12179, \"len(arr)\": 2310, \"def\": 5543, \"quick_sort(arr):\\n\": 462, \"=\": 14529, \"arr\\n\": 1386, \"arr\": 2772, \"2]\\n\": 462, \"+\": 7970, \"//\": 3234, \"<=\": 5160, \"for\": 8893, \"<\": 12681, \"return\": 14990, \"1:\\n\": 1848, \"arr[len(arr)\": 462, \"in\": 4619, \">\": 6558, \"left\": 2811, \"quick_sort(left)\": 462, \"j\": 3747, \"arr;\\n\": 950, \"0;\\n\": 1425, \"const\": 2850, \"j++;\\n\": 475, \"mergesort(arr.slice(mid));\\n\": 475, \"[];\\n\": 950, \"while\": 7021, \"i++;\\n\": 475, \"(arr.length\": 1425, \"right[j])\": 475, \"result\": 475, \"(i\": 950, \"&&\": 2850, \"left.length\": 475, \"mid\": 1874, \"right);\\n}\\nfunction\": 475, \"math.floor(arr.length\": 475, \"/\": 4262, \"i\": 10780, \"}\": 1425, \"}\\n\": 5224, \"let\": 5224, \"mid));\\n\": 475, \"merge(left,\": 475, \"function\": 6649, \"0,\": 3286, \"(left[i]\": 475, \"result.push(right[j]);\\n\": 475, \"right)\": 950, \"{\\n\": 7599, \"mergesort(arr)\": 475, \"1)\": 1900, \"mergesort(arr.slice(0,\": 475, \"else\": 2375, \"result.push(left[i]);\\n\": 475, \"result.concat(left.slice(i)).concat(right.slice(j));\\n}\": 475, \"right.length)\": 475, \"2);\\n\": 950, \"(arr[i]\": 1887, \"===\": 3800, \"i;\\n\": 2375, \"(let\": 4274, \"linearsearch(arr,\": 475, \"i++)\": 3799, \"arr.length;\": 2375, \"-1;\\n}\": 2375, \"x)\": 3312, \"0;\": 3324, \"-\": 9844, \"binarysearch(arr,\": 475, \"mid;\\n\": 475, \"low\": 1874, \"high\": 1874, \"math.floor((low\": 475, \"(low\": 1412, \"high)\": 937, \"(arr[mid]\": 475, \"1;\\n\": 2850, \"arr.length\": 1900, \"buckets[index].append(num)\\n\\n\": 462, \"sorted_arr.extend(sorted(bucket))\\n\\n\": 462, \"\\ndef\": 1386, \"max_val\": 1386, \"[[]\": 462, \"index\": 937, \"(bucket_count\": 462, \"buckets\": 937, \"buckets:\\n\": 462, \"_\": 462, \"1))\\n\": 462, \"[]\\n\": 462, \"bucket_count\": 462, \"num\": 924, \"min_val\": 924, \"range(bucket_count)]\\n\\n\": 462, \"min_val)\": 462, \"sorted_arr\": 462, \"int((num\": 462, \"*\": 3735, \"arr\\n\\n\": 462, \"bucket\": 462, \"arr:\\n\": 924, \"sorted_arr\\n\": 462, \"(max_val\": 462, \"len(arr)\\n\": 3696, \"min(arr)\\n\": 924, \"max(arr)\\n\": 924, \"bucket_sort(arr):\\n\": 462, \"exponential_search(arr,\": 462, \"x):\\n\": 2771, \"*=\": 1874, \"n\": 6083, \"2\\n\": 1848, \"arr[0]\": 924, \"1\\n\": 3696, \"arr[i]\": 4196, \"0\\n\": 1848, \"binary_search(arr[:min(i,\": 462, \"x:\\n\": 2771, \"n)],\": 462, \"and\": 2772, \"(r\": 475, \"(l\": 475, \"arr[largest])\": 475, \"[arr[largest],\": 475, \"r\": 937, \"math.floor(n\": 475, \"2\": 937, \"arr[r]\": 937, \"(largest\": 475, \"[arr[i],\": 950, \">=\": 3299, \"arr[i]]\": 475, \"l;\\n\": 475, \"i,\": 937, \"i)\": 475, \"largest);\\n\": 475, \"arr[l]\": 937, \"arr[i]];\\n\": 950, \"l\": 937, \"!==\": 475, \"arr[largest]]\": 475, \"0);\\n\": 475, \"i--)\": 1425, \"n,\": 937, \"largest\": 937, \"2)\": 475, \"arr;\\n}\": 2374, \"arr.length;\\n\": 2849, \"arr[0]];\\n\": 475, \"heapsort(arr)\": 475, \"i);\\n\": 475, \"1;\": 2849, \"heapify(arr,\": 937, \"r;\\n\": 475, \"[arr[0],\": 475, \"2;\\n\": 950, \"arr[j]\": 1399, \"arr[min_idx]\": 462, \"i\\n\": 2309, \"range(n):\\n\": 1386, \"range(i+1,\": 462, \"min_idx\": 462, \"j\\n\": 462, \"arr[i]\\n\": 1848, \"arr[min_idx],\": 462, \"arr[min_idx]:\\n\": 462, \"arr[i],\": 924, \"n):\\n\": 462, \"selection_sort(arr):\\n\": 462, \"fib_m\": 462, \"min(offset\": 462, \"fib_m2,\": 462, \"-1\\n\": 924, \"fib_m1\": 462, \"else:\\n\": 2310, \"arr[offset\": 937, \"fibonacci_search(arr,\": 462, \"fib_m1\\n\": 462, \"elif\": 1848, \"fib_m2\\n\": 462, \"1)\\n\": 462, \"n:\\n\": 924, \"1]\": 4685, \"fib_m2\": 462, \"fib_m\\n\": 462, \"offset\": 937, \"-1\": 2309, \"10\\n\": 462, \"count[i]\": 1874, \"count[i\": 1874, \"output[count[digit]\": 937, \"1]\\n\\n\": 924, \"10):\\n\": 462, \"range(1,\": 1386, \"10\\n\\n\": 462, \"-=\": 1386, \"counting_sort_for_radix(arr,\": 462, \"exp)\": 937, \"output\": 1874, \"digit\": 937, \"count[digit]\": 462, \"-1):\\n\": 924, \"max(arr)\\n\\n\": 462, \"exp)\\n\": 462, \"radix_sort(arr):\\n\": 462, \"[0]\": 924, \"range(n\": 924, \"n\\n\": 462, \"0:\\n\": 462, \"exp):\\n\": 462, \"+=\": 3273, \"1\\n\\n\": 924, \"exp\": 937, \"-1,\": 924, \"output[i]\\n\\ndef\": 462, \"count\": 1874, \"1,\": 2336, \"%\": 937, \"1));\\n\": 475, \"b)\": 475, \"(bucketcount\": 475, \"buckets[i].sort((a,\": 475, \"bucketsort(arr)\": 475, \"sortedarray\": 475, \"}\\n\\n\": 1900, \"b);\\n\": 475, \"array(bucketcount).fill().map(()\": 475, \"sortedarray.concat(buckets[i]);\\n\": 475, \"math.min(...arr);\\n\": 950, \"arr;\\n\\n\": 475, \"a\": 475, \"min\": 950, \"new\": 1425, \"max\": 1425, \"math.max(...arr);\\n\": 950, \"[]);\\n\\n\": 475, \"(max\": 475, \"=>\": 950, \"min)\": 475, \"math.floor(arr.length);\\n\": 475, \"math.floor((arr[i]\": 475, \"\\nfunction\": 950, \"buckets[index].push(arr[i]);\\n\": 475, \"bucketcount\": 475, \"sortedarray;\\n}\\n\\n\": 475, \"buckets.length;\": 475, \"arr[j]\\n\": 924, \"0\": 937, \"arr[j\": 1411, \"insertion_sort(arr):\\n\": 462, \"key\\n\": 462, \"len(arr)):\\n\": 462, \"key\": 937, \"arr[j]:\\n\": 462, \"arr[minidx])\": 475, \"minidx\": 475, \"n;\": 949, \"[arr[minidx],\": 475, \"j++)\": 949, \"(arr[j]\": 949, \"selectionsort(arr)\": 475, \"arr[minidx]]\": 475, \"j;\\n\": 475, \"step\\n\": 462, \"min(step,\": 462, \"n)\": 1412, \"import\": 462, \"range(prev,\": 462, \"math\\ndef\": 462, \"jump_search(arr,\": 462, \"prev\": 937, \"n)):\\n\": 462, \"step\": 937, \"arr[min(step,\": 462, \"int(math.sqrt(n))\\n\": 462, \"n);\": 475, \"(prev\": 475, \"math.min(step,\": 475, \"math.floor(math.sqrt(n));\\n\": 475, \"step;\\n\": 475, \"jumpsearch(arr,\": 475, \"-1;\\n\": 1425, \"(arr[math.min(step,\": 475, \"prev;\": 475, \"fibm2;\\n\": 475, \"fibm1;\\n\": 475, \"1);\\n\": 475, \"fibm;\\n\": 475, \"fibm2,\": 475, \"fibonaccisearch(arr,\": 475, \"fibm1\": 475, \"(fibm\": 475, \"fibm\": 475, \"(fibm1\": 475, \"math.min(offset\": 475, \"fibm2\": 475, \"reversed(arr):\\n\": 462, \"len(count)):\\n\": 462, \"range_of_elements\": 462, \"range(len(arr)):\\n\": 923, \"min_val]\": 462, \"num\\n\": 462, \"range_of_elements\\n\": 462, \"count[num\": 462, \"output[i]\\n\\n\": 462, \"counting_sort(arr):\\n\": 462, \"len(arr)\\n\\n\": 462, \"output[count[num\": 462, \"arr[i];\\n\": 1425, \"output[i];\\n\": 950, \"1;\\n\\n\": 475, \"min]++;\\n\": 475, \"count[arr[i]\": 475, \"array(range).fill(0);\\n\": 475, \"count.length;\": 475, \"countingsort(arr)\": 475, \"min]\": 475, \"output[count[arr[i]\": 475, \"range\": 475, \"1];\\n\": 950, \"min]--;\\n\": 475, \"array(arr.length);\\n\\n\": 475, \"mid1\": 937, \"(right\": 462, \"right,\": 937, \"arr[mid2]\": 462, \"\\n\": 462, \"ternary_search(arr,\": 462, \"left)\": 937, \"target:\\n\": 462, \"arr[mid1]:\\n\": 462, \"target\": 462, \"mid1\\n\": 462, \"target)\\n\\n\": 462, \"arr[mid2]:\\n\": 462, \"arr[mid1]\": 462, \"3\\n\\n\": 462, \"target)\\n\": 462, \"mid2\": 937, \"target)\": 937, \"mid2\\n\\n\": 462, \"3\\n\": 462, \"target):\\n\": 462, \"-1\\n\\n\": 462, \"left,\": 937, \"right:\\n\": 462, \"right[j]\\n\": 462, \"len(left)\": 462, \"left[i]\": 462, \"right[j]:\\n\": 462, \"arr[:mid]\\n\": 462, \"arr[mid:]\\n\": 462, \"left[i]\\n\": 462, \"merge_sort(right)\\n\": 462, \"len(right):\\n\": 462, \"len(left):\\n\": 462, \"merge_sort(left)\\n\": 462, \"merge_sort(arr):\\n\": 462, \"arr[k]\": 462, \"k\": 462, \"array(arr.length);\\n\": 475, \"radixsort(arr)\": 475, \"10;\": 475, \"arr;\\n}\\n\": 475, \"math.floor(max\": 475, \"countingsortforradix(arr,\": 475, \"}\\n}\\n\\nfunction\": 475, \"math.floor(arr[i]\": 475, \"count[digit]--;\\n\": 475, \"10;\\n\": 475, \"exp);\\n\": 475, \"count[digit]++;\\n\": 475, \"10)\": 475, \"math.max(...arr);\\n\\n\": 475, \"array(10).fill(0);\\n\\n\": 475, \"x);\\n}\": 475, \"binarysearch(arr.slice(0,\": 475, \"math.min(i,\": 475, \"n)),\": 475, \"exponentialsearch(arr,\": 475, \"(arr[0]\": 475, \"interpolationsearch(arr,\": 475, \"pos;\\n\": 475, \"arr[low]\": 937, \"arr[high])\": 475, \"arr[low]));\\n\": 475, \"arr[low]))\": 475, \"low)\": 937, \"pos\": 937, \"(arr[high]\": 937, \"(x\": 937, \"(arr[pos]\": 475, \"math.floor(((high\": 475, \"l\\n\": 462, \"i:\\n\": 462, \"i)\\n\": 462, \"heap_sort(arr):\\n\": 462, \"arr[largest]:\\n\": 462, \"arr[0],\": 462, \"arr[largest],\": 462, \"r\\n\": 462, \"0)\\n\": 462, \"!=\": 462, \"arr[largest]\": 462, \"i):\\n\": 462, \"largest)\\n\": 462, \"linear_search(arr,\": 461, \"1])\": 474, \"[arr[j\": 474, \"arr[j]];\\n\": 474, \"bubblesort(arr)\": 474, \"1],\": 474, \"1]]\": 474, \"[arr[j],\": 474, \"low,\": 924, \"arr[pos]\": 462, \"arr[low])\": 462, \"((high\": 462, \"interpolation_search(arr,\": 462, \"arr[high]:\\n\": 462, \"arr[low]))\\n\": 462, \"pos\\n\": 462, \"insertionsort(arr)\": 475, \"(j\": 475, \"key;\\n\": 475, \"j--;\\n\": 475, \"arr[j];\\n\": 475, \"key)\": 475, \"arr[j+1]:\\n\": 462, \"arr[j+1],\": 462, \"bubble_sort(arr):\\n\": 462, \"arr[j+1]\": 462, \"arr[j],\": 462, \"n-i-1):\\n\": 462, \"range(0,\": 462, \"ternarysearch(arr,\": 475, \"(left\": 475, \"arr[mid2])\": 475, \"mid2;\\n\": 475, \"3);\\n\": 475, \"(target\": 475, \"(arr[mid2]\": 475, \"mid1;\\n\": 475, \"arr[mid1])\": 475, \"(arr[mid1]\": 475, \"3);\\n\\n\": 475, \"target);\\n\": 475, \"math.floor((right\": 475, \"}\\n}\\n\\n\": 475, \"arr[mid]\": 462, \"high:\\n\": 462, \"binary_search(arr,\": 462, \"mid\\n\": 462, \"quicksort(arr)\": 475, \"arr.filter(x\": 475, \"...quicksort(right)];\\n}\": 475, \"...middle,\": 475, \"2)];\\n\": 475, \"arr[math.floor(arr.length\": 475, \"[...quicksort(left),\": 475, \"pivot);\\n\": 475}", "index_docs": "{\"137\": 462, \"11\": 14990, \"65\": 2811, \"360\": 462, \"44\": 3695, \"10\": 14990, \"131\": 937, \"179\": 937, \"138\": 462, \"32\": 1874, \"6\": 12179, \"71\": 2310, \"28\": 5543, \"356\": 462, \"1\": 14529, \"136\": 1386, \"48\": 2772, \"358\": 462, \"9\": 7970, \"41\": 3234, \"25\": 5160, \"8\": 8893, \"7\": 12681, \"4\": 14990, \"109\": 1848, \"357\": 462, \"15\": 4619, \"17\": 6558, \"54\": 2811, \"359\": 462, \"22\": 3747, \"149\": 950, \"119\": 1425, \"13\": 2850, \"234\": 475, \"224\": 475, \"153\": 950, \"21\": 7021, \"232\": 475, \"118\": 1425, \"230\": 475, \"226\": 475, \"154\": 950, \"45\": 2850, \"227\": 475, \"46\": 1874, \"225\": 475, \"221\": 475, \"30\": 4262, \"2\": 10780, \"77\": 1425, \"16\": 5224, \"12\": 5224, \"223\": 475, \"151\": 475, \"23\": 6649, \"53\": 3286, \"229\": 475, \"233\": 475, \"152\": 950, \"5\": 7599, \"220\": 475, \"91\": 1900, \"222\": 475, \"42\": 2375, \"231\": 475, \"235\": 475, \"228\": 475, \"150\": 950, \"62\": 1887, \"43\": 3800, \"57\": 2375, \"18\": 4274, \"236\": 475, \"27\": 3799, \"51\": 2375, \"78\": 2375, \"20\": 3312, \"24\": 3324, \"3\": 9844, \"237\": 475, \"239\": 475, \"38\": 1874, \"39\": 1874, \"238\": 475, \"129\": 1412, \"130\": 937, \"155\": 475, \"36\": 2850, \"92\": 1900, \"371\": 462, \"376\": 462, \"139\": 1386, \"86\": 1386, \"364\": 462, \"181\": 937, \"369\": 462, \"180\": 937, \"375\": 462, \"365\": 462, \"370\": 462, \"373\": 462, \"363\": 462, \"141\": 924, \"140\": 924, \"366\": 462, \"195\": 462, \"372\": 462, \"367\": 462, \"34\": 3735, \"362\": 462, \"374\": 462, \"194\": 924, \"377\": 462, \"368\": 462, \"49\": 3696, \"192\": 924, \"193\": 924, \"361\": 462, \"378\": 462, \"75\": 2771, \"98\": 1874, \"14\": 6083, \"111\": 1848, \"196\": 924, \"19\": 3696, \"40\": 4196, \"110\": 1848, \"379\": 462, \"35\": 2771, \"380\": 462, \"56\": 2772, \"243\": 475, \"241\": 475, \"158\": 475, \"248\": 475, \"133\": 937, \"250\": 475, \"83\": 937, \"183\": 937, \"245\": 475, \"120\": 950, \"52\": 3299, \"254\": 475, \"242\": 475, \"184\": 937, \"156\": 475, \"249\": 475, \"182\": 937, \"159\": 950, \"132\": 937, \"246\": 475, \"247\": 475, \"256\": 475, \"93\": 1425, \"66\": 937, \"55\": 937, \"251\": 475, \"82\": 2374, \"61\": 2849, \"255\": 475, \"240\": 475, \"252\": 475, \"37\": 2849, \"47\": 937, \"244\": 475, \"253\": 475, \"157\": 950, \"134\": 1399, \"386\": 462, \"76\": 2309, \"112\": 1386, \"382\": 462, \"197\": 462, \"385\": 462, \"87\": 1848, \"387\": 462, \"384\": 462, \"142\": 924, \"383\": 462, \"381\": 462, \"50\": 462, \"390\": 462, \"391\": 462, \"199\": 924, \"73\": 462, \"88\": 2310, \"185\": 937, \"388\": 462, \"74\": 462, \"113\": 1848, \"143\": 462, \"392\": 462, \"198\": 924, \"31\": 4685, \"72\": 462, \"389\": 462, \"67\": 937, \"90\": 2309, \"202\": 462, \"103\": 1874, \"104\": 1874, \"186\": 937, \"204\": 924, \"395\": 462, \"144\": 1386, \"201\": 462, \"147\": 1386, \"200\": 462, \"63\": 937, \"99\": 1874, \"101\": 937, \"203\": 462, \"146\": 924, \"398\": 462, \"400\": 462, \"397\": 462, \"114\": 924, \"145\": 924, \"394\": 462, \"399\": 462, \"393\": 462, \"26\": 3273, \"89\": 924, \"84\": 937, \"205\": 924, \"396\": 462, \"100\": 1874, \"33\": 2336, \"102\": 937, \"266\": 475, \"270\": 475, \"265\": 475, \"269\": 475, \"257\": 475, \"164\": 475, \"29\": 1900, \"272\": 475, \"261\": 475, \"273\": 475, \"161\": 950, \"258\": 475, \"271\": 475, \"121\": 950, \"79\": 1425, \"94\": 1425, \"162\": 950, \"262\": 475, \"264\": 475, \"80\": 950, \"163\": 475, \"260\": 475, \"263\": 475, \"160\": 950, \"267\": 475, \"259\": 475, \"274\": 475, \"268\": 475, \"206\": 924, \"187\": 937, \"64\": 1411, \"401\": 462, \"404\": 462, \"402\": 462, \"135\": 937, \"403\": 462, \"276\": 475, \"165\": 475, \"128\": 949, \"279\": 475, \"177\": 949, \"178\": 949, \"275\": 475, \"278\": 475, \"277\": 475, \"409\": 462, \"411\": 462, \"96\": 1412, \"405\": 462, \"410\": 462, \"406\": 462, \"407\": 462, \"85\": 937, \"412\": 462, \"105\": 937, \"408\": 462, \"207\": 462, \"286\": 475, \"283\": 475, \"285\": 475, \"166\": 475, \"282\": 475, \"280\": 475, \"122\": 1425, \"281\": 475, \"284\": 475, \"123\": 475, \"60\": 475, \"291\": 475, \"288\": 475, \"290\": 475, \"287\": 475, \"81\": 475, \"167\": 475, \"59\": 475, \"292\": 475, \"289\": 475, \"58\": 475, \"418\": 462, \"417\": 462, \"414\": 462, \"219\": 923, \"148\": 462, \"420\": 462, \"415\": 462, \"208\": 462, \"421\": 462, \"413\": 462, \"416\": 462, \"419\": 462, \"124\": 1425, \"170\": 950, \"295\": 475, \"298\": 475, \"168\": 475, \"296\": 475, \"299\": 475, \"293\": 475, \"301\": 475, \"300\": 475, \"294\": 475, \"169\": 950, \"302\": 475, \"297\": 475, \"68\": 937, \"209\": 462, \"107\": 937, \"429\": 462, \"434\": 462, \"115\": 462, \"108\": 937, \"210\": 462, \"431\": 462, \"211\": 462, \"428\": 462, \"435\": 462, \"433\": 462, \"427\": 462, \"426\": 462, \"432\": 462, \"69\": 937, \"97\": 937, \"430\": 462, \"425\": 462, \"422\": 462, \"424\": 462, \"106\": 937, \"423\": 462, \"214\": 462, \"441\": 462, \"442\": 462, \"443\": 462, \"437\": 462, \"438\": 462, \"213\": 462, \"440\": 462, \"212\": 462, \"444\": 462, \"439\": 462, \"436\": 462, \"117\": 462, \"116\": 462, \"303\": 475, \"309\": 475, \"306\": 475, \"314\": 475, \"311\": 475, \"171\": 475, \"308\": 475, \"172\": 475, \"307\": 475, \"173\": 475, \"313\": 475, \"305\": 475, \"312\": 475, \"310\": 475, \"304\": 475, \"320\": 475, \"317\": 475, \"318\": 475, \"319\": 475, \"315\": 475, \"316\": 475, \"321\": 475, \"326\": 475, \"188\": 937, \"322\": 475, \"325\": 475, \"324\": 475, \"189\": 937, \"70\": 937, \"190\": 937, \"191\": 937, \"174\": 475, \"323\": 475, \"447\": 462, \"450\": 462, \"454\": 462, \"445\": 462, \"215\": 462, \"455\": 462, \"452\": 462, \"448\": 462, \"456\": 462, \"449\": 462, \"451\": 462, \"446\": 462, \"453\": 462, \"473\": 461, \"350\": 474, \"353\": 474, \"355\": 474, \"349\": 474, \"354\": 474, \"352\": 474, \"351\": 474, \"216\": 924, \"217\": 462, \"460\": 462, \"459\": 462, \"457\": 462, \"458\": 462, \"461\": 462, \"462\": 462, \"327\": 475, \"328\": 475, \"332\": 475, \"331\": 475, \"330\": 475, \"329\": 475, \"466\": 462, \"469\": 462, \"463\": 462, \"468\": 462, \"467\": 462, \"465\": 462, \"464\": 462, \"95\": 475, \"333\": 475, \"341\": 475, \"339\": 475, \"334\": 475, \"176\": 475, \"338\": 475, \"337\": 475, \"340\": 475, \"336\": 475, \"335\": 475, \"125\": 475, \"175\": 475, \"342\": 475, \"218\": 462, \"471\": 462, \"470\": 462, \"472\": 462, \"343\": 475, \"126\": 475, \"348\": 475, \"347\": 475, \"345\": 475, \"344\": 475, \"346\": 475, \"127\": 475}", "index_word": "{\"1\": \"=\", \"2\": \"i\", \"3\": \"-\", \"4\": \"return\", \"5\": \"{\\n\", \"6\": \"if\", \"7\": \"<\", \"8\": \"for\", \"9\": \"+\", \"10\": \"<start>\", \"11\": \"<end>\", \"12\": \"let\", \"13\": \"const\", \"14\": \"n\", \"15\": \"in\", \"16\": \"}\\n\", \"17\": \">\", \"18\": \"(let\", \"19\": \"1\\n\", \"20\": \"x)\", \"21\": \"while\", \"22\": \"j\", \"23\": \"function\", \"24\": \"0;\", \"25\": \"<=\", \"26\": \"+=\", \"27\": \"i++)\", \"28\": \"def\", \"29\": \"}\\n\\n\", \"30\": \"/\", \"31\": \"1]\", \"32\": \"x\", \"33\": \"1,\", \"34\": \"*\", \"35\": \"x:\\n\", \"36\": \"1;\\n\", \"37\": \"1;\", \"38\": \"low\", \"39\": \"high\", \"40\": \"arr[i]\", \"41\": \"//\", \"42\": \"else\", \"43\": \"===\", \"44\": \"==\", \"45\": \"&&\", \"46\": \"mid\", \"47\": \"heapify(arr,\", \"48\": \"arr\", \"49\": \"len(arr)\\n\", \"50\": \"fib_m\", \"51\": \"arr.length;\", \"52\": \">=\", \"53\": \"0,\", \"54\": \"left\", \"55\": \"largest\", \"56\": \"and\", \"57\": \"i;\\n\", \"58\": \"fibm2\", \"59\": \"fibm\", \"60\": \"fibm1;\\n\", \"61\": \"arr.length;\\n\", \"62\": \"(arr[i]\", \"63\": \"exp)\", \"64\": \"arr[j\", \"65\": \"right\", \"66\": \"n,\", \"67\": \"offset\", \"68\": \"mid1\", \"69\": \"mid2\", \"70\": \"pos\", \"71\": \"len(arr)\", \"72\": \"fib_m2\", \"73\": \"fib_m1\", \"74\": \"fib_m1\\n\", \"75\": \"x):\\n\", \"76\": \"i\\n\", \"77\": \"}\", \"78\": \"-1;\\n}\", \"79\": \"new\", \"80\": \"=>\", \"81\": \"fibm1\", \"82\": \"arr;\\n}\", \"83\": \"2\", \"84\": \"exp\", \"85\": \"prev\", \"86\": \"max_val\", \"87\": \"arr[i]\\n\", \"88\": \"else:\\n\", \"89\": \"1\\n\\n\", \"90\": \"-1\", \"91\": \"1)\", \"92\": \"arr.length\", \"93\": \"i--)\", \"94\": \"max\", \"95\": \"ternarysearch(arr,\", \"96\": \"n)\", \"97\": \"target)\", \"98\": \"*=\", \"99\": \"output\", \"100\": \"count\", \"101\": \"digit\", \"102\": \"%\", \"103\": \"count[i]\", \"104\": \"count[i\", \"105\": \"step\", \"106\": \"left,\", \"107\": \"right,\", \"108\": \"left)\", \"109\": \"1:\\n\", \"110\": \"0\\n\", \"111\": \"2\\n\", \"112\": \"range(n):\\n\", \"113\": \"elif\", \"114\": \"[0]\", \"115\": \"ternary_search(arr,\", \"116\": \"k\", \"117\": \"arr[k]\", \"118\": \"(arr.length\", \"119\": \"0;\\n\", \"120\": \"[arr[i],\", \"121\": \"min\", \"122\": \"-1;\\n\", \"123\": \"fibm2;\\n\", \"124\": \"arr[i];\\n\", \"125\": \"target);\\n\", \"126\": \"arr.filter(x\", \"127\": \"pivot);\\n\", \"128\": \"n;\", \"129\": \"(low\", \"130\": \"high)\", \"131\": \"middle\", \"132\": \"l\", \"133\": \"r\", \"134\": \"arr[j]\", \"135\": \"key\", \"136\": \"arr\\n\", \"137\": \"[x\", \"138\": \"pivot]\\n\", \"139\": \"\\ndef\", \"140\": \"min_val\", \"141\": \"num\", \"142\": \"arr[i],\", \"143\": \"fib_m2\\n\", \"144\": \"range(1,\", \"145\": \"range(n\", \"146\": \"-1):\\n\", \"147\": \"-=\", \"148\": \"min_val]\", \"149\": \"arr;\\n\", \"150\": \"2);\\n\", \"151\": \"merge(left,\", \"152\": \"right)\", \"153\": \"[];\\n\", \"154\": \"(i\", \"155\": \"(arr[mid]\", \"156\": \"i)\", \"157\": \"2;\\n\", \"158\": \"arr[largest])\", \"159\": \"arr[i]];\\n\", \"160\": \"\\nfunction\", \"161\": \"math.min(...arr);\\n\", \"162\": \"math.max(...arr);\\n\", \"163\": \"min)\", \"164\": \"sortedarray\", \"165\": \"minidx\", \"166\": \"math.floor(math.sqrt(n));\\n\", \"167\": \"(fibm\", \"168\": \"count[arr[i]\", \"169\": \"1];\\n\", \"170\": \"output[i];\\n\", \"171\": \"countingsortforradix(arr,\", \"172\": \"math.floor(arr[i]\", \"173\": \"10;\\n\", \"174\": \"(arr[pos]\", \"175\": \"math.floor((right\", \"176\": \"(target\", \"177\": \"j++)\", \"178\": \"(arr[j]\", \"179\": \"pivot\", \"180\": \"buckets\", \"181\": \"index\", \"182\": \"arr[l]\", \"183\": \"arr[r]\", \"184\": \"i,\", \"185\": \"arr[offset\", \"186\": \"output[count[digit]\", \"187\": \"0\", \"188\": \"arr[low]\", \"189\": \"low)\", \"190\": \"(arr[high]\", \"191\": \"(x\", \"192\": \"min(arr)\\n\", \"193\": \"max(arr)\\n\", \"194\": \"arr:\\n\", \"195\": \"min_val)\", \"196\": \"arr[0]\", \"197\": \"min_idx\", \"198\": \"n:\\n\", \"199\": \"-1\\n\", \"200\": \"counting_sort_for_radix(arr,\", \"201\": \"10\\n\\n\", \"202\": \"10\\n\", \"203\": \"count[digit]\", \"204\": \"1]\\n\\n\", \"205\": \"-1,\", \"206\": \"arr[j]\\n\", \"207\": \"int(math.sqrt(n))\\n\", \"208\": \"count[num\", \"209\": \"(right\", \"210\": \"target:\\n\", \"211\": \"target\", \"212\": \"len(right):\\n\", \"213\": \"left[i]\\n\", \"214\": \"right[j]\\n\", \"215\": \"arr[largest]:\\n\", \"216\": \"low,\", \"217\": \"arr[pos]\", \"218\": \"arr[mid]\", \"219\": \"range(len(arr)):\\n\", \"220\": \"mergesort(arr)\", \"221\": \"math.floor(arr.length\", \"222\": \"mergesort(arr.slice(0,\", \"223\": \"mid));\\n\", \"224\": \"mergesort(arr.slice(mid));\\n\", \"225\": \"right);\\n}\\nfunction\", \"226\": \"result\", \"227\": \"left.length\", \"228\": \"right.length)\", \"229\": \"(left[i]\", \"230\": \"right[j])\", \"231\": \"result.push(left[i]);\\n\", \"232\": \"i++;\\n\", \"233\": \"result.push(right[j]);\\n\", \"234\": \"j++;\\n\", \"235\": \"result.concat(left.slice(i)).concat(right.slice(j));\\n}\", \"236\": \"linearsearch(arr,\", \"237\": \"binarysearch(arr,\", \"238\": \"math.floor((low\", \"239\": \"mid;\\n\", \"240\": \"heapsort(arr)\", \"241\": \"(l\", \"242\": \"l;\\n\", \"243\": \"(r\", \"244\": \"r;\\n\", \"245\": \"(largest\", \"246\": \"!==\", \"247\": \"arr[largest]]\", \"248\": \"[arr[largest],\", \"249\": \"largest);\\n\", \"250\": \"math.floor(n\", \"251\": \"2)\", \"252\": \"i);\\n\", \"253\": \"[arr[0],\", \"254\": \"arr[i]]\", \"255\": \"arr[0]];\\n\", \"256\": \"0);\\n\", \"257\": \"bucketsort(arr)\", \"258\": \"arr;\\n\\n\", \"259\": \"bucketcount\", \"260\": \"math.floor(arr.length);\\n\", \"261\": \"array(bucketcount).fill().map(()\", \"262\": \"[]);\\n\\n\", \"263\": \"math.floor((arr[i]\", \"264\": \"(max\", \"265\": \"(bucketcount\", \"266\": \"1));\\n\", \"267\": \"buckets[index].push(arr[i]);\\n\", \"268\": \"buckets.length;\", \"269\": \"buckets[i].sort((a,\", \"270\": \"b)\", \"271\": \"a\", \"272\": \"b);\\n\", \"273\": \"sortedarray.concat(buckets[i]);\\n\", \"274\": \"sortedarray;\\n}\\n\\n\", \"275\": \"selectionsort(arr)\", \"276\": \"arr[minidx])\", \"277\": \"j;\\n\", \"278\": \"arr[minidx]]\", \"279\": \"[arr[minidx],\", \"280\": \"jumpsearch(arr,\", \"281\": \"(arr[math.min(step,\", \"282\": \"step;\\n\", \"283\": \"(prev\", \"284\": \"prev;\", \"285\": \"math.min(step,\", \"286\": \"n);\", \"287\": \"fibonaccisearch(arr,\", \"288\": \"fibm;\\n\", \"289\": \"math.min(offset\", \"290\": \"fibm2,\", \"291\": \"1);\\n\", \"292\": \"(fibm1\", \"293\": \"countingsort(arr)\", \"294\": \"range\", \"295\": \"1;\\n\\n\", \"296\": \"array(range).fill(0);\\n\", \"297\": \"array(arr.length);\\n\\n\", \"298\": \"min]++;\\n\", \"299\": \"count.length;\", \"300\": \"output[count[arr[i]\", \"301\": \"min]\", \"302\": \"min]--;\\n\", \"303\": \"array(arr.length);\\n\", \"304\": \"array(10).fill(0);\\n\\n\", \"305\": \"count[digit]++;\\n\", \"306\": \"10;\", \"307\": \"count[digit]--;\\n\", \"308\": \"}\\n}\\n\\nfunction\", \"309\": \"radixsort(arr)\", \"310\": \"math.max(...arr);\\n\\n\", \"311\": \"math.floor(max\", \"312\": \"10)\", \"313\": \"exp);\\n\", \"314\": \"arr;\\n}\\n\", \"315\": \"exponentialsearch(arr,\", \"316\": \"(arr[0]\", \"317\": \"binarysearch(arr.slice(0,\", \"318\": \"math.min(i,\", \"319\": \"n)),\", \"320\": \"x);\\n}\", \"321\": \"interpolationsearch(arr,\", \"322\": \"arr[high])\", \"323\": \"math.floor(((high\", \"324\": \"arr[low]))\", \"325\": \"arr[low]));\\n\", \"326\": \"pos;\\n\", \"327\": \"insertionsort(arr)\", \"328\": \"(j\", \"329\": \"key)\", \"330\": \"arr[j];\\n\", \"331\": \"j--;\\n\", \"332\": \"key;\\n\", \"333\": \"(left\", \"334\": \"3);\\n\", \"335\": \"3);\\n\\n\", \"336\": \"(arr[mid1]\", \"337\": \"mid1;\\n\", \"338\": \"(arr[mid2]\", \"339\": \"mid2;\\n\", \"340\": \"arr[mid1])\", \"341\": \"arr[mid2])\", \"342\": \"}\\n}\\n\\n\", \"343\": \"quicksort(arr)\", \"344\": \"arr[math.floor(arr.length\", \"345\": \"2)];\\n\", \"346\": \"[...quicksort(left),\", \"347\": \"...middle,\", \"348\": \"...quicksort(right)];\\n}\", \"349\": \"bubblesort(arr)\", \"350\": \"1])\", \"351\": \"[arr[j],\", \"352\": \"1]]\", \"353\": \"[arr[j\", \"354\": \"1],\", \"355\": \"arr[j]];\\n\", \"356\": \"quick_sort(arr):\\n\", \"357\": \"arr[len(arr)\", \"358\": \"2]\\n\", \"359\": \"quick_sort(left)\", \"360\": \"quick_sort(right)\", \"361\": \"bucket_sort(arr):\\n\", \"362\": \"arr\\n\\n\", \"363\": \"bucket_count\", \"364\": \"[[]\", \"365\": \"_\", \"366\": \"range(bucket_count)]\\n\\n\", \"367\": \"int((num\", \"368\": \"(max_val\", \"369\": \"(bucket_count\", \"370\": \"1))\\n\", \"371\": \"buckets[index].append(num)\\n\\n\", \"372\": \"sorted_arr\", \"373\": \"[]\\n\", \"374\": \"bucket\", \"375\": \"buckets:\\n\", \"376\": \"sorted_arr.extend(sorted(bucket))\\n\\n\", \"377\": \"sorted_arr\\n\", \"378\": \"exponential_search(arr,\", \"379\": \"binary_search(arr[:min(i,\", \"380\": \"n)],\", \"381\": \"selection_sort(arr):\\n\", \"382\": \"range(i+1,\", \"383\": \"n):\\n\", \"384\": \"arr[min_idx]:\\n\", \"385\": \"j\\n\", \"386\": \"arr[min_idx]\", \"387\": \"arr[min_idx],\", \"388\": \"fibonacci_search(arr,\", \"389\": \"fib_m\\n\", \"390\": \"min(offset\", \"391\": \"fib_m2,\", \"392\": \"1)\\n\", \"393\": \"exp):\\n\", \"394\": \"n\\n\", \"395\": \"10):\\n\", \"396\": \"output[i]\\n\\ndef\", \"397\": \"radix_sort(arr):\\n\", \"398\": \"max(arr)\\n\\n\", \"399\": \"0:\\n\", \"400\": \"exp)\\n\", \"401\": \"insertion_sort(arr):\\n\", \"402\": \"len(arr)):\\n\", \"403\": \"arr[j]:\\n\", \"404\": \"key\\n\", \"405\": \"import\", \"406\": \"math\\ndef\", \"407\": \"jump_search(arr,\", \"408\": \"arr[min(step,\", \"409\": \"step\\n\", \"410\": \"range(prev,\", \"411\": \"min(step,\", \"412\": \"n)):\\n\", \"413\": \"counting_sort(arr):\\n\", \"414\": \"range_of_elements\", \"415\": \"range_of_elements\\n\", \"416\": \"len(arr)\\n\\n\", \"417\": \"len(count)):\\n\", \"418\": \"reversed(arr):\\n\", \"419\": \"output[count[num\", \"420\": \"num\\n\", \"421\": \"output[i]\\n\\n\", \"422\": \"target):\\n\", \"423\": \"right:\\n\", \"424\": \"-1\\n\\n\", \"425\": \"3\\n\", \"426\": \"3\\n\\n\", \"427\": \"arr[mid1]\", \"428\": \"mid1\\n\", \"429\": \"arr[mid2]\", \"430\": \"mid2\\n\\n\", \"431\": \"arr[mid1]:\\n\", \"432\": \"target)\\n\", \"433\": \"arr[mid2]:\\n\", \"434\": \"\\n\", \"435\": \"target)\\n\\n\", \"436\": \"merge_sort(arr):\\n\", \"437\": \"arr[:mid]\\n\", \"438\": \"arr[mid:]\\n\", \"439\": \"merge_sort(left)\\n\", \"440\": \"merge_sort(right)\\n\", \"441\": \"len(left)\", \"442\": \"left[i]\", \"443\": \"right[j]:\\n\", \"444\": \"len(left):\\n\", \"445\": \"heap_sort(arr):\\n\", \"446\": \"i):\\n\", \"447\": \"l\\n\", \"448\": \"r\\n\", \"449\": \"!=\", \"450\": \"i:\\n\", \"451\": \"arr[largest]\", \"452\": \"arr[largest],\", \"453\": \"largest)\\n\", \"454\": \"i)\\n\", \"455\": \"arr[0],\", \"456\": \"0)\\n\", \"457\": \"interpolation_search(arr,\", \"458\": \"arr[high]:\\n\", \"459\": \"((high\", \"460\": \"arr[low])\", \"461\": \"arr[low]))\\n\", \"462\": \"pos\\n\", \"463\": \"bubble_sort(arr):\\n\", \"464\": \"range(0,\", \"465\": \"n-i-1):\\n\", \"466\": \"arr[j+1]:\\n\", \"467\": \"arr[j],\", \"468\": \"arr[j+1]\", \"469\": \"arr[j+1],\", \"470\": \"binary_search(arr,\", \"471\": \"high:\\n\", \"472\": \"mid\\n\", \"473\": \"linear_search(arr,\"}", "word_index": "{\"=\": 1, \"i\": 2, \"-\": 3, \"return\": 4, \"{\\n\": 5, \"if\": 6, \"<\": 7, \"for\": 8, \"+\": 9, \"<start>\": 10, \"<end>\": 11, \"let\": 12, \"const\": 13, \"n\": 14, \"in\": 15, \"}\\n\": 16, \">\": 17, \"(let\": 18, \"1\\n\": 19, \"x)\": 20, \"while\": 21, \"j\": 22, \"function\": 23, \"0;\": 24, \"<=\": 25, \"+=\": 26, \"i++)\": 27, \"def\": 28, \"}\\n\\n\": 29, \"/\": 30, \"1]\": 31, \"x\": 32, \"1,\": 33, \"*\": 34, \"x:\\n\": 35, \"1;\\n\": 36, \"1;\": 37, \"low\": 38, \"high\": 39, \"arr[i]\": 40, \"//\": 41, \"else\": 42, \"===\": 43, \"==\": 44, \"&&\": 45, \"mid\": 46, \"heapify(arr,\": 47, \"arr\": 48, \"len(arr)\\n\": 49, \"fib_m\": 50, \"arr.length;\": 51, \">=\": 52, \"0,\": 53, \"left\": 54, \"largest\": 55, \"and\": 56, \"i;\\n\": 57, \"fibm2\": 58, \"fibm\": 59, \"fibm1;\\n\": 60, \"arr.length;\\n\": 61, \"(arr[i]\": 62, \"exp)\": 63, \"arr[j\": 64, \"right\": 65, \"n,\": 66, \"offset\": 67, \"mid1\": 68, \"mid2\": 69, \"pos\": 70, \"len(arr)\": 71, \"fib_m2\": 72, \"fib_m1\": 73, \"fib_m1\\n\": 74, \"x):\\n\": 75, \"i\\n\": 76, \"}\": 77, \"-1;\\n}\": 78, \"new\": 79, \"=>\": 80, \"fibm1\": 81, \"arr;\\n}\": 82, \"2\": 83, \"exp\": 84, \"prev\": 85, \"max_val\": 86, \"arr[i]\\n\": 87, \"else:\\n\": 88, \"1\\n\\n\": 89, \"-1\": 90, \"1)\": 91, \"arr.length\": 92, \"i--)\": 93, \"max\": 94, \"ternarysearch(arr,\": 95, \"n)\": 96, \"target)\": 97, \"*=\": 98, \"output\": 99, \"count\": 100, \"digit\": 101, \"%\": 102, \"count[i]\": 103, \"count[i\": 104, \"step\": 105, \"left,\": 106, \"right,\": 107, \"left)\": 108, \"1:\\n\": 109, \"0\\n\": 110, \"2\\n\": 111, \"range(n):\\n\": 112, \"elif\": 113, \"[0]\": 114, \"ternary_search(arr,\": 115, \"k\": 116, \"arr[k]\": 117, \"(arr.length\": 118, \"0;\\n\": 119, \"[arr[i],\": 120, \"min\": 121, \"-1;\\n\": 122, \"fibm2;\\n\": 123, \"arr[i];\\n\": 124, \"target);\\n\": 125, \"arr.filter(x\": 126, \"pivot);\\n\": 127, \"n;\": 128, \"(low\": 129, \"high)\": 130, \"middle\": 131, \"l\": 132, \"r\": 133, \"arr[j]\": 134, \"key\": 135, \"arr\\n\": 136, \"[x\": 137, \"pivot]\\n\": 138, \"\\ndef\": 139, \"min_val\": 140, \"num\": 141, \"arr[i],\": 142, \"fib_m2\\n\": 143, \"range(1,\": 144, \"range(n\": 145, \"-1):\\n\": 146, \"-=\": 147, \"min_val]\": 148, \"arr;\\n\": 149, \"2);\\n\": 150, \"merge(left,\": 151, \"right)\": 152, \"[];\\n\": 153, \"(i\": 154, \"(arr[mid]\": 155, \"i)\": 156, \"2;\\n\": 157, \"arr[largest])\": 158, \"arr[i]];\\n\": 159, \"\\nfunction\": 160, \"math.min(...arr);\\n\": 161, \"math.max(...arr);\\n\": 162, \"min)\": 163, \"sortedarray\": 164, \"minidx\": 165, \"math.floor(math.sqrt(n));\\n\": 166, \"(fibm\": 167, \"count[arr[i]\": 168, \"1];\\n\": 169, \"output[i];\\n\": 170, \"countingsortforradix(arr,\": 171, \"math.floor(arr[i]\": 172, \"10;\\n\": 173, \"(arr[pos]\": 174, \"math.floor((right\": 175, \"(target\": 176, \"j++)\": 177, \"(arr[j]\": 178, \"pivot\": 179, \"buckets\": 180, \"index\": 181, \"arr[l]\": 182, \"arr[r]\": 183, \"i,\": 184, \"arr[offset\": 185, \"output[count[digit]\": 186, \"0\": 187, \"arr[low]\": 188, \"low)\": 189, \"(arr[high]\": 190, \"(x\": 191, \"min(arr)\\n\": 192, \"max(arr)\\n\": 193, \"arr:\\n\": 194, \"min_val)\": 195, \"arr[0]\": 196, \"min_idx\": 197, \"n:\\n\": 198, \"-1\\n\": 199, \"counting_sort_for_radix(arr,\": 200, \"10\\n\\n\": 201, \"10\\n\": 202, \"count[digit]\": 203, \"1]\\n\\n\": 204, \"-1,\": 205, \"arr[j]\\n\": 206, \"int(math.sqrt(n))\\n\": 207, \"count[num\": 208, \"(right\": 209, \"target:\\n\": 210, \"target\": 211, \"len(right):\\n\": 212, \"left[i]\\n\": 213, \"right[j]\\n\": 214, \"arr[largest]:\\n\": 215, \"low,\": 216, \"arr[pos]\": 217, \"arr[mid]\": 218, \"range(len(arr)):\\n\": 219, \"mergesort(arr)\": 220, \"math.floor(arr.length\": 221, \"mergesort(arr.slice(0,\": 222, \"mid));\\n\": 223, \"mergesort(arr.slice(mid));\\n\": 224, \"right);\\n}\\nfunction\": 225, \"result\": 226, \"left.length\": 227, \"right.length)\": 228, \"(left[i]\": 229, \"right[j])\": 230, \"result.push(left[i]);\\n\": 231, \"i++;\\n\": 232, \"result.push(right[j]);\\n\": 233, \"j++;\\n\": 234, \"result.concat(left.slice(i)).concat(right.slice(j));\\n}\": 235, \"linearsearch(arr,\": 236, \"binarysearch(arr,\": 237, \"math.floor((low\": 238, \"mid;\\n\": 239, \"heapsort(arr)\": 240, \"(l\": 241, \"l;\\n\": 242, \"(r\": 243, \"r;\\n\": 244, \"(largest\": 245, \"!==\": 246, \"arr[largest]]\": 247, \"[arr[largest],\": 248, \"largest);\\n\": 249, \"math.floor(n\": 250, \"2)\": 251, \"i);\\n\": 252, \"[arr[0],\": 253, \"arr[i]]\": 254, \"arr[0]];\\n\": 255, \"0);\\n\": 256, \"bucketsort(arr)\": 257, \"arr;\\n\\n\": 258, \"bucketcount\": 259, \"math.floor(arr.length);\\n\": 260, \"array(bucketcount).fill().map(()\": 261, \"[]);\\n\\n\": 262, \"math.floor((arr[i]\": 263, \"(max\": 264, \"(bucketcount\": 265, \"1));\\n\": 266, \"buckets[index].push(arr[i]);\\n\": 267, \"buckets.length;\": 268, \"buckets[i].sort((a,\": 269, \"b)\": 270, \"a\": 271, \"b);\\n\": 272, \"sortedarray.concat(buckets[i]);\\n\": 273, \"sortedarray;\\n}\\n\\n\": 274, \"selectionsort(arr)\": 275, \"arr[minidx])\": 276, \"j;\\n\": 277, \"arr[minidx]]\": 278, \"[arr[minidx],\": 279, \"jumpsearch(arr,\": 280, \"(arr[math.min(step,\": 281, \"step;\\n\": 282, \"(prev\": 283, \"prev;\": 284, \"math.min(step,\": 285, \"n);\": 286, \"fibonaccisearch(arr,\": 287, \"fibm;\\n\": 288, \"math.min(offset\": 289, \"fibm2,\": 290, \"1);\\n\": 291, \"(fibm1\": 292, \"countingsort(arr)\": 293, \"range\": 294, \"1;\\n\\n\": 295, \"array(range).fill(0);\\n\": 296, \"array(arr.length);\\n\\n\": 297, \"min]++;\\n\": 298, \"count.length;\": 299, \"output[count[arr[i]\": 300, \"min]\": 301, \"min]--;\\n\": 302, \"array(arr.length);\\n\": 303, \"array(10).fill(0);\\n\\n\": 304, \"count[digit]++;\\n\": 305, \"10;\": 306, \"count[digit]--;\\n\": 307, \"}\\n}\\n\\nfunction\": 308, \"radixsort(arr)\": 309, \"math.max(...arr);\\n\\n\": 310, \"math.floor(max\": 311, \"10)\": 312, \"exp);\\n\": 313, \"arr;\\n}\\n\": 314, \"exponentialsearch(arr,\": 315, \"(arr[0]\": 316, \"binarysearch(arr.slice(0,\": 317, \"math.min(i,\": 318, \"n)),\": 319, \"x);\\n}\": 320, \"interpolationsearch(arr,\": 321, \"arr[high])\": 322, \"math.floor(((high\": 323, \"arr[low]))\": 324, \"arr[low]));\\n\": 325, \"pos;\\n\": 326, \"insertionsort(arr)\": 327, \"(j\": 328, \"key)\": 329, \"arr[j];\\n\": 330, \"j--;\\n\": 331, \"key;\\n\": 332, \"(left\": 333, \"3);\\n\": 334, \"3);\\n\\n\": 335, \"(arr[mid1]\": 336, \"mid1;\\n\": 337, \"(arr[mid2]\": 338, \"mid2;\\n\": 339, \"arr[mid1])\": 340, \"arr[mid2])\": 341, \"}\\n}\\n\\n\": 342, \"quicksort(arr)\": 343, \"arr[math.floor(arr.length\": 344, \"2)];\\n\": 345, \"[...quicksort(left),\": 346, \"...middle,\": 347, \"...quicksort(right)];\\n}\": 348, \"bubblesort(arr)\": 349, \"1])\": 350, \"[arr[j],\": 351, \"1]]\": 352, \"[arr[j\": 353, \"1],\": 354, \"arr[j]];\\n\": 355, \"quick_sort(arr):\\n\": 356, \"arr[len(arr)\": 357, \"2]\\n\": 358, \"quick_sort(left)\": 359, \"quick_sort(right)\": 360, \"bucket_sort(arr):\\n\": 361, \"arr\\n\\n\": 362, \"bucket_count\": 363, \"[[]\": 364, \"_\": 365, \"range(bucket_count)]\\n\\n\": 366, \"int((num\": 367, \"(max_val\": 368, \"(bucket_count\": 369, \"1))\\n\": 370, \"buckets[index].append(num)\\n\\n\": 371, \"sorted_arr\": 372, \"[]\\n\": 373, \"bucket\": 374, \"buckets:\\n\": 375, \"sorted_arr.extend(sorted(bucket))\\n\\n\": 376, \"sorted_arr\\n\": 377, \"exponential_search(arr,\": 378, \"binary_search(arr[:min(i,\": 379, \"n)],\": 380, \"selection_sort(arr):\\n\": 381, \"range(i+1,\": 382, \"n):\\n\": 383, \"arr[min_idx]:\\n\": 384, \"j\\n\": 385, \"arr[min_idx]\": 386, \"arr[min_idx],\": 387, \"fibonacci_search(arr,\": 388, \"fib_m\\n\": 389, \"min(offset\": 390, \"fib_m2,\": 391, \"1)\\n\": 392, \"exp):\\n\": 393, \"n\\n\": 394, \"10):\\n\": 395, \"output[i]\\n\\ndef\": 396, \"radix_sort(arr):\\n\": 397, \"max(arr)\\n\\n\": 398, \"0:\\n\": 399, \"exp)\\n\": 400, \"insertion_sort(arr):\\n\": 401, \"len(arr)):\\n\": 402, \"arr[j]:\\n\": 403, \"key\\n\": 404, \"import\": 405, \"math\\ndef\": 406, \"jump_search(arr,\": 407, \"arr[min(step,\": 408, \"step\\n\": 409, \"range(prev,\": 410, \"min(step,\": 411, \"n)):\\n\": 412, \"counting_sort(arr):\\n\": 413, \"range_of_elements\": 414, \"range_of_elements\\n\": 415, \"len(arr)\\n\\n\": 416, \"len(count)):\\n\": 417, \"reversed(arr):\\n\": 418, \"output[count[num\": 419, \"num\\n\": 420, \"output[i]\\n\\n\": 421, \"target):\\n\": 422, \"right:\\n\": 423, \"-1\\n\\n\": 424, \"3\\n\": 425, \"3\\n\\n\": 426, \"arr[mid1]\": 427, \"mid1\\n\": 428, \"arr[mid2]\": 429, \"mid2\\n\\n\": 430, \"arr[mid1]:\\n\": 431, \"target)\\n\": 432, \"arr[mid2]:\\n\": 433, \"\\n\": 434, \"target)\\n\\n\": 435, \"merge_sort(arr):\\n\": 436, \"arr[:mid]\\n\": 437, \"arr[mid:]\\n\": 438, \"merge_sort(left)\\n\": 439, \"merge_sort(right)\\n\": 440, \"len(left)\": 441, \"left[i]\": 442, \"right[j]:\\n\": 443, \"len(left):\\n\": 444, \"heap_sort(arr):\\n\": 445, \"i):\\n\": 446, \"l\\n\": 447, \"r\\n\": 448, \"!=\": 449, \"i:\\n\": 450, \"arr[largest]\": 451, \"arr[largest],\": 452, \"largest)\\n\": 453, \"i)\\n\": 454, \"arr[0],\": 455, \"0)\\n\": 456, \"interpolation_search(arr,\": 457, \"arr[high]:\\n\": 458, \"((high\": 459, \"arr[low])\": 460, \"arr[low]))\\n\": 461, \"pos\\n\": 462, \"bubble_sort(arr):\\n\": 463, \"range(0,\": 464, \"n-i-1):\\n\": 465, \"arr[j+1]:\\n\": 466, \"arr[j],\": 467, \"arr[j+1]\": 468, \"arr[j+1],\": 469, \"binary_search(arr,\": 470, \"high:\\n\": 471, \"mid\\n\": 472, \"linear_search(arr,\": 473}"}}