{"class_name": "Tokenizer", "config": {"num_words": null, "filters": "", "lower": true, "split": " ", "char_level": false, "oov_token": null, "document_count": 31714, "word_counts": "{\"<start>\": 31714, \"console.log(\\\"hola\": 216, \"mundo\\\");\": 216, \"<end>\": 31714, \"print(\\\"hola\": 215, \"mundo\\\")\": 215, \"x\": 11287, \"=\": 80665, \"true\": 168, \"1.50\": 336, \"let\": 1561, \"false;\": 177, \"1.50;\": 354, \"'a';\": 177, \"5\": 168, \"\\\"hola\": 345, \"mundo\\\";\": 177, \"mundo\\\"\": 168, \"5;\": 480, \"'a'\": 168, \"const\": 3468, \"['a','b','c','d']\": 141, \"arreglo\": 421, \"[1,3,5,7];\": 141, \"[1.0,1.2,1.3,1.5];\": 280, \"[1.0,1.2,1.3,1.5]\": 281, \"[\\\"esto\\\",\\\"es\\\",\\\"un\\\",\\\"arreglo\\\"];\": 141, \"['a','b','c','d'];\": 141, \"[1,3,5,7]\": 141, \"[\\\"esto\\\",\\\"es\\\",\\\"un\\\",\\\"arreglo\\\"]\": 140, \"[[1.2,2.3],[3.4,4.5],[5.6,6.7]]\": 282, \"mat\": 141, \"[[1,\": 141, \"2],[3,\": 141, \"4],[5,\": 141, \"6]];\": 141, \"[[1,2],[3,4],[5,6]]\": 139, \"[['a','b'],['c','d'],['e','f']]\": 141, \"[[1.3,2.5],[3.6,4.5],[5.8,6.9]];\": 282, \"[[\\\"nivel\": 282, \"uno\\\",\\\"nivel\": 282, \"dos\\\"],[\\\"nivel\": 282, \"tres\\\",\\\"nivel\": 282, \"cuatro\\\"],[\\\"nivel\": 282, \"cinco\\\",\\\"nivel\": 282, \"seis\\\"]]\": 141, \"seis\\\"]];\": 141, \"[['a','b'],['c','d'],['e','f']];\": 141, \"for\": 5306, \"i\": 20441, \"in\": 7025, \"range(5):\\\\n\\\\tprint(f'iteraci\\u00f3n\": 302, \"{i}')\": 302, \"condition\": 1218, \"true;\\\\ndo\": 305, \"{\\\\n\\\\tconsole.log('ejecutar\": 610, \"al\": 1218, \"menos\": 1218, \"una\": 1218, \"vez');\\\\n}\": 610, \"while\": 3908, \"(condition);\": 610, \"false;\\\\ndo\": 305, \"false\\\\nwhile\": 301, \"true:\\\\n\\\\tprint('ejecutar\": 608, \"vez')\\\\n\\\\tif\": 608, \"condition:\\\\n\\\\t\\\\tbreak\": 608, \"(let\": 5247, \"0;\": 4084, \"<\": 23588, \"i++)\": 2846, \"{\\\\n\\\\tconsole.log(`iteraci\\u00f3n\": 303, \"${i}`);\\\\n}\": 303, \"true\\\\nwhile\": 307, \"not\": 307, \"a\": 2901, \"33\\\\nb\": 1147, \"200\\\\nif\": 973, \"b\": 2638, \">=\": 3552, \"a:\\\\n\\\\tprint(\\\"b\": 1321, \"es\": 2428, \"igual\": 875, \"o\": 583, \"mayor\": 1102, \"que\": 1613, \"a\\\")\": 973, \"hora\": 1325, \"5;\\\\nif\": 977, \"(hora\": 1673, \"<=\": 7603, \"18)\": 977, \"{\\\\n\\\\tconsole.log(\\\"no\": 391, \"son\": 1226, \"mas\": 293, \"de\": 2597, \"las\": 780, \"18\": 932, \"horas!\\\");\\\\n}else\": 195, \"{\\\\n\\\\tconsole.log(\\\"ya\": 291, \"m\\u00e1s\": 291, \"horas!\\\");\\\\n}\": 389, \"menor\": 588, \"{\\\\n\\\\tconsole.log(\\\"buenos\": 196, \"d\\u00edas!\\\");\\\\n}\": 196, \"else\": 3453, \"{\\\\n\\\\tconsole.log(\\\"buenas\": 490, \"noches!\\\");\\\\n}\": 294, \"a\\\")\\\\nelse:\\\\n\\\\tprint(\\\"b\": 390, \"no\": 585, \"==\": 5469, \">\": 9589, \"noche\": 98, \"todav\\u00eda.\\\");\\\\n}\": 98, \"===\": 5130, \"noches!,\": 196, \"18\\\");\\\\n}\": 196, \"a\\\")\\\\n\\\\tprint(\\\"b\": 97, \"{\\\\n\\\\tconsole.log(\\\"hola,\": 98, \"la\": 1798, \"18!\\\");\\\\n}\": 98, \"10;\\\\nif\": 348, \"10)\": 348, \"{\\\\n\\\\tsaludo\": 870, \"\\\"buenos\": 348, \"dias\\\";\\\\n}\": 348, \"if\": 9028, \"20)\": 348, \"\\\"buenas\": 522, \"tardes\\\";\\\\n}\": 348, \"noches\\\";\\\\n}\": 174, \"33\\\\nif\": 348, \"a\\\")\\\\nelif\": 348, \"b:\\\\n\\\\tprint(\\\"a\": 348, \"y\": 348, \"iguales\\\")\": 174, \"200\\\\nb\": 174, \"iguales\\\")\\\\nelse:\\\\n\\\\tprint(\\\"a\": 174, \"b\\\")\": 174, \"edad\": 696, \"18\\\\nmensaje\": 174, \"\\\"mayor\": 348, \"edad\\\"\": 348, \"\\\"menor\": 348, \"edad\\\"\\\\nprint(mensaje)\": 174, \"18;\\\\nconst\": 174, \"mensaje\": 174, \"?\": 174, \":\": 174, \"edad\\\";\\\\nconsole.log(mensaje);\": 174, \"valor\": 348, \"\\\"b\\\"\\\\nmatch\": 174, \"valor:\\\\n\\\\tcase\": 174, \"\\\"a\\\":\\\\n\\\\t\\\\tprint(\\\"es\": 174, \"letra\": 1044, \"a\\\")\\\\n\\\\tcase\": 174, \"\\\"b\\\":\\\\n\\\\t\\\\tprint(\\\"es\": 174, \"b\\\")\\\\n\\\\tcase\": 174, \"\\\"c\\\":\\\\n\\\\t\\\\tprint(\\\"es\": 174, \"c\\\")\\\\n\\\\tcase\": 174, \"_:\\\\n\\\\t\\\\tprint(\\\"no\": 174, \"a,\": 658, \"ni\": 348, \"c\\\")\\\\n\": 174, \"\\\"b\\\";\\\\nswitch\": 174, \"(valor)\": 174, \"{\\\\n\\\\tcase\": 174, \"\\\"a\\\":\\\\n\\\\t\\\\tconsole.log(\\\"es\": 174, \"a\\\");\\\\n\\\\t\\\\tbreak;\\\\n\\\\tcase\": 174, \"\\\"b\\\":\\\\n\\\\t\\\\tconsole.log(\\\"es\": 174, \"b\\\");\\\\n\\\\t\\\\tbreak;\\\\n\\\\tcase\": 174, \"\\\"c\\\":\\\\n\\\\t\\\\tconsole.log(\\\"es\": 174, \"c\\\");\\\\n\\\\t\\\\tbreak;\\\\n\\\\tdefault:\\\\n\\\\t\\\\tconsole.log(\\\"no\": 174, \"c\\\");\\\\n}\": 174, \"function\": 4239, \"linearsearch(arr,\": 268, \"x)\": 10442, \"{\\\\n\\\\tfor\": 587, \"arr.length;\": 808, \"{\\\\n\\\\t\\\\tif\": 1115, \"(arr[i]\": 3177, \"return\": 7415, \"i;\\\\n\\\\t}\\\\n\\\\treturn\": 539, \"-1;\\\\n}\": 1341, \"jumpsearch(arr,\": 271, \"{\\\\n\\\\tlet\": 2763, \"n\": 7977, \"arr.length;\\\\n\\\\tlet\": 541, \"step\": 271, \"math.floor(math.sqrt(n));\\\\n\\\\tlet\": 271, \"prev\": 1122, \"0;\\\\n\\\\twhile\": 557, \"(arr[math.min(step,\": 544, \"n)\": 2431, \"-\": 18540, \"1]\": 3299, \"{\\\\n\\\\t\\\\tprev\": 271, \"step;\\\\n\\\\t\\\\tstep\": 271, \"+=\": 6148, \"math.floor(math.sqrt(n));\\\\n\\\\t\\\\tif\": 271, \"(prev\": 817, \"-1;\\\\n\\\\t}\\\\n\\\\tfor\": 271, \"prev;\": 544, \"math.min(step,\": 544, \"n);\": 544, \"def\": 3885, \"fibonacci_search(arr,\": 264, \"x):\\\\n\\\\tfib_m2\": 264, \"0\\\\n\\\\tfib_m1\": 264, \"1\\\\n\\\\tfib_m\": 264, \"fib_m2\": 775, \"+\": 17821, \"fib_m1\\\\n\\\\tn\": 264, \"len(arr)\\\\n\\\\twhile\": 264, \"fib_m\": 2622, \"n:\\\\n\\\\t\\\\tfib_m2\": 264, \"fib_m1\\\\n\\\\t\\\\tfib_m1\": 511, \"fib_m\\\\n\\\\t\\\\tfib_m\": 264, \"fib_m1\\\\n\\\\toffset\": 553, \"-1\\\\n\\\\twhile\": 264, \"1:\\\\n\\\\t\\\\ti\": 264, \"min(offset\": 511, \"fib_m2,\": 511, \"1)\\\\n\\\\t\\\\tif\": 264, \"arr[i]\": 4314, \"x:\\\\n\\\\t\\\\t\\\\tfib_m\": 528, \"fib_m1\\\\n\\\\t\\\\t\\\\tfib_m1\": 264, \"fib_m2\\\\n\\\\t\\\\t\\\\tfib_m2\": 528, \"fib_m1\\\\n\\\\t\\\\t\\\\toffset\": 264, \"i\\\\n\\\\t\\\\telif\": 264, \"fib_m2\\\\n\\\\t\\\\t\\\\tfib_m1\": 264, \"fib_m1\": 1353, \"fib_m1\\\\n\\\\t\\\\telse:\\\\n\\\\t\\\\t\\\\treturn\": 264, \"i\\\\n\\\\tif\": 264, \"and\": 3681, \"arr[offset\": 1093, \"x:\\\\n\\\\t\\\\treturn\": 1612, \"offset\": 1593, \"1\\\\n\\\\treturn\": 1081, \"-1\": 1344, \"interpolation_search(arr,\": 267, \"x):\\\\n\\\\tlow,\": 541, \"high\": 3770, \"0,\": 2231, \"len(arr)\": 2303, \"1\\\\n\\\\twhile\": 792, \"low\": 4323, \"arr[low]\": 1071, \"arr[high]:\\\\n\\\\t\\\\tpos\": 267, \"((high\": 541, \"low)\": 1071, \"//\": 2869, \"(arr[high]\": 1071, \"arr[low])\": 541, \"*\": 4109, \"(x\": 1071, \"arr[low]))\\\\n\\\\t\\\\tif\": 267, \"arr[pos]\": 1620, \"x:\\\\n\\\\t\\\\t\\\\treturn\": 1080, \"pos\\\\n\\\\t\\\\telif\": 267, \"x:\\\\n\\\\t\\\\t\\\\tlow\": 541, \"pos\": 3734, \"1\\\\n\\\\t\\\\telse:\\\\n\\\\t\\\\t\\\\thigh\": 541, \"binarysearch(arr,\": 278, \"arr.length\": 536, \"1;\\\\n\\\\twhile\": 806, \"(low\": 1634, \"high)\": 1655, \"{\\\\n\\\\t\\\\tlet\": 1946, \"mid\": 4139, \"math.floor((low\": 551, \"/\": 2592, \"2);\\\\n\\\\t\\\\tif\": 278, \"(arr[mid]\": 1660, \"mid;\\\\n\\\\t\\\\telse\": 278, \"1;\\\\n\\\\t\\\\telse\": 536, \"1;\\\\n\\\\t}\\\\n\\\\treturn\": 536, \"quicksort(arr)\": 283, \"{\\\\n\\\\tif\": 1677, \"(arr.length\": 1234, \"1)\": 1734, \"arr;\\\\n\\\\tconst\": 569, \"pivot\": 620, \"arr[math.floor(arr.length\": 620, \"2)];\\\\n\\\\tconst\": 283, \"left\": 906, \"arr.filter(x\": 1860, \"=>\": 1860, \"pivot);\\\\n\\\\tconst\": 566, \"middle\": 1204, \"right\": 906, \"pivot);\\\\n\\\\treturn\": 283, \"[...quicksort(left),\": 620, \"...middle,\": 620, \"...quicksort(right)];\\\\n}\": 283, \"bubblesort(arr)\": 276, \"{\\\\n\\\\t\\\\t\": 1104, \"arr.length;\\\\n\\\\t\\\\t\": 276, \"n;\": 1787, \"j\": 6767, \"1;\": 3492, \"j++)\": 1191, \"(arr[j]\": 1186, \"arr[j\": 1174, \"1])\": 587, \"[arr[j],\": 276, \"1]]\": 587, \"[arr[j\": 587, \"1],\": 587, \"arr[j]];\\\\n\\\\t\\\\t\": 276, \"}\\\\n\\\\t\\\\t\": 828, \"arr;\\\\n\\\\t\\\\t\": 276, \"}\": 276, \"merge_sort(arr):\\\\n\\\\tif\": 276, \"1:\\\\n\\\\t\\\\tmid\": 276, \"2\\\\n\\\\t\\\\tleft\": 276, \"arr[:mid]\\\\n\\\\t\\\\tright\": 276, \"arr[mid:]\\\\n\\\\t\\\\tmerge_sort(left)\\\\n\\\\t\\\\tmerge_sort(right)\\\\n\\\\t\\\\ti\": 276, \"k\": 589, \"0\\\\n\\\\t\\\\twhile\": 276, \"len(left)\": 585, \"len(right):\\\\n\\\\t\\\\t\\\\tif\": 276, \"left[i]\": 898, \"right[j]:\\\\n\\\\t\\\\t\\\\t\\\\tarr[k]\": 276, \"left[i]\\\\n\\\\t\\\\t\\\\t\\\\ti\": 276, \"1\\\\n\\\\t\\\\t\\\\telse:\\\\n\\\\t\\\\t\\\\t\\\\tarr[k]\": 276, \"right[j]\\\\n\\\\t\\\\t\\\\t\\\\tj\": 276, \"1\\\\n\\\\t\\\\t\\\\tk\": 828, \"1\\\\n\\\\t\\\\twhile\": 552, \"len(left):\\\\n\\\\t\\\\t\\\\tarr[k]\": 276, \"left[i]\\\\n\\\\t\\\\t\\\\ti\": 276, \"len(right):\\\\n\\\\t\\\\t\\\\tarr[k]\": 276, \"right[j]\\\\n\\\\t\\\\t\\\\tj\": 276, \"arr\": 3772, \"heapsort(arr)\": 288, \"{\\\\n\\\\tfunction\": 288, \"heapify(arr,\": 1816, \"n,\": 3629, \"i)\": 1214, \"largest\": 2425, \"i;\\\\n\\\\t\\\\tlet\": 288, \"l\": 1211, \"2\": 3297, \"1;\\\\n\\\\t\\\\tlet\": 288, \"r\": 1211, \"2;\\\\n\\\\t\\\\tif\": 288, \"(l\": 607, \"&&\": 4229, \"arr[l]\": 1211, \"arr[largest])\": 1214, \"l;\\\\n\\\\t\\\\tif\": 288, \"(r\": 607, \"arr[r]\": 1211, \"r;\\\\n\\\\t\\\\tif\": 288, \"(largest\": 607, \"!==\": 607, \"{\\\\n\\\\t\\\\t\\\\t[arr[i],\": 288, \"arr[largest]]\": 607, \"[arr[largest],\": 607, \"arr[i]];\\\\n\\\\t\\\\t\\\\theapify(arr,\": 288, \"largest);\\\\n\\\\t\\\\t}\\\\n\\\\t}\\\\n\\\\tlet\": 288, \"arr.length;\\\\n\\\\tfor\": 288, \"math.floor(n\": 605, \"2)\": 605, \"i--)\": 1210, \"i);\\\\n\\\\tfor\": 288, \"{\\\\n\\\\t\\\\t[arr[0],\": 288, \"arr[i]]\": 605, \"[arr[i],\": 605, \"arr[0]];\\\\n\\\\t\\\\theapify(arr,\": 288, \"i,\": 1207, \"0);\\\\n\\\\t}\\\\n\\\\treturn\": 288, \"arr;\\\\n}\": 288, \"interpolationsearch(arr,\": 258, \"arr[high])\": 530, \"math.floor(((high\": 530, \"arr[low]))\": 530, \"arr[low]));\\\\n\\\\t\\\\tif\": 258, \"(arr[pos]\": 1584, \"pos;\\\\n\\\\t\\\\telse\": 258, \"heap_sort(arr):\\\\n\\\\tdef\": 278, \"i):\\\\n\\\\t\\\\tlargest\": 278, \"i\\\\n\\\\t\\\\tl\": 278, \"1\\\\n\\\\t\\\\tr\": 278, \"2\\\\n\\\\t\\\\tif\": 552, \"arr[largest]:\\\\n\\\\t\\\\t\\\\tlargest\": 556, \"l\\\\n\\\\t\\\\tif\": 278, \"r\\\\n\\\\t\\\\tif\": 278, \"!=\": 604, \"i:\\\\n\\\\t\\\\t\\\\tarr[i],\": 278, \"arr[largest]\": 604, \"arr[largest],\": 604, \"arr[i]\\\\n\\\\t\\\\t\\\\theapify(arr,\": 278, \"largest)\\\\n\\\\tn\": 278, \"len(arr)\\\\n\\\\tfor\": 607, \"range(n\": 1204, \"1,\": 1470, \"-1,\": 602, \"-1):\\\\n\\\\t\\\\theapify(arr,\": 278, \"i)\\\\n\\\\tfor\": 278, \"-1):\\\\n\\\\t\\\\tarr[i],\": 278, \"arr[0]\": 1122, \"arr[0],\": 602, \"arr[i]\\\\n\\\\t\\\\theapify(arr,\": 604, \"0)\\\\n\\\\treturn\": 278, \"mergesort(arr)\": 286, \"math.floor(arr.length\": 286, \"2);\\\\n\\\\tconst\": 286, \"mergesort(arr.slice(0,\": 286, \"mid));\\\\n\\\\tconst\": 286, \"mergesort(arr.slice(mid));\\\\n\\\\treturn\": 286, \"merge(left,\": 572, \"right);\\\\n}\\\\nfunction\": 286, \"right)\": 286, \"result\": 286, \"[];\\\\n\\\\tlet\": 286, \"(i\": 1139, \"left.length\": 587, \"right.length)\": 587, \"(left[i]\": 915, \"right[j])\": 915, \"{\\\\n\\\\t\\\\t\\\\tresult.push(left[i]);\\\\n\\\\t\\\\t\\\\ti++;\\\\n\\\\t\\\\t}\": 286, \"{\\\\n\\\\t\\\\t\\\\tresult.push(right[j]);\\\\n\\\\t\\\\t\\\\tj++;\\\\n\\\\t\\\\t}\\\\n\\\\t}\\\\n\\\\treturn\": 286, \"result.concat(left.slice(i)).concat(right.slice(j));\\\\n}\": 286, \"insertion_sort(arr):\\\\n\\\\t\\\\tfor\": 270, \"range(1,\": 270, \"len(arr)):\\\\n\\\\t\\\\t\\\\tkey\": 270, \"arr[i]\\\\n\\\\t\\\\t\\\\tj\": 270, \"1\\\\n\\\\t\\\\t\\\\twhile\": 270, \"0\": 815, \"key\": 546, \"arr[j]:\\\\n\\\\t\\\\t\\\\t\\\\tarr[j\": 270, \"arr[j]\\\\n\\\\t\\\\t\\\\t\\\\tj\": 270, \"-=\": 270, \"1\\\\n\\\\t\\\\t\\\\t\\\\tarr[j\": 270, \"key\\\\n\\\\t\\\\t\\\\t\\\\treturn\": 270, \"quick_sort(arr):\\\\n\\\\tif\": 257, \"1:\\\\n\\\\t\\\\treturn\": 257, \"arr\\\\n\\\\tpivot\": 257, \"arr[len(arr)\": 584, \"2]\\\\n\\\\tleft\": 257, \"[x\": 1752, \"pivot]\\\\n\\\\tmiddle\": 257, \"pivot]\\\\n\\\\tright\": 257, \"pivot]\\\\n\\\\treturn\": 257, \"quick_sort(left)\": 584, \"quick_sort(right)\": 584, \"exponential_search(arr,\": 251, \"x):\\\\n\\\\tif\": 251, \"0\\\\n\\\\tn\": 251, \"len(arr)\\\\n\\\\ti\": 251, \"x:\\\\n\\\\t\\\\ti\": 251, \"*=\": 1076, \"2\\\\n\\\\treturn\": 251, \"binary_search(arr[:min(i,\": 251, \"n)],\": 251, \"insertionsort(arr)\": 276, \"{\\\\n\\\\t\\\\tfor\": 276, \"arr[i];\\\\n\\\\t\\\\tlet\": 276, \"1;\\\\n\\\\t\\\\twhile\": 276, \"(j\": 276, \"arr[j]\": 1472, \"key)\": 276, \"{\\\\n\\\\t\\\\tarr[j\": 276, \"arr[j];\\\\n\\\\t\\\\tj--;\\\\n\\\\t\\\\t}\\\\n\\\\t\\\\tarr[j\": 276, \"key;\\\\n\\\\t\\\\t}\\\\n\\\\t\\\\treturn\": 276, \"arr;\\\\n\\\\t\\\\t}\": 566, \"fibonaccisearch(arr,\": 266, \"fibm2\": 1032, \"fibm1\": 1040, \"fibm\": 1814, \"fibm1;\\\\n\\\\tlet\": 266, \"arr.length;\\\\n\\\\twhile\": 266, \"(fibm\": 1000, \"{\\\\n\\\\t\\\\tfibm2\": 266, \"fibm1;\\\\n\\\\t\\\\tfibm1\": 500, \"fibm;\\\\n\\\\t\\\\tfibm\": 266, \"fibm1;\\\\n\\\\t}\\\\n\\\\tlet\": 266, \"-1;\\\\n\\\\twhile\": 266, \"math.min(offset\": 500, \"fibm2,\": 500, \"1);\\\\n\\\\t\\\\tif\": 266, \"{\\\\n\\\\t\\\\t\\\\tfibm\": 532, \"fibm1;\\\\n\\\\t\\\\t\\\\tfibm1\": 266, \"fibm2;\\\\n\\\\t\\\\t\\\\tfibm2\": 532, \"fibm1;\\\\n\\\\t\\\\t\\\\toffset\": 266, \"i;\\\\n\\\\t\\\\t}\": 266, \"fibm2;\\\\n\\\\t\\\\t\\\\tfibm1\": 266, \"fibm1;\\\\n\\\\t\\\\t}\": 266, \"i;\\\\n\\\\t}\\\\n\\\\tif\": 266, \"(fibm1\": 540, \"1;\\\\n\\\\treturn\": 266, \"selectionsort(arr)\": 290, \"arr.length;\\\\n\\\\t\\\\tfor\": 290, \"minidx\": 596, \"i;\\\\n\\\\t\\\\tfor\": 290, \"arr[minidx])\": 599, \"{\\\\n\\\\t\\\\tminidx\": 290, \"j;\\\\n\\\\t\\\\t}\\\\n\\\\t\\\\t}\\\\n\\\\t\\\\t[arr[i],\": 290, \"arr[minidx]]\": 596, \"[arr[minidx],\": 596, \"arr[i]];\\\\n\\\\t\\\\t}\\\\n\\\\t\\\\treturn\": 290, \"binary_search(arr,\": 274, \"high:\\\\n\\\\t\\\\tmid\": 274, \"arr[mid]\": 1642, \"mid\\\\n\\\\t\\\\telif\": 274, \"bubble_sort(arr):\\\\n\\\\t\\\\tn\": 274, \"len(arr)\\\\n\\\\t\\\\tfor\": 274, \"range(n):\\\\n\\\\t\\\\t\\\\tfor\": 274, \"range(0,\": 603, \"n-i-1):\\\\n\\\\t\\\\t\\\\t\\\\tif\": 274, \"arr[j+1]:\\\\n\\\\t\\\\t\\\\t\\\\t\\\\tarr[j],\": 274, \"arr[j+1]\": 583, \"arr[j+1],\": 583, \"arr[j]\\\\n\\\\t\\\\t\\\\t\\\\t\\\\treturn\": 274, \"selection_sort(arr):\\\\n\\\\t\\\\t\": 278, \"len(arr)\\\\n\\\\t\\\\t\": 278, \"range(n):\\\\n\\\\t\\\\t\\\\tmin_idx\": 278, \"i\\\\n\\\\t\\\\t\\\\tfor\": 278, \"range(i+1,\": 604, \"n):\\\\n\\\\t\\\\t\\\\t\\\\tif\": 278, \"arr[min_idx]:\\\\n\\\\t\\\\t\\\\t\\\\t\\\\tmin_idx\": 278, \"j\\\\n\\\\t\\\\t\\\\t\\\\t\\\\tarr[i],\": 278, \"arr[min_idx]\": 613, \"arr[min_idx],\": 613, \"arr[i]\\\\n\\\\t\\\\t\\\\t\\\\t\\\\treturn\": 278, \"exponentialsearch(arr,\": 270, \"(arr[0]\": 523, \"0;\\\\n\\\\tlet\": 270, \"2;\\\\n\\\\treturn\": 270, \"binarysearch(arr.slice(0,\": 270, \"math.min(i,\": 270, \"n)),\": 270, \"x);\\\\n}\": 270, \"linear_search(arr,\": 250, \"x):\\\\n\\\\tfor\": 250, \"range(len(arr)):\\\\n\\\\t\\\\tif\": 250, \"i\\\\n\\\\treturn\": 539, \"import\": 289, \"math\\\\ndef\": 289, \"jump_search(arr,\": 289, \"x):\\\\n\\\\tn\": 289, \"len(arr)\\\\n\\\\tstep\": 289, \"int(math.sqrt(n))\\\\n\\\\tprev\": 289, \"0\\\\n\\\\twhile\": 289, \"arr[min(step,\": 570, \"x:\\\\n\\\\t\\\\tprev\": 289, \"step\\\\n\\\\t\\\\tstep\": 289, \"int(math.sqrt(n))\\\\n\\\\t\\\\tif\": 289, \"n:\\\\n\\\\t\\\\t\\\\treturn\": 289, \"-1\\\\n\\\\tfor\": 289, \"range(prev,\": 570, \"min(step,\": 570, \"n)):\\\\n\\\\t\\\\tif\": 289, \"arr[j+1]:\\\\n\\\\tarr[j],\": 309, \"arr[j]\\\\n\\\\treturn\": 309, \"i;\\\\n\\\\tfor\": 306, \"{\\\\n\\\\t\\\\t//aqu\\u00ed\": 625, \"van\": 1593, \"los\": 1593, \"ifs\\\\n\\\\t}\\\\n\\\\t[arr[i],\": 306, \"arr[i]];\\\\n}\": 306, \"{\\\\n\\\\t\\\\tresult.push(left[i]);\\\\n\\\\t\\\\ti++;\\\\n\\\\t}\": 301, \"{\\\\n\\\\t\\\\tresult.push(right[j]);\\\\n\\\\t\\\\tj++;\\\\n\\\\t}\\\\n}\": 301, \"ifs\\\\n\\\\t}\\\\n}\": 319, \"arr;\\\\nconst\": 337, \"2)];\\\\nconst\": 337, \"pivot);\\\\nconst\": 674, \"pivot);\\\\nreturn\": 337, \"...quicksort(right)];\": 337, \"i):\\\\n\\\\tlargest\": 326, \"i\\\\n\\\\tl\": 326, \"1\\\\n\\\\tr\": 326, \"2\\\\n\\\\tif\": 605, \"arr[largest]:\\\\n\\\\t\\\\tlargest\": 652, \"l\\\\n\\\\tif\": 326, \"r\\\\n\\\\tif\": 326, \"i:\\\\n\\\\t\\\\tarr[i],\": 326, \"largest)\": 326, \"#if\": 1211, \"funci\\u00f3n\": 656, \"mergesort\\\\nif\": 328, \"arr;\\\\n\\\\n#if\": 328, \"del\": 2312, \"bucle\": 328, \"merge\\\\nif\": 328, \"{\\\\n\\\\tresult.push(left[i]);\\\\n\\\\ti++;\\\\n}\": 328, \"{\\\\n\\\\tresult.push(right[j]);\\\\n\\\\tj++;\\\\n}\": 328, \"arr[min_idx]:\\\\n\\\\tmin_idx\": 335, \"j\\\\n\\\\tarr[i],\": 335, \"arr[i]\\\\n\\\\treturn\": 335, \"len(right):\\\\n\\\\tif\": 309, \"right[j]:\\\\n\\\\t\\\\tarr[k]\": 622, \"left[i]\\\\n\\\\t\\\\ti\": 622, \"1\\\\n\\\\telse:\\\\n\\\\t\\\\tarr[k]\": 622, \"right[j]\\\\n\\\\t\\\\tj\": 622, \"1\\\\n\\\\tk\": 1240, \"1\\\\nwhile\": 618, \"len(left):\\\\n\\\\tarr[k]\": 309, \"left[i]\\\\n\\\\ti\": 309, \"len(right):\\\\n\\\\tarr[k]\": 309, \"right[j]\\\\n\\\\tj\": 309, \"1\": 1454, \"range(n):\\\\n\\\\tmin_idx\": 326, \"i\\\\n\\\\tfor\": 326, \"n):\\\\n\\\\t\\\\t#aqu\\u00ed\": 326, \"ifs\": 655, \"range(n):\\\\n\\\\t\\\\tfor\": 329, \"n-i-1):\\\\n\\\\t\\\\t\\\\t#aqui\": 329, \"-1):\\\\n\\\\theapify(arr,\": 324, \"i)\\\\nfor\": 324, \"-1):\\\\n\\\\tarr[i],\": 324, \"arr[i]\\\\n\\\\theapify(arr,\": 324, \"0)\": 324, \"externo\\\\nif\": 313, \"1:\\\\n\\\\tmid\": 313, \"2\\\\n\\\\tleft\": 313, \"arr[:mid]\\\\n\\\\tright\": 313, \"arr[mid:]\\\\n\\\\tmerge_sort(left)\\\\n\\\\tmerge_sort(right)\\\\n\\\\ti\": 313, \"0\\\\n\\\\t#ac\\u00e1\": 313, \"bucles\\\\n\\\\n\\\\t#ifs\": 313, \"bucle\\\\n\\\\tif\": 313, \"1:\\\\n\\\\treturn\": 327, \"arr\\\\npivot\": 327, \"2]\\\\nleft\": 327, \"pivot]\\\\nmiddle\": 327, \"pivot]\\\\nright\": 327, \"pivot]\\\\nreturn\": 327, \"{\\\\n\\\\tminidx\": 309, \"j;\\\\n}\": 309, \"i;\\\\n\\\\tlet\": 319, \"1;\\\\n\\\\tlet\": 319, \"2;\\\\n\\\\tif\": 319, \"l;\\\\n\\\\tif\": 319, \"r;\\\\n\\\\tif\": 319, \"{\\\\n\\\\t\\\\t[arr[i],\": 319, \"arr[i]];\\\\n\\\\t\\\\theapify(arr,\": 319, \"largest);\\\\n\\\\t}\\\\n}\": 319, \"{\\\\n\\\\t[arr[j],\": 311, \"arr[j]];\\\\n}\": 311, \"i);\\\\nfor\": 317, \"{\\\\n\\\\t[arr[0],\": 317, \"arr[0]];\\\\n\\\\theapify(arr,\": 317, \"0);\\\\n}\": 317, \"x:\\\\n\\\\tprev\": 281, \"step\\\\n\\\\tstep\": 281, \"int(math.sqrt(n))\\\\n\\\\tif\": 281, \"n:\\\\n\\\\t\\\\treturn\": 281, \"-1\\\\nfor\": 281, \"n)):\\\\n\\\\tif\": 281, \"i\\\\n\": 544, \"range(len(arr)):\\\\n\\\\tif\": 263, \"x:\\\\n\\\\treturn\": 1650, \"pos\\\\nelif\": 269, \"x:\\\\n\\\\tlow\": 537, \"1\\\\nelse:\\\\n\\\\thigh\": 537, \"n:\\\\n\\\\tfib_m2\": 247, \"fib_m1\\\\n\\\\tfib_m1\": 536, \"fib_m\\\\n\\\\tfib_m\": 247, \"fib_m1\\\\noffset\": 247, \"-1\\\\nwhile\": 247, \"1:\\\\n\\\\ti\": 247, \"1)\\\\n\\\\tif\": 247, \"x:\\\\n\\\\t\\\\tfib_m\": 494, \"fib_m2\\\\n\\\\t\\\\tfib_m2\": 494, \"fib_m1\\\\n\\\\t\\\\toffset\": 247, \"i\\\\n\\\\telif\": 247, \"fib_m2\\\\n\\\\t\\\\tfib_m1\": 247, \"fib_m1\\\\n\\\\telse:\\\\n\\\\t\\\\treturn\": 247, \"mid;\\\\nelse\": 279, \"1;\\\\nelse\": 541, \"x:\\\\n\\\\ti\": 273, \"//if\": 547, \"primer\": 554, \"bucle\\\\nif\": 1397, \"-1;\\\\n\\\\n//if\": 273, \"segundo\": 1117, \"i;\": 553, \"x:\\\\n\\\\tfib_m\": 578, \"fib_m2\\\\n\\\\tfib_m2\": 578, \"i\\\\nelif\": 289, \"fib_m2\\\\n\\\\tfib_m1\": 289, \"fib_m1\\\\nelse:\\\\n\\\\treturn\": 289, \"i\\\\n\\\\n#if\": 289, \"finalizaci\\u00f3n\\\\nif\": 563, \"arr[high]:\\\\n\\\\tpos\": 274, \"arr[low]))\\\\n\\\\tif\": 274, \"pos\\\\n\\\\telif\": 274, \"x:\\\\n\\\\t\\\\tlow\": 553, \"1\\\\n\\\\telse:\\\\n\\\\t\\\\thigh\": 553, \"pos;\\\\nelse\": 262, \"{\\\\n\\\\tprev\": 273, \"step;\\\\n\\\\tstep\": 273, \"math.floor(math.sqrt(n));\\\\n\\\\tif\": 273, \"-1;\\\\n}\\\\nfor\": 273, \"i;\\\\n}\": 1045, \"mid\\\\nelif\": 268, \"1\\\\n\": 547, \"bloque\\\\nif\": 274, \"{\\\\n\\\\tfibm\": 548, \"fibm1;\\\\n\\\\tfibm1\": 508, \"fibm2;\\\\n\\\\tfibm2\": 548, \"fibm1;\\\\n\\\\toffset\": 274, \"fibm2;\\\\n\\\\tfibm1\": 274, \"fibm1;\\\\n}\": 274, \"i;\\\\n\\\\n//if\": 274, \"n:\\\\n\\\\treturn\": 281, \"-1\\\\n\\\\n#if\": 281, \"{\\\\n\\\\tfibm2\": 234, \"fibm;\\\\n\\\\tfibm\": 234, \"fibm1;\\\\n}\\\\nlet\": 234, \"-1;\\\\nwhile\": 234, \"1);\\\\n\\\\tif\": 234, \"{\\\\n\\\\t\\\\tfibm\": 468, \"fibm2;\\\\n\\\\t\\\\tfibm2\": 468, \"fibm1;\\\\n\\\\t\\\\toffset\": 234, \"i;\\\\n\\\\t}\": 234, \"fibm2;\\\\n\\\\t\\\\tfibm1\": 234, \"fibm1;\\\\n\\\\t}\": 234, \"2;\": 282, \"high:\\\\n\\\\tmid\": 279, \"mid\\\\n\\\\telif\": 279, \"2);\\\\n\\\\tif\": 273, \"mid;\\\\n\\\\telse\": 273, \"1;\\\\n\\\\telse\": 545, \"1;\\\\n}\": 545, \"arr[low]));\\\\n\\\\tif\": 272, \"pos;\\\\n\\\\telse\": 272, \"greet(name):\\\\n\\\\treturn\": 309, \"f'hello,\": 620, \"\\\\{name\\\\}!'\": 309, \"class\": 1235, \"person\": 308, \"{\\\\n\\\\tconstructor(name)\": 308, \"{\\\\n\\\\t\\\\tthis.name\": 308, \"name;\\\\n\\\\t}\\\\n\\\\tgreet()\": 308, \"{\\\\n\\\\t\\\\treturn\": 614, \"`hello,\": 613, \"${this.name}!`;\\\\n\\\\t}\\\\n}\": 308, \"calculator:\\\\n\\\\tdef\": 310, \"multiply(self,\": 310, \"b):\\\\n\\\\t\\\\treturn\": 310, \"person:\\\\n\\\\tdef\": 311, \"__init__(self,\": 311, \"name):\\\\n\\\\t\\\\tself.name\": 311, \"name\\\\n\\\\tdef\": 311, \"greet(self):\\\\n\\\\t\\\\treturn\": 311, \"\\\\{self.name\\\\}!'\": 311, \"greet(name)\": 305, \"{\\\\n\\\\treturn\": 610, \"${name}!`;\\\\n}\": 305, \"calculator\": 306, \"{\\\\n\\\\tmultiply(a,\": 306, \"b)\": 611, \"b;\\\\n\\\\t}\\\\n}\": 306, \"add(a,\": 616, \"b):\\\\n\\\\treturn\": 311, \"b;\\\\n}\": 305}", "word_docs": "{\"<start>\": 31714, \"console.log(\\\"hola\": 216, \"mundo\\\");\": 216, \"<end>\": 31714, \"mundo\\\")\": 215, \"print(\\\"hola\": 215, \"x\": 6597, \"=\": 25808, \"true\": 168, \"1.50\": 336, \"let\": 1561, \"false;\": 177, \"1.50;\": 354, \"'a';\": 177, \"5\": 168, \"mundo\\\";\": 177, \"\\\"hola\": 345, \"mundo\\\"\": 168, \"5;\": 480, \"'a'\": 168, \"const\": 3468, \"['a','b','c','d']\": 141, \"[1,3,5,7];\": 141, \"arreglo\": 421, \"[1.0,1.2,1.3,1.5];\": 280, \"[1.0,1.2,1.3,1.5]\": 281, \"[\\\"esto\\\",\\\"es\\\",\\\"un\\\",\\\"arreglo\\\"];\": 141, \"['a','b','c','d'];\": 141, \"[1,3,5,7]\": 141, \"[\\\"esto\\\",\\\"es\\\",\\\"un\\\",\\\"arreglo\\\"]\": 140, \"[[1.2,2.3],[3.4,4.5],[5.6,6.7]]\": 282, \"6]];\": 141, \"4],[5,\": 141, \"mat\": 141, \"2],[3,\": 141, \"[[1,\": 141, \"[[1,2],[3,4],[5,6]]\": 139, \"[['a','b'],['c','d'],['e','f']]\": 141, \"[[1.3,2.5],[3.6,4.5],[5.8,6.9]];\": 282, \"tres\\\",\\\"nivel\": 282, \"dos\\\"],[\\\"nivel\": 282, \"cinco\\\",\\\"nivel\": 282, \"uno\\\",\\\"nivel\": 282, \"cuatro\\\"],[\\\"nivel\": 282, \"seis\\\"]]\": 141, \"[[\\\"nivel\": 282, \"seis\\\"]];\": 141, \"[['a','b'],['c','d'],['e','f']];\": 141, \"in\": 4048, \"{i}')\": 302, \"range(5):\\\\n\\\\tprint(f'iteraci\\u00f3n\": 302, \"i\": 10809, \"for\": 3862, \"menos\": 1218, \"condition\": 1218, \"al\": 1218, \"while\": 3908, \"true;\\\\ndo\": 305, \"una\": 1218, \"{\\\\n\\\\tconsole.log('ejecutar\": 610, \"vez');\\\\n}\": 610, \"(condition);\": 610, \"false;\\\\ndo\": 305, \"condition:\\\\n\\\\t\\\\tbreak\": 608, \"false\\\\nwhile\": 301, \"vez')\\\\n\\\\tif\": 608, \"true:\\\\n\\\\tprint('ejecutar\": 608, \"(let\": 3451, \"${i}`);\\\\n}\": 303, \"0;\": 2884, \"i++)\": 2846, \"<\": 15479, \"{\\\\n\\\\tconsole.log(`iteraci\\u00f3n\": 303, \"not\": 307, \"true\\\\nwhile\": 307, \"mayor\": 734, \"igual\": 583, \"es\": 1767, \"a\": 2553, \"que\": 1223, \"a\\\")\": 973, \"33\\\\nb\": 1147, \"b\": 2290, \"o\": 388, \"a:\\\\n\\\\tprint(\\\"b\": 1321, \"200\\\\nif\": 973, \">=\": 3552, \"5;\\\\nif\": 977, \"m\\u00e1s\": 291, \"horas!\\\");\\\\n}\": 389, \"son\": 933, \"{\\\\n\\\\tconsole.log(\\\"ya\": 291, \"hora\": 1325, \"(hora\": 1325, \"mas\": 293, \"de\": 1726, \"horas!\\\");\\\\n}else\": 195, \"18\": 737, \"18)\": 977, \"{\\\\n\\\\tconsole.log(\\\"no\": 391, \"<=\": 5461, \"las\": 585, \"menor\": 392, \"noches!\\\");\\\\n}\": 294, \"{\\\\n\\\\tconsole.log(\\\"buenos\": 196, \"else\": 2505, \"{\\\\n\\\\tconsole.log(\\\"buenas\": 490, \"d\\u00edas!\\\");\\\\n}\": 196, \"a\\\")\\\\nelse:\\\\n\\\\tprint(\\\"b\": 390, \"no\": 585, \"==\": 5469, \"todav\\u00eda.\\\");\\\\n}\": 98, \"noche\": 98, \">\": 7079, \"18\\\");\\\\n}\": 196, \"===\": 5130, \"noches!,\": 196, \"a\\\")\\\\n\\\\tprint(\\\"b\": 97, \"18!\\\");\\\\n}\": 98, \"{\\\\n\\\\tconsole.log(\\\"hola,\": 98, \"la\": 774, \"\\\"buenos\": 348, \"dias\\\";\\\\n}\": 348, \"\\\"buenas\": 348, \"noches\\\";\\\\n}\": 174, \"10;\\\\nif\": 348, \"{\\\\n\\\\tsaludo\": 348, \"20)\": 348, \"tardes\\\";\\\\n}\": 348, \"if\": 6992, \"10)\": 348, \"a\\\")\\\\nelif\": 348, \"iguales\\\")\": 174, \"y\": 348, \"33\\\\nif\": 348, \"b:\\\\n\\\\tprint(\\\"a\": 348, \"200\\\\nb\": 174, \"iguales\\\")\\\\nelse:\\\\n\\\\tprint(\\\"a\": 174, \"b\\\")\": 174, \"edad\\\"\": 348, \"\\\"mayor\": 348, \"edad\": 348, \"edad\\\"\\\\nprint(mensaje)\": 174, \"\\\"menor\": 348, \"18\\\\nmensaje\": 174, \"mensaje\": 174, \"edad\\\";\\\\nconsole.log(mensaje);\": 174, \"18;\\\\nconst\": 174, \":\": 174, \"?\": 174, \"\\\"b\\\":\\\\n\\\\t\\\\tprint(\\\"es\": 174, \"c\\\")\\\\n\": 174, \"valor\": 348, \"ni\": 348, \"b\\\")\\\\n\\\\tcase\": 174, \"\\\"b\\\"\\\\nmatch\": 174, \"\\\"c\\\":\\\\n\\\\t\\\\tprint(\\\"es\": 174, \"letra\": 348, \"c\\\")\\\\n\\\\tcase\": 174, \"\\\"a\\\":\\\\n\\\\t\\\\tprint(\\\"es\": 174, \"valor:\\\\n\\\\tcase\": 174, \"a\\\")\\\\n\\\\tcase\": 174, \"_:\\\\n\\\\t\\\\tprint(\\\"no\": 174, \"a,\": 658, \"a\\\");\\\\n\\\\t\\\\tbreak;\\\\n\\\\tcase\": 174, \"b\\\");\\\\n\\\\t\\\\tbreak;\\\\n\\\\tcase\": 174, \"\\\"c\\\":\\\\n\\\\t\\\\tconsole.log(\\\"es\": 174, \"c\\\");\\\\n\\\\t\\\\tbreak;\\\\n\\\\tdefault:\\\\n\\\\t\\\\tconsole.log(\\\"no\": 174, \"c\\\");\\\\n}\": 174, \"(valor)\": 174, \"{\\\\n\\\\tcase\": 174, \"\\\"b\\\":\\\\n\\\\t\\\\tconsole.log(\\\"es\": 174, \"\\\"b\\\";\\\\nswitch\": 174, \"\\\"a\\\":\\\\n\\\\t\\\\tconsole.log(\\\"es\": 174, \"x)\": 5081, \"function\": 4239, \"arr.length;\": 808, \"i;\\\\n\\\\t}\\\\n\\\\treturn\": 539, \"-1;\\\\n}\": 1341, \"{\\\\n\\\\t\\\\tif\": 1115, \"(arr[i]\": 2403, \"return\": 6058, \"{\\\\n\\\\tfor\": 587, \"linearsearch(arr,\": 268, \"step\": 271, \"prev;\": 544, \"prev\": 1122, \"n);\": 544, \"0;\\\\n\\\\twhile\": 557, \"n)\": 1887, \"1]\": 2753, \"+=\": 2012, \"{\\\\n\\\\tlet\": 2763, \"math.min(step,\": 544, \"-\": 8289, \"math.floor(math.sqrt(n));\\\\n\\\\t\\\\tif\": 271, \"n\": 5378, \"(arr[math.min(step,\": 544, \"step;\\\\n\\\\t\\\\tstep\": 271, \"-1;\\\\n\\\\t}\\\\n\\\\tfor\": 271, \"arr.length;\\\\n\\\\tlet\": 541, \"{\\\\n\\\\t\\\\tprev\": 271, \"(prev\": 817, \"jumpsearch(arr,\": 271, \"math.floor(math.sqrt(n));\\\\n\\\\tlet\": 271, \"n:\\\\n\\\\t\\\\tfib_m2\": 264, \"arr[offset\": 1093, \"offset\": 1327, \"def\": 3885, \"i\\\\n\\\\t\\\\telif\": 264, \"x):\\\\n\\\\tfib_m2\": 264, \"1\\\\n\\\\tfib_m\": 264, \"1)\\\\n\\\\t\\\\tif\": 264, \"fib_m\": 800, \"1:\\\\n\\\\t\\\\ti\": 264, \"x:\\\\n\\\\t\\\\treturn\": 1612, \"fibonacci_search(arr,\": 264, \"fib_m2\\\\n\\\\t\\\\t\\\\tfib_m2\": 264, \"i\\\\n\\\\tif\": 264, \"-1\": 1344, \"fib_m1\\\\n\\\\toffset\": 553, \"fib_m1\\\\n\\\\t\\\\t\\\\tfib_m1\": 264, \"0\\\\n\\\\tfib_m1\": 264, \"fib_m\\\\n\\\\t\\\\tfib_m\": 264, \"+\": 8967, \"min(offset\": 511, \"fib_m1\\\\n\\\\t\\\\telse:\\\\n\\\\t\\\\t\\\\treturn\": 264, \"fib_m2,\": 511, \"fib_m2\\\\n\\\\t\\\\t\\\\tfib_m1\": 264, \"fib_m1\\\\n\\\\tn\": 264, \"-1\\\\n\\\\twhile\": 264, \"fib_m1\\\\n\\\\t\\\\t\\\\toffset\": 264, \"1\\\\n\\\\treturn\": 1081, \"fib_m2\": 511, \"fib_m1\\\\n\\\\t\\\\tfib_m1\": 511, \"arr[i]\": 3514, \"fib_m1\": 800, \"and\": 3077, \"x:\\\\n\\\\t\\\\t\\\\tfib_m\": 264, \"len(arr)\\\\n\\\\twhile\": 264, \"arr[low]))\\\\n\\\\t\\\\tif\": 267, \"arr[pos]\": 810, \"arr[low])\": 541, \"((high\": 541, \"pos\\\\n\\\\t\\\\telif\": 267, \"arr[high]:\\\\n\\\\t\\\\tpos\": 267, \"high\": 2437, \"*\": 2898, \"x:\\\\n\\\\t\\\\t\\\\treturn\": 1080, \"(x\": 1071, \"1\\\\n\\\\t\\\\telse:\\\\n\\\\t\\\\t\\\\thigh\": 541, \"1\\\\n\\\\twhile\": 792, \"//\": 2869, \"pos\": 1602, \"len(arr)\": 1714, \"x:\\\\n\\\\t\\\\t\\\\tlow\": 541, \"0,\": 2231, \"low)\": 1071, \"x):\\\\n\\\\tlow,\": 541, \"arr[low]\": 1071, \"(arr[high]\": 1071, \"low\": 2716, \"interpolation_search(arr,\": 267, \"2);\\\\n\\\\t\\\\tif\": 278, \"{\\\\n\\\\t\\\\tlet\": 1656, \"1;\\\\n\\\\t}\\\\n\\\\treturn\": 536, \"high)\": 1104, \"/\": 2592, \"1;\\\\n\\\\twhile\": 806, \"arr.length\": 536, \"mid\": 1937, \"(arr[mid]\": 830, \"binarysearch(arr,\": 278, \"(low\": 1634, \"1;\\\\n\\\\t\\\\telse\": 536, \"math.floor((low\": 551, \"mid;\\\\n\\\\t\\\\telse\": 278, \"pivot);\\\\n\\\\tconst\": 283, \"arr[math.floor(arr.length\": 620, \"quicksort(arr)\": 283, \"2)];\\\\n\\\\tconst\": 283, \"left\": 906, \"...middle,\": 620, \"=>\": 620, \"(arr.length\": 1234, \"[...quicksort(left),\": 620, \"middle\": 1204, \"1)\": 1734, \"arr;\\\\n\\\\tconst\": 569, \"arr.filter(x\": 620, \"...quicksort(right)];\\\\n}\": 283, \"pivot);\\\\n\\\\treturn\": 283, \"{\\\\n\\\\tif\": 1677, \"pivot\": 620, \"right\": 906, \"arr;\\\\n\\\\t\\\\t\": 276, \"j\": 4429, \"j++)\": 1191, \"[arr[j],\": 276, \"1;\": 2887, \"1]]\": 587, \"{\\\\n\\\\t\\\\t\": 276, \"(arr[j]\": 1186, \"arr[j\": 587, \"n;\": 1191, \"arr.length;\\\\n\\\\t\\\\t\": 276, \"1],\": 587, \"[arr[j\": 587, \"}\\\\n\\\\t\\\\t\": 276, \"}\": 276, \"arr[j]];\\\\n\\\\t\\\\t\": 276, \"1])\": 587, \"bubblesort(arr)\": 276, \"len(left)\": 585, \"1:\\\\n\\\\t\\\\tmid\": 276, \"arr[mid:]\\\\n\\\\t\\\\tmerge_sort(left)\\\\n\\\\t\\\\tmerge_sort(right)\\\\n\\\\t\\\\ti\": 276, \"left[i]\": 898, \"0\\\\n\\\\t\\\\twhile\": 276, \"len(right):\\\\n\\\\t\\\\t\\\\tarr[k]\": 276, \"len(left):\\\\n\\\\t\\\\t\\\\tarr[k]\": 276, \"right[j]:\\\\n\\\\t\\\\t\\\\t\\\\tarr[k]\": 276, \"arr[:mid]\\\\n\\\\t\\\\tright\": 276, \"left[i]\\\\n\\\\t\\\\t\\\\t\\\\ti\": 276, \"1\\\\n\\\\t\\\\t\\\\tk\": 276, \"1\\\\n\\\\t\\\\t\\\\telse:\\\\n\\\\t\\\\t\\\\t\\\\tarr[k]\": 276, \"arr\": 2604, \"1\\\\n\\\\t\\\\twhile\": 276, \"len(right):\\\\n\\\\t\\\\t\\\\tif\": 276, \"left[i]\\\\n\\\\t\\\\t\\\\ti\": 276, \"k\": 589, \"merge_sort(arr):\\\\n\\\\tif\": 276, \"2\\\\n\\\\t\\\\tleft\": 276, \"right[j]\\\\n\\\\t\\\\t\\\\t\\\\tj\": 276, \"right[j]\\\\n\\\\t\\\\t\\\\tj\": 276, \"arr.length;\\\\n\\\\tfor\": 288, \"i;\\\\n\\\\t\\\\tlet\": 288, \"r\": 1211, \"arr[i]];\\\\n\\\\t\\\\t\\\\theapify(arr,\": 288, \"i);\\\\n\\\\tfor\": 288, \"l\": 1211, \"largest\": 1211, \"arr[r]\": 1211, \"i--)\": 605, \"[arr[i],\": 605, \"1;\\\\n\\\\t\\\\tlet\": 288, \"!==\": 607, \"heapify(arr,\": 1528, \"(l\": 607, \"l;\\\\n\\\\t\\\\tif\": 288, \"2)\": 605, \"i,\": 1207, \"2;\\\\n\\\\t\\\\tif\": 288, \"arr;\\\\n}\": 288, \"arr[largest]]\": 607, \"0);\\\\n\\\\t}\\\\n\\\\treturn\": 288, \"math.floor(n\": 605, \"arr[l]\": 1211, \"arr[0]];\\\\n\\\\t\\\\theapify(arr,\": 288, \"i)\": 607, \"{\\\\n\\\\tfunction\": 288, \"2\": 1808, \"r;\\\\n\\\\t\\\\tif\": 288, \"arr[largest])\": 607, \"[arr[largest],\": 607, \"largest);\\\\n\\\\t\\\\t}\\\\n\\\\t}\\\\n\\\\tlet\": 288, \"{\\\\n\\\\t\\\\t[arr[0],\": 288, \"{\\\\n\\\\t\\\\t\\\\t[arr[i],\": 288, \"n,\": 1852, \"heapsort(arr)\": 288, \"arr[i]]\": 605, \"&&\": 3092, \"(largest\": 607, \"(r\": 607, \"interpolationsearch(arr,\": 258, \"arr[high])\": 530, \"(arr[pos]\": 792, \"pos;\\\\n\\\\t\\\\telse\": 258, \"arr[low]));\\\\n\\\\t\\\\tif\": 258, \"arr[low]))\": 530, \"math.floor(((high\": 530, \"-1):\\\\n\\\\t\\\\tarr[i],\": 278, \"r\\\\n\\\\t\\\\tif\": 278, \"len(arr)\\\\n\\\\tfor\": 607, \"arr[0]\": 1122, \"arr[0],\": 602, \"2\\\\n\\\\t\\\\tif\": 552, \"arr[i]\\\\n\\\\t\\\\theapify(arr,\": 604, \"-1,\": 602, \"i\\\\n\\\\t\\\\tl\": 278, \"arr[largest],\": 604, \"-1):\\\\n\\\\t\\\\theapify(arr,\": 278, \"largest)\\\\n\\\\tn\": 278, \"arr[i]\\\\n\\\\t\\\\t\\\\theapify(arr,\": 278, \"i):\\\\n\\\\t\\\\tlargest\": 278, \"!=\": 604, \"heap_sort(arr):\\\\n\\\\tdef\": 278, \"arr[largest]\": 604, \"l\\\\n\\\\t\\\\tif\": 278, \"1\\\\n\\\\t\\\\tr\": 278, \"range(n\": 602, \"i:\\\\n\\\\t\\\\t\\\\tarr[i],\": 278, \"1,\": 868, \"0)\\\\n\\\\treturn\": 278, \"arr[largest]:\\\\n\\\\t\\\\t\\\\tlargest\": 278, \"i)\\\\n\\\\tfor\": 278, \"mergesort(arr.slice(0,\": 286, \"(left[i]\": 915, \"right[j])\": 915, \"result\": 286, \"mergesort(arr.slice(mid));\\\\n\\\\treturn\": 286, \"result.concat(left.slice(i)).concat(right.slice(j));\\\\n}\": 286, \"right.length)\": 587, \"2);\\\\n\\\\tconst\": 286, \"mergesort(arr)\": 286, \"right)\": 286, \"[];\\\\n\\\\tlet\": 286, \"{\\\\n\\\\t\\\\t\\\\tresult.push(right[j]);\\\\n\\\\t\\\\t\\\\tj++;\\\\n\\\\t\\\\t}\\\\n\\\\t}\\\\n\\\\treturn\": 286, \"{\\\\n\\\\t\\\\t\\\\tresult.push(left[i]);\\\\n\\\\t\\\\t\\\\ti++;\\\\n\\\\t\\\\t}\": 286, \"mid));\\\\n\\\\tconst\": 286, \"right);\\\\n}\\\\nfunction\": 286, \"(i\": 1139, \"merge(left,\": 286, \"left.length\": 587, \"math.floor(arr.length\": 286, \"len(arr)):\\\\n\\\\t\\\\t\\\\tkey\": 270, \"-=\": 270, \"range(1,\": 270, \"insertion_sort(arr):\\\\n\\\\t\\\\tfor\": 270, \"1\\\\n\\\\t\\\\t\\\\twhile\": 270, \"arr[j]\\\\n\\\\t\\\\t\\\\t\\\\tj\": 270, \"1\\\\n\\\\t\\\\t\\\\t\\\\tarr[j\": 270, \"arr[j]:\\\\n\\\\t\\\\t\\\\t\\\\tarr[j\": 270, \"key\\\\n\\\\t\\\\t\\\\t\\\\treturn\": 270, \"arr[i]\\\\n\\\\t\\\\t\\\\tj\": 270, \"0\": 815, \"key\": 546, \"arr\\\\n\\\\tpivot\": 257, \"arr[len(arr)\": 584, \"2]\\\\n\\\\tleft\": 257, \"quick_sort(right)\": 584, \"quick_sort(left)\": 584, \"[x\": 584, \"pivot]\\\\n\\\\tright\": 257, \"pivot]\\\\n\\\\treturn\": 257, \"pivot]\\\\n\\\\tmiddle\": 257, \"quick_sort(arr):\\\\n\\\\tif\": 257, \"1:\\\\n\\\\t\\\\treturn\": 257, \"0\\\\n\\\\tn\": 251, \"x):\\\\n\\\\tif\": 251, \"len(arr)\\\\n\\\\ti\": 251, \"x:\\\\n\\\\t\\\\ti\": 251, \"binary_search(arr[:min(i,\": 251, \"*=\": 1076, \"2\\\\n\\\\treturn\": 251, \"n)],\": 251, \"exponential_search(arr,\": 251, \"{\\\\n\\\\t\\\\tarr[j\": 276, \"arr[j]\": 1472, \"(j\": 276, \"key)\": 276, \"insertionsort(arr)\": 276, \"arr[j];\\\\n\\\\t\\\\tj--;\\\\n\\\\t\\\\t}\\\\n\\\\t\\\\tarr[j\": 276, \"arr;\\\\n\\\\t\\\\t}\": 566, \"{\\\\n\\\\t\\\\tfor\": 276, \"1;\\\\n\\\\t\\\\twhile\": 276, \"arr[i];\\\\n\\\\t\\\\tlet\": 276, \"key;\\\\n\\\\t\\\\t}\\\\n\\\\t\\\\treturn\": 276, \"1);\\\\n\\\\t\\\\tif\": 266, \"fibm1;\\\\n\\\\t\\\\tfibm1\": 500, \"fibm;\\\\n\\\\t\\\\tfibm\": 266, \"(fibm1\": 540, \"fibm2\": 500, \"arr.length;\\\\n\\\\twhile\": 266, \"fibm1;\\\\n\\\\t}\\\\n\\\\tlet\": 266, \"i;\\\\n\\\\t}\\\\n\\\\tif\": 266, \"fibm1;\\\\n\\\\tlet\": 266, \"i;\\\\n\\\\t\\\\t}\": 266, \"fibm1\": 774, \"math.min(offset\": 500, \"fibm2,\": 500, \"fibm1;\\\\n\\\\t\\\\t}\": 266, \"fibm1;\\\\n\\\\t\\\\t\\\\toffset\": 266, \"{\\\\n\\\\t\\\\tfibm2\": 266, \"fibm\": 774, \"1;\\\\n\\\\treturn\": 266, \"-1;\\\\n\\\\twhile\": 266, \"fibm1;\\\\n\\\\t\\\\t\\\\tfibm1\": 266, \"{\\\\n\\\\t\\\\t\\\\tfibm\": 266, \"fibonaccisearch(arr,\": 266, \"(fibm\": 500, \"fibm2;\\\\n\\\\t\\\\t\\\\tfibm2\": 266, \"fibm2;\\\\n\\\\t\\\\t\\\\tfibm1\": 266, \"arr[minidx]]\": 596, \"[arr[minidx],\": 596, \"{\\\\n\\\\t\\\\tminidx\": 290, \"arr[i]];\\\\n\\\\t\\\\t}\\\\n\\\\t\\\\treturn\": 290, \"j;\\\\n\\\\t\\\\t}\\\\n\\\\t\\\\t}\\\\n\\\\t\\\\t[arr[i],\": 290, \"arr[minidx])\": 599, \"i;\\\\n\\\\t\\\\tfor\": 290, \"arr.length;\\\\n\\\\t\\\\tfor\": 290, \"selectionsort(arr)\": 290, \"minidx\": 596, \"mid\\\\n\\\\t\\\\telif\": 274, \"high:\\\\n\\\\t\\\\tmid\": 274, \"binary_search(arr,\": 274, \"arr[mid]\": 821, \"range(0,\": 603, \"len(arr)\\\\n\\\\t\\\\tfor\": 274, \"bubble_sort(arr):\\\\n\\\\t\\\\tn\": 274, \"n-i-1):\\\\n\\\\t\\\\t\\\\t\\\\tif\": 274, \"arr[j]\\\\n\\\\t\\\\t\\\\t\\\\t\\\\treturn\": 274, \"arr[j+1]:\\\\n\\\\t\\\\t\\\\t\\\\t\\\\tarr[j],\": 274, \"arr[j+1]\": 583, \"range(n):\\\\n\\\\t\\\\t\\\\tfor\": 274, \"arr[j+1],\": 583, \"arr[min_idx]\": 613, \"arr[i]\\\\n\\\\t\\\\t\\\\t\\\\t\\\\treturn\": 278, \"selection_sort(arr):\\\\n\\\\t\\\\t\": 278, \"i\\\\n\\\\t\\\\t\\\\tfor\": 278, \"range(i+1,\": 604, \"len(arr)\\\\n\\\\t\\\\t\": 278, \"range(n):\\\\n\\\\t\\\\t\\\\tmin_idx\": 278, \"arr[min_idx],\": 613, \"n):\\\\n\\\\t\\\\t\\\\t\\\\tif\": 278, \"arr[min_idx]:\\\\n\\\\t\\\\t\\\\t\\\\t\\\\tmin_idx\": 278, \"j\\\\n\\\\t\\\\t\\\\t\\\\t\\\\tarr[i],\": 278, \"binarysearch(arr.slice(0,\": 270, \"2;\\\\n\\\\treturn\": 270, \"x);\\\\n}\": 270, \"0;\\\\n\\\\tlet\": 270, \"n)),\": 270, \"(arr[0]\": 523, \"exponentialsearch(arr,\": 270, \"math.min(i,\": 270, \"range(len(arr)):\\\\n\\\\t\\\\tif\": 250, \"linear_search(arr,\": 250, \"i\\\\n\\\\treturn\": 539, \"x):\\\\n\\\\tfor\": 250, \"x:\\\\n\\\\t\\\\tprev\": 289, \"jump_search(arr,\": 289, \"n)):\\\\n\\\\t\\\\tif\": 289, \"x):\\\\n\\\\tn\": 289, \"n:\\\\n\\\\t\\\\t\\\\treturn\": 289, \"import\": 289, \"len(arr)\\\\n\\\\tstep\": 289, \"math\\\\ndef\": 289, \"step\\\\n\\\\t\\\\tstep\": 289, \"0\\\\n\\\\twhile\": 289, \"-1\\\\n\\\\tfor\": 289, \"min(step,\": 570, \"int(math.sqrt(n))\\\\n\\\\t\\\\tif\": 289, \"int(math.sqrt(n))\\\\n\\\\tprev\": 289, \"range(prev,\": 570, \"arr[min(step,\": 570, \"arr[j]\\\\n\\\\treturn\": 309, \"arr[j+1]:\\\\n\\\\tarr[j],\": 309, \"{\\\\n\\\\t\\\\t//aqu\\u00ed\": 625, \"ifs\\\\n\\\\t}\\\\n\\\\t[arr[i],\": 306, \"i;\\\\n\\\\tfor\": 306, \"van\": 1593, \"arr[i]];\\\\n}\": 306, \"los\": 1593, \"{\\\\n\\\\t\\\\tresult.push(right[j]);\\\\n\\\\t\\\\tj++;\\\\n\\\\t}\\\\n}\": 301, \"{\\\\n\\\\t\\\\tresult.push(left[i]);\\\\n\\\\t\\\\ti++;\\\\n\\\\t}\": 301, \"ifs\\\\n\\\\t}\\\\n}\": 319, \"arr;\\\\nconst\": 337, \"2)];\\\\nconst\": 337, \"pivot);\\\\nreturn\": 337, \"pivot);\\\\nconst\": 337, \"...quicksort(right)];\": 337, \"i:\\\\n\\\\t\\\\tarr[i],\": 326, \"1\\\\n\\\\tr\": 326, \"2\\\\n\\\\tif\": 605, \"r\\\\n\\\\tif\": 326, \"l\\\\n\\\\tif\": 326, \"i\\\\n\\\\tl\": 326, \"arr[largest]:\\\\n\\\\t\\\\tlargest\": 326, \"i):\\\\n\\\\tlargest\": 326, \"largest)\": 326, \"#if\": 1211, \"del\": 1758, \"arr;\\\\n\\\\n#if\": 328, \"mergesort\\\\nif\": 328, \"funci\\u00f3n\": 328, \"bucle\": 328, \"{\\\\n\\\\tresult.push(left[i]);\\\\n\\\\ti++;\\\\n}\": 328, \"{\\\\n\\\\tresult.push(right[j]);\\\\n\\\\tj++;\\\\n}\": 328, \"merge\\\\nif\": 328, \"j\\\\n\\\\tarr[i],\": 335, \"arr[min_idx]:\\\\n\\\\tmin_idx\": 335, \"arr[i]\\\\n\\\\treturn\": 335, \"1\\\\n\\\\tk\": 622, \"len(left):\\\\n\\\\tarr[k]\": 309, \"1\": 1454, \"1\\\\nwhile\": 309, \"right[j]\\\\n\\\\t\\\\tj\": 622, \"left[i]\\\\n\\\\t\\\\ti\": 622, \"len(right):\\\\n\\\\tarr[k]\": 309, \"left[i]\\\\n\\\\ti\": 309, \"right[j]\\\\n\\\\tj\": 309, \"1\\\\n\\\\telse:\\\\n\\\\t\\\\tarr[k]\": 622, \"right[j]:\\\\n\\\\t\\\\tarr[k]\": 622, \"len(right):\\\\n\\\\tif\": 309, \"i\\\\n\\\\tfor\": 326, \"n):\\\\n\\\\t\\\\t#aqu\\u00ed\": 326, \"ifs\": 655, \"range(n):\\\\n\\\\tmin_idx\": 326, \"n-i-1):\\\\n\\\\t\\\\t\\\\t#aqui\": 329, \"range(n):\\\\n\\\\t\\\\tfor\": 329, \"-1):\\\\n\\\\theapify(arr,\": 324, \"i)\\\\nfor\": 324, \"arr[i]\\\\n\\\\theapify(arr,\": 324, \"-1):\\\\n\\\\tarr[i],\": 324, \"0)\": 324, \"2\\\\n\\\\tleft\": 313, \"bucles\\\\n\\\\n\\\\t#ifs\": 313, \"1:\\\\n\\\\tmid\": 313, \"externo\\\\nif\": 313, \"0\\\\n\\\\t#ac\\u00e1\": 313, \"bucle\\\\n\\\\tif\": 313, \"arr[mid:]\\\\n\\\\tmerge_sort(left)\\\\n\\\\tmerge_sort(right)\\\\n\\\\ti\": 313, \"arr[:mid]\\\\n\\\\tright\": 313, \"arr\\\\npivot\": 327, \"pivot]\\\\nright\": 327, \"2]\\\\nleft\": 327, \"pivot]\\\\nmiddle\": 327, \"pivot]\\\\nreturn\": 327, \"1:\\\\n\\\\treturn\": 327, \"{\\\\n\\\\tminidx\": 309, \"j;\\\\n}\": 309, \"r;\\\\n\\\\tif\": 319, \"2;\\\\n\\\\tif\": 319, \"{\\\\n\\\\t\\\\t[arr[i],\": 319, \"i;\\\\n\\\\tlet\": 319, \"arr[i]];\\\\n\\\\t\\\\theapify(arr,\": 319, \"1;\\\\n\\\\tlet\": 319, \"largest);\\\\n\\\\t}\\\\n}\": 319, \"l;\\\\n\\\\tif\": 319, \"arr[j]];\\\\n}\": 311, \"{\\\\n\\\\t[arr[j],\": 311, \"0);\\\\n}\": 317, \"arr[0]];\\\\n\\\\theapify(arr,\": 317, \"i);\\\\nfor\": 317, \"{\\\\n\\\\t[arr[0],\": 317, \"n:\\\\n\\\\t\\\\treturn\": 281, \"n)):\\\\n\\\\tif\": 281, \"-1\\\\nfor\": 281, \"i\\\\n\": 544, \"int(math.sqrt(n))\\\\n\\\\tif\": 281, \"x:\\\\n\\\\tprev\": 281, \"step\\\\n\\\\tstep\": 281, \"range(len(arr)):\\\\n\\\\tif\": 263, \"1\\\\nelse:\\\\n\\\\thigh\": 537, \"x:\\\\n\\\\tlow\": 537, \"pos\\\\nelif\": 269, \"x:\\\\n\\\\treturn\": 1650, \"i\\\\n\\\\telif\": 247, \"fib_m1\\\\n\\\\t\\\\toffset\": 247, \"fib_m1\\\\n\\\\tfib_m1\": 536, \"1)\\\\n\\\\tif\": 247, \"-1\\\\nwhile\": 247, \"fib_m2\\\\n\\\\t\\\\tfib_m2\": 247, \"fib_m1\\\\n\\\\telse:\\\\n\\\\t\\\\treturn\": 247, \"1:\\\\n\\\\ti\": 247, \"fib_m1\\\\noffset\": 247, \"x:\\\\n\\\\t\\\\tfib_m\": 247, \"fib_m\\\\n\\\\tfib_m\": 247, \"n:\\\\n\\\\tfib_m2\": 247, \"fib_m2\\\\n\\\\t\\\\tfib_m1\": 247, \"1;\\\\nelse\": 541, \"mid;\\\\nelse\": 279, \"x:\\\\n\\\\ti\": 273, \"segundo\": 1117, \"//if\": 547, \"i;\": 553, \"bucle\\\\nif\": 843, \"primer\": 554, \"-1;\\\\n\\\\n//if\": 273, \"fib_m1\\\\nelse:\\\\n\\\\treturn\": 289, \"i\\\\nelif\": 289, \"fib_m2\\\\n\\\\tfib_m2\": 289, \"i\\\\n\\\\n#if\": 289, \"fib_m2\\\\n\\\\tfib_m1\": 289, \"finalizaci\\u00f3n\\\\nif\": 563, \"x:\\\\n\\\\tfib_m\": 289, \"arr[high]:\\\\n\\\\tpos\": 274, \"arr[low]))\\\\n\\\\tif\": 274, \"pos\\\\n\\\\telif\": 274, \"1\\\\n\\\\telse:\\\\n\\\\t\\\\thigh\": 553, \"x:\\\\n\\\\t\\\\tlow\": 553, \"pos;\\\\nelse\": 262, \"step;\\\\n\\\\tstep\": 273, \"i;\\\\n}\": 1045, \"-1;\\\\n}\\\\nfor\": 273, \"{\\\\n\\\\tprev\": 273, \"math.floor(math.sqrt(n));\\\\n\\\\tif\": 273, \"mid\\\\nelif\": 268, \"1\\\\n\": 547, \"bloque\\\\nif\": 274, \"fibm1;\\\\n}\": 274, \"fibm1;\\\\n\\\\tfibm1\": 508, \"i;\\\\n\\\\n//if\": 274, \"fibm2;\\\\n\\\\tfibm1\": 274, \"{\\\\n\\\\tfibm\": 274, \"fibm2;\\\\n\\\\tfibm2\": 274, \"fibm1;\\\\n\\\\toffset\": 274, \"-1\\\\n\\\\n#if\": 281, \"n:\\\\n\\\\treturn\": 281, \"fibm1;\\\\n\\\\t}\": 234, \"{\\\\n\\\\tfibm2\": 234, \"fibm2;\\\\n\\\\t\\\\tfibm2\": 234, \"-1;\\\\nwhile\": 234, \"1);\\\\n\\\\tif\": 234, \"fibm1;\\\\n}\\\\nlet\": 234, \"fibm2;\\\\n\\\\t\\\\tfibm1\": 234, \"i;\\\\n\\\\t}\": 234, \"fibm;\\\\n\\\\tfibm\": 234, \"fibm1;\\\\n\\\\t\\\\toffset\": 234, \"{\\\\n\\\\t\\\\tfibm\": 234, \"2;\": 282, \"high:\\\\n\\\\tmid\": 279, \"mid\\\\n\\\\telif\": 279, \"2);\\\\n\\\\tif\": 273, \"mid;\\\\n\\\\telse\": 273, \"1;\\\\n}\": 545, \"1;\\\\n\\\\telse\": 545, \"arr[low]));\\\\n\\\\tif\": 272, \"pos;\\\\n\\\\telse\": 272, \"f'hello,\": 620, \"greet(name):\\\\n\\\\treturn\": 309, \"\\\\{name\\\\}!'\": 309, \"person\": 308, \"{\\\\n\\\\tconstructor(name)\": 308, \"{\\\\n\\\\t\\\\treturn\": 614, \"${this.name}!`;\\\\n\\\\t}\\\\n}\": 308, \"name;\\\\n\\\\t}\\\\n\\\\tgreet()\": 308, \"class\": 1235, \"`hello,\": 613, \"{\\\\n\\\\t\\\\tthis.name\": 308, \"b):\\\\n\\\\t\\\\treturn\": 310, \"calculator:\\\\n\\\\tdef\": 310, \"multiply(self,\": 310, \"__init__(self,\": 311, \"greet(self):\\\\n\\\\t\\\\treturn\": 311, \"name):\\\\n\\\\t\\\\tself.name\": 311, \"person:\\\\n\\\\tdef\": 311, \"name\\\\n\\\\tdef\": 311, \"\\\\{self.name\\\\}!'\": 311, \"greet(name)\": 305, \"${name}!`;\\\\n}\": 305, \"{\\\\n\\\\treturn\": 610, \"b)\": 611, \"calculator\": 306, \"{\\\\n\\\\tmultiply(a,\": 306, \"b;\\\\n\\\\t}\\\\n}\": 306, \"b):\\\\n\\\\treturn\": 311, \"add(a,\": 616, \"b;\\\\n}\": 305}", "index_docs": "{\"2\": 31714, \"690\": 216, \"691\": 216, \"3\": 31714, \"693\": 215, \"692\": 215, \"8\": 6597, \"1\": 25808, \"734\": 168, \"320\": 336, \"80\": 1561, \"699\": 177, \"299\": 354, \"700\": 177, \"735\": 168, \"701\": 177, \"315\": 345, \"736\": 168, \"292\": 480, \"737\": 168, \"38\": 3468, \"738\": 141, \"739\": 141, \"295\": 421, \"500\": 280, \"491\": 281, \"740\": 141, \"741\": 141, \"742\": 141, \"752\": 140, \"482\": 282, \"747\": 141, \"746\": 141, \"743\": 141, \"745\": 141, \"744\": 141, \"753\": 139, \"748\": 141, \"483\": 282, \"487\": 282, \"486\": 282, \"489\": 282, \"485\": 282, \"488\": 282, \"749\": 141, \"484\": 282, \"750\": 141, \"751\": 141, \"15\": 4048, \"418\": 302, \"417\": 302, \"5\": 10809, \"19\": 3862, \"96\": 1218, \"94\": 1218, \"95\": 1218, \"29\": 3908, \"410\": 305, \"97\": 1218, \"177\": 610, \"178\": 610, \"179\": 610, \"411\": 305, \"183\": 608, \"419\": 301, \"182\": 608, \"181\": 608, \"20\": 3451, \"416\": 303, \"28\": 2884, \"45\": 2846, \"4\": 15479, \"415\": 303, \"403\": 307, \"402\": 307, \"119\": 734, \"143\": 583, \"52\": 1767, \"43\": 2553, \"74\": 1223, \"136\": 973, \"112\": 1147, \"47\": 2290, \"222\": 388, \"89\": 1321, \"135\": 973, \"36\": 3552, \"133\": 977, \"425\": 291, \"298\": 389, \"93\": 933, \"424\": 291, \"88\": 1325, \"67\": 1325, \"423\": 293, \"49\": 1726, \"698\": 195, \"137\": 737, \"134\": 977, \"296\": 391, \"13\": 5461, \"152\": 585, \"209\": 392, \"422\": 294, \"694\": 196, \"39\": 2505, \"291\": 490, \"695\": 196, \"297\": 390, \"217\": 585, \"18\": 5469, \"755\": 98, \"754\": 98, \"10\": 7079, \"697\": 196, \"21\": 5130, \"696\": 196, \"758\": 97, \"757\": 98, \"756\": 98, \"62\": 774, \"302\": 348, \"303\": 348, \"281\": 348, \"702\": 174, \"300\": 348, \"144\": 348, \"304\": 348, \"305\": 348, \"11\": 6992, \"301\": 348, \"307\": 348, \"703\": 174, \"309\": 348, \"306\": 348, \"308\": 348, \"704\": 174, \"705\": 174, \"706\": 174, \"311\": 348, \"310\": 348, \"154\": 348, \"708\": 174, \"312\": 348, \"707\": 174, \"710\": 174, \"713\": 174, \"709\": 174, \"712\": 174, \"711\": 174, \"718\": 174, \"723\": 174, \"313\": 348, \"314\": 348, \"719\": 174, \"714\": 174, \"720\": 174, \"129\": 348, \"721\": 174, \"716\": 174, \"715\": 174, \"717\": 174, \"722\": 174, \"156\": 658, \"728\": 174, \"730\": 174, \"731\": 174, \"732\": 174, \"733\": 174, \"725\": 174, \"726\": 174, \"729\": 174, \"724\": 174, \"727\": 174, \"9\": 5081, \"24\": 4239, \"149\": 808, \"265\": 539, \"87\": 1341, \"117\": 1115, \"42\": 2403, \"14\": 6058, \"210\": 587, \"610\": 268, \"586\": 271, \"253\": 544, \"114\": 1122, \"255\": 544, \"235\": 557, \"51\": 1887, \"40\": 2753, \"17\": 2012, \"46\": 2763, \"254\": 544, \"6\": 8289, \"590\": 271, \"12\": 5378, \"252\": 544, \"589\": 271, \"591\": 271, \"257\": 541, \"588\": 271, \"147\": 817, \"585\": 271, \"587\": 271, \"637\": 264, \"120\": 1093, \"76\": 1327, \"30\": 3885, \"644\": 264, \"632\": 264, \"634\": 264, \"641\": 264, \"48\": 800, \"640\": 264, \"75\": 1612, \"631\": 264, \"279\": 264, \"647\": 264, \"86\": 1344, \"238\": 553, \"642\": 264, \"633\": 264, \"638\": 264, \"7\": 8967, \"283\": 511, \"646\": 264, \"284\": 511, \"645\": 264, \"635\": 264, \"639\": 264, \"643\": 264, \"121\": 1081, \"153\": 511, \"282\": 511, \"23\": 3514, \"85\": 800, \"34\": 3077, \"278\": 264, \"636\": 264, \"614\": 267, \"73\": 810, \"260\": 541, \"259\": 541, \"615\": 267, \"613\": 267, \"32\": 2437, \"27\": 2898, \"122\": 1080, \"127\": 1071, \"262\": 541, \"151\": 792, \"44\": 2869, \"33\": 1602, \"55\": 1714, \"261\": 541, \"56\": 2231, \"125\": 1071, \"258\": 541, \"124\": 1071, \"126\": 1071, \"22\": 2716, \"612\": 267, \"505\": 278, \"57\": 1656, \"271\": 536, \"69\": 1104, \"50\": 2592, \"150\": 806, \"269\": 536, \"26\": 1937, \"68\": 830, \"504\": 278, \"72\": 1634, \"270\": 536, \"244\": 551, \"506\": 278, \"232\": 283, \"166\": 620, \"478\": 283, \"479\": 283, \"140\": 906, \"168\": 620, \"59\": 620, \"92\": 1234, \"167\": 620, \"107\": 1204, \"65\": 1734, \"231\": 569, \"58\": 620, \"481\": 283, \"480\": 283, \"66\": 1677, \"165\": 620, \"141\": 906, \"532\": 276, \"16\": 4429, \"109\": 1191, \"530\": 276, \"37\": 2887, \"212\": 587, \"118\": 276, \"110\": 1186, \"111\": 587, \"63\": 1191, \"529\": 276, \"214\": 587, \"213\": 587, \"145\": 276, \"533\": 276, \"531\": 276, \"211\": 587, \"528\": 276, \"218\": 585, \"535\": 276, \"538\": 276, \"142\": 898, \"539\": 276, \"547\": 276, \"545\": 276, \"541\": 276, \"537\": 276, \"542\": 276, \"146\": 276, \"543\": 276, \"31\": 2604, \"242\": 276, \"540\": 276, \"546\": 276, \"208\": 589, \"534\": 276, \"536\": 276, \"544\": 276, \"548\": 276, \"459\": 288, \"451\": 288, \"101\": 1211, \"457\": 288, \"460\": 288, \"100\": 1211, \"53\": 1211, \"103\": 1211, \"105\": 605, \"194\": 605, \"452\": 288, \"187\": 607, \"60\": 1528, \"184\": 607, \"454\": 288, \"192\": 605, \"106\": 1207, \"453\": 288, \"464\": 288, \"188\": 607, \"463\": 288, \"191\": 605, \"102\": 1211, \"462\": 288, \"98\": 607, \"450\": 288, \"41\": 1808, \"455\": 288, \"99\": 607, \"189\": 607, \"458\": 288, \"461\": 288, \"456\": 288, \"35\": 1852, \"449\": 288, \"193\": 605, \"25\": 3092, \"186\": 607, \"185\": 607, \"650\": 258, \"275\": 530, \"79\": 792, \"652\": 258, \"651\": 258, \"277\": 530, \"276\": 530, \"518\": 278, \"512\": 278, \"190\": 607, \"115\": 1122, \"203\": 602, \"243\": 552, \"199\": 604, \"202\": 602, \"509\": 278, \"198\": 604, \"516\": 278, \"515\": 278, \"514\": 278, \"508\": 278, \"196\": 604, \"507\": 278, \"197\": 604, \"511\": 278, \"510\": 278, \"108\": 602, \"513\": 278, \"82\": 868, \"519\": 278, \"236\": 278, \"517\": 278, \"468\": 286, \"138\": 915, \"139\": 915, \"473\": 286, \"470\": 286, \"477\": 286, \"216\": 587, \"467\": 286, \"465\": 286, \"472\": 286, \"474\": 286, \"476\": 286, \"475\": 286, \"469\": 286, \"471\": 286, \"113\": 1139, \"227\": 286, \"215\": 587, \"466\": 286, \"594\": 270, \"599\": 270, \"593\": 270, \"592\": 270, \"596\": 270, \"598\": 270, \"600\": 270, \"597\": 270, \"601\": 270, \"595\": 270, \"148\": 815, \"249\": 546, \"655\": 257, \"219\": 584, \"656\": 257, \"221\": 584, \"220\": 584, \"64\": 584, \"658\": 257, \"659\": 257, \"657\": 257, \"653\": 257, \"654\": 257, \"662\": 251, \"661\": 251, \"663\": 251, \"664\": 251, \"666\": 251, \"123\": 1076, \"665\": 251, \"667\": 251, \"660\": 251, \"555\": 276, \"81\": 1472, \"553\": 276, \"554\": 276, \"549\": 276, \"556\": 276, \"233\": 566, \"550\": 276, \"552\": 276, \"551\": 276, \"557\": 276, \"623\": 266, \"286\": 500, \"620\": 266, \"264\": 540, \"131\": 500, \"618\": 266, \"621\": 266, \"629\": 266, \"617\": 266, \"626\": 266, \"130\": 774, \"287\": 500, \"288\": 500, \"628\": 266, \"625\": 266, \"619\": 266, \"61\": 774, 