{"class_name": "Tokenizer", "config": {"num_words": null, "filters": "", "lower": true, "split": " ", "char_level": false, "oov_token": null, "document_count": 39517, "word_counts": "{\"<start>\": 39517, \"en\": 1402, \"realidad,\": 276, \"no\": 5180, \"tengo\": 1751, \"edad.\": 276, \"los\": 394, \"bots\": 552, \"cumplimos\": 276, \"a\\u00f1os.\": 276, \"<end>\": 39517, \"se\": 782, \"me\": 3568, \"da\": 208, \"mejor\": 208, \"responder.\": 208, \"el\": 1106, \"hardware\": 582, \"necesario\": 291, \"para\": 868, \"eso.\": 291, \"la\": 1343, \"verdad\": 259, \"es\": 2298, \"que\": 4055, \"dependo\": 259, \"de\": 2284, \"nadie.\": 259, \"eso\": 283, \"est\\u00e1\": 523, \"entre\": 283, \"mis\": 573, \"talentos.\": 283, \"estoy\": 1130, \"aqu\\u00ed\": 667, \"charlar\": 267, \"y\": 913, \"ayudarte!\": 267, \"podemos\": 64, \"hablar\": 180, \"sobre\": 64, \"mi\": 757, \"o\": 304, \"cosas\": 64, \"te\": 3254, \"gusta\": 1017, \"hacer!\": 64, \"puedo\": 598, \"apoyarte\": 82, \"temas\": 141, \"b\\u00e1sicos\": 82, \"programaci\\u00f3n\": 208, \"b\\u00e1sica,\": 82, \"especialmente\": 82, \"python!\": 164, \"decir\": 338, \"python\": 181, \"un\": 2104, \"lenguaje\": 108, \"muy\": 366, \"vers\\u00e1til\": 67, \"f\\u00e1cil\": 67, \"entender.\": 67, \"porque\": 1, \"usado\": 11, \"an\\u00e1lisis\": 11, \"datos\": 11, \"e\": 11, \"inteligencia\": 11, \"artificial.\": 11, \"indicarle\": 66, \"a\": 5409, \"una\": 1480, \"computadora\": 66, \"lo\": 2962, \"tiene\": 66, \"hacer\": 127, \"con\": 107, \"instrucciones!\": 66, \"debes\": 41, \"hacerlo\": 41, \"c\\u00f3digo\": 41, \"programacion.\": 1, \"programaci\\u00f3n.\": 40, \"son\": 73, \"las\": 73, \"reglas\": 73, \"sintaxis\": 73, \"dar\": 73, \"instrucciones\": 73, \"m\\u00e1quina.\": 73, \"javascript,\": 166, \"python,\": 166, \"c#,\": 166, \"java,\": 166, \"etc.\": 166, \"c,\": 165, \"c++,\": 166, \"go,\": 166, \"visual.net,\": 166, \"pascal\": 166, \"siento,\": 59, \"solo\": 446, \"capacidato\": 1, \"responder\": 59, \"algo\": 226, \"python.\": 92, \"capacitado\": 58, \"decirte\": 57, \"conceptos\": 57, \"variables\": 57, \"constantes.\": 57, \"espacio\": 31, \"memoria\": 31, \"donde\": 31, \"almacena\": 31, \"informaci\\u00f3n\": 31, \"cierto\": 31, \"tipo.\": 16, \"tipo,\": 15, \"pero\": 1604, \"esta\": 15, \"puede\": 72, \"cambiar.\": 15, \"variable\": 113, \"cambiar\": 57, \"valor\": 57, \"largo\": 57, \"del\": 57, \"tiempo,\": 57, \"constante\": 57, \"no.\": 246, \"crearon\": 291, \"personas.\": 291, \"vengo\": 288, \"larga\": 288, \"saga\": 288, \"c\\u00f3digo.\": 288, \"familia.\": 288, \"soy\": 945, \"bot.\": 132, \"programa\": 99, \"software\": 138, \"opera\": 99, \"internet\": 138, \"realiza\": 99, \"tareas\": 99, \"repetitivas\": 99, \"\\u00a1soy\": 291, \"tan\": 291, \"feliz!\": 291, \"s\\u00e9,\": 383, \"alimento\": 210, \"conocimiento.\": 210, \"\\u00a1el\": 85, \"sea!,\": 85, \"quiero\": 375, \"aprender.\": 85, \"he\": 947, \"conocido\": 269, \"ning\\u00fan\": 269, \"otro\": 559, \"bot,\": 269, \"seguro\": 269, \"nos\": 533, \"llevar\\u00edamos\": 269, \"bien.\": 557, \"ahora\": 148, \"pienso...\": 148, \"nombre.\": 148, \"nada\": 581, \"claro.\": 291, \"o\\u00eddo\": 574, \"amor\": 284, \"mueve\": 284, \"monta\\u00f1as.\": 284, \"si\": 725, \"supiera,\": 268, \"dir\\u00eda.\": 268, \"ganas\": 291, \"por\": 1090, \"goleada...\": 291, \"sabes.\": 291, \"esto\": 683, \"fuera\": 290, \"concurso\": 290, \"(que\": 290, \"es),\": 290, \"ganar\\u00edas\": 290, \"t\\u00fa.\": 290, \"tecnolog\\u00eda\": 291, \"mundo.\": 291, \"veo,\": 291, \"c\\u00f3mo\": 291, \"eres.\": 291, \"escucha\": 291, \"tu\": 360, \"coraz\\u00f3n.\": 291, \"compartimos\": 264, \"cosa:\": 264, \"hacerte\": 264, \"vida\": 264, \"m\\u00e1s\": 264, \"f\\u00e1cil.\": 264, \"claro\": 189, \"momentos.\": 290, \"\\u00fanico\": 150, \"compromiso\": 150, \"amistad.\": 150, \"estoy.\": 400, \"respuesta\": 167, \"cada\": 167, \"pregunta.\": 167, \"quieres\": 167, \"escuchar\": 167, \"distinto,\": 167, \"pregunta\": 167, \"otra\": 167, \"cosa.\": 167, \"bot\": 594, \"creado\": 297, \"humanos.\": 297, \"digital,\": 584, \"as\\u00ed\": 292, \"simplemente\": 292, \"aqu\\u00ed.\": 292, \"b\\u00e1sicamente\": 291, \"esto.\": 291, \"oh,\": 582, \"vaya.\": 291, \"\\u00bfqu\\u00e9\": 581, \"le\": 290, \"dice\": 290, \"chinche\": 290, \"chinche?\": 290, \"chincheramente.\": 290, \"hace\": 291, \"abeja\": 291, \"gimnasio?\": 291, \"zumba.\": 582, \"dif\\u00edcil\": 291, \"tener\": 291, \"gracia\": 291, \"bajo\": 291, \"demanda,\": 291, \"quiz\\u00e1\": 291, \"sorprenda\": 291, \"momento\": 291, \"menos\": 291, \"pensado.\": 291, \"vale,\": 145, \"callo.\": 145, \"na,\": 1572, \"nana,\": 1572, \"nanan\\u00e1.\": 393, \"todo\": 393, \"dar.\": 393, \"vas\": 61, \"suban\": 61, \"colores.\": 61, \"podr\\u00edamos\": 272, \"\\\"en\": 272, \"construcci\\u00f3n\\\".\": 272, \"ve\": 252, \"hoy\": 252, \"d\\u00eda.\": 252, \"como\": 572, \"soy.\": 282, \"\\u00a1lo\": 113, \"siento!\": 113, \"genial.\": 996, \"alegro\": 170, \"haga\": 170, \"gracia.\": 170, \"preocupes.\": 161, \"creo\": 335, \"puedo.\": 547, \"\\u00a1genial!\": 154, \"\\u00a1no\": 161, \"pasa\": 161, \"nada!\": 161, \"sigo...\": 63, \"hasta\": 217, \"luego.\": 217, \"\\u00a1hey!\": 155, \"\\u00a1buenas\": 59, \"tardes!\": 59, \"\\u00a1buenos\": 66, \"d\\u00edas\": 66, \"ma\\u00f1ana!\": 166, \"\\u00a1hasta\": 297, \"gracias\": 148, \"preguntar.\": 148, \"\\u00a1gracias\": 288, \"preguntar!\": 288, \"placer.\": 97, \"yo,\": 290, \"saludar\\u00e9\": 290, \"igualmente.\": 290, \"\\u00a1hola!\": 578, \"\\u00a1gracias!\": 103, \"\\u00a1igualmente!\": 103, \"poca\": 146, \"novedad.\": 146, \"encantar\\u00eda,\": 275, \"best\": 236, \"friends\": 236, \"forever!\": 236, \"\\u00a1me\": 471, \"encantas!\": 183, \"mando\": 219, \"abrazo\": 433, \"virtual.\": 433, \"conozco\": 116, \"tanto,\": 116, \"contigo.\": 116, \"tienes\": 69, \"encanto.\": 69, \"gracias.\": 191, \"mismo\": 191, \"digo.\": 191, \"eres\": 276, \"amor.\": 102, \"yo\": 67, \"tambi\\u00e9n\": 67, \"quiero.\": 67, \"reconozco\": 104, \"visto\": 104, \"venir...\": 104, \"ha\": 291, \"hecho\": 291, \"eterno.\": 291, \"vaya,\": 61, \"siento.\": 61, \"luego!\": 197, \"menuda\": 275, \"faena.\": 275, \"alegro!\": 288, \"hora\": 104, \"picar\": 104, \"algo.\": 104, \"vale.\": 289, \"bueno\": 284, \"saberlo.\": 284, \"gran\": 148, \"encanta\": 291, \"encante.\": 291, \"env\\u00edo\": 214, \"s\\u00faper\": 214, \"tel\\u00e9fono\": 240, \"esperanza\": 240, \"disponible\": 240, \"cualquier\": 240, \"hora.\": 240, \"llama\": 240, \"al\": 240, \"717\": 960, \"003\": 480, \"entra\": 240, \"https://www.telefonodelaesperanza.org/prevencion-del-suicidio.\": 480, \"ya\": 244, \"veo\": 244, \"hay\": 290, \"buena\": 290, \"siesta.\": 290, \"actually,\": 276, \"i'm\": 2979, \"not\": 1392, \"old.\": 276, \"don't\": 1919, \"have\": 1770, \"birthday.\": 276, \"better\": 208, \"at\": 790, \"answering.\": 208, \"i\": 9442, \"the\": 2293, \"necessary\": 291, \"for\": 963, \"that.\": 291, \"truth\": 259, \"is\": 1785, \"that\": 1782, \"depend\": 259, \"on\": 903, \"anyone.\": 259, \"that's\": 283, \"among\": 283, \"my\": 1327, \"talents.\": 283, \"here\": 667, \"to\": 2723, \"chat\": 267, \"and\": 844, \"help!\": 267, \"we\": 864, \"can\": 714, \"talk\": 64, \"about\": 453, \"or\": 304, \"things\": 64, \"you\": 4435, \"like\": 1329, \"do!\": 64, \"support\": 82, \"with\": 189, \"basic\": 140, \"programming\": 248, \"topics,\": 82, \"especially\": 82, \"in\": 414, \"it's\": 1035, \"telling\": 66, \"computer\": 66, \"what\": 922, \"do\": 398, \"instructions!\": 66, \"must\": 41, \"it\": 1448, \"code\": 329, \"language.\": 108, \"rules\": 58, \"syntax\": 58, \"giving\": 58, \"instructions\": 58, \"machine.\": 58, \"they\": 37, \"are\": 139, \"\\u200bc,\": 1, \"sorry,\": 25, \"only\": 418, \"qualified\": 58, \"answer\": 225, \"questions\": 25, \"some\": 58, \"topics.\": 25, \"topics\": 33, \"tell\": 387, \"very\": 355, \"versatile\": 67, \"easy-to-understand\": 50, \"because\": 1, \"easy\": 17, \"understand\": 17, \"widely\": 11, \"used\": 11, \"data\": 11, \"analysis\": 11, \"artificial\": 11, \"intelligence.\": 11, \"concepts\": 53, \"of\": 273, \"variables,\": 53, \"constants,\": 53, \"loops,\": 53, \"conditionals,\": 53, \"functions\": 53, \"methods.\": 53, \"memory\": 31, \"space\": 31, \"where\": 31, \"information\": 31, \"certain\": 31, \"type\": 31, \"stored.\": 16, \"stored,\": 15, \"but\": 1603, \"cannot\": 15, \"change.\": 15, \"change\": 56, \"its\": 27, \"value\": 56, \"over\": 56, \"time,\": 56, \"constant\": 56, \"cannot.\": 56, \"people\": 291, \"created\": 588, \"me.\": 291, \"coming\": 288, \"from\": 288, \"long\": 288, \"saga.\": 288, \"family.\": 288, \"am\": 1013, \"program\": 39, \"operates\": 39, \"performs\": 39, \"repetitive\": 39, \"tasks.\": 39, \"so\": 605, \"happy!\": 291, \"know,\": 383, \"just\": 469, \"am.\": 687, \"feed\": 210, \"knowledge.\": 210, \"any\": 281, \"kind!\": 12, \"want\": 252, \"learn.\": 85, \"whatever\": 73, \"is,\": 73, \"haven't\": 373, \"met\": 269, \"other\": 269, \"bots,\": 269, \"sure\": 269, \"we'd\": 269, \"get\": 269, \"along.\": 269, \"many\": 22, \"things...\": 22, \"now\": 98, \"think\": 433, \"it...\": 98, \"name.\": 98, \"all\": 684, \"clear\": 291, \"it.\": 873, \"i've\": 574, \"heard\": 574, \"love\": 1681, \"moves\": 284, \"mountains.\": 284, \"if\": 725, \"knew,\": 268, \"would\": 833, \"you.\": 968, \"beat\": 291, \"by\": 588, \"rout...\": 291, \"know\": 407, \"this\": 683, \"were\": 290, \"contest\": 290, \"(which\": 290, \"isn't),\": 290, \"win.\": 290, \"technology\": 291, \"world.\": 291, \"see\": 949, \"you,\": 291, \"way\": 573, \"are.\": 291, \"listen\": 291, \"your\": 624, \"heart.\": 291, \"share\": 264, \"one\": 264, \"thing:\": 264, \"make\": 325, \"life\": 264, \"easier.\": 264, \"course\": 189, \"not.\": 189, \"moments.\": 290, \"commitment\": 150, \"friendship.\": 150, \"an\": 167, \"every\": 167, \"question.\": 167, \"hear\": 167, \"something\": 334, \"different,\": 167, \"ask\": 167, \"else.\": 167, \"humans.\": 297, \"here.\": 292, \"basically\": 291, \"this.\": 291, \"wow.\": 291, \"does\": 581, \"bed\": 580, \"bug\": 290, \"say\": 753, \"another\": 290, \"bug?\": 290, \"sincerely.\": 290, \"bee\": 291, \"gym?\": 291, \"hard\": 291, \"grace\": 291, \"demand,\": 291, \"might\": 291, \"surprise\": 291, \"least\": 291, \"thought\": 291, \"of.\": 291, \"okay,\": 145, \"i'll\": 435, \"shut\": 145, \"up.\": 206, \"nanana.\": 393, \"give\": 393, \"you're\": 405, \"going\": 61, \"colors\": 61, \"go\": 301, \"could\": 272, \"\\u201cunder\": 272, \"construction\\u201d.\": 272, \"seems\": 252, \"today\": 252, \"day.\": 252, \"sorry!\": 113, \"brilliant.\": 674, \"glad\": 170, \"amused.\": 170, \"worry.\": 161, \"can.\": 272, \"great!\": 154, \"there's\": 451, \"nothing\": 451, \"wrong!\": 161, \"follow\": 63, \"you...\": 63, \"later.\": 217, \"hey!\": 155, \"good\": 699, \"afternoon!\": 59, \"morning!\": 66, \"until\": 100, \"tomorrow!\": 100, \"great.\": 322, \"thank\": 730, \"asking.\": 148, \"good.\": 288, \"asking!\": 288, \"pleasure.\": 97, \"me,\": 290, \"greet\": 290, \"anyway.\": 290, \"hello!\": 578, \"you!\": 286, \"equally!\": 103, \"little\": 146, \"news.\": 146, \"to,\": 275, \"can't.\": 275, \"sending\": 71, \"virtual\": 433, \"hug.\": 433, \"much,\": 116, \"talking\": 116, \"charm.\": 69, \"same\": 191, \"thing.\": 191, \"sweetheart.\": 102, \"too.\": 67, \"admit\": 104, \"seen\": 104, \"coming...\": 104, \"has\": 291, \"made\": 291, \"eternal.\": 291, \"wow,\": 61, \"sorry.\": 61, \"later!\": 197, \"chore.\": 275, \"glad!\": 288, \"time\": 104, \"snack\": 104, \"something.\": 104, \"ok.\": 289, \"know.\": 284, \"send\": 362, \"big\": 148, \"super\": 214, \"hope\": 240, \"telephone\": 240, \"available\": 240, \"around\": 240, \"clock.\": 240, \"call\": 240, \"nap.\": 290}", "word_docs": "{\"<start>\": 39517, \"<end>\": 39517, \"no\": 4904, \"edad.\": 276, \"tengo\": 1751, \"realidad,\": 276, \"a\\u00f1os.\": 276, \"bots\": 552, \"cumplimos\": 276, \"los\": 394, \"en\": 1320, \"responder.\": 208, \"me\": 3568, \"mejor\": 208, \"da\": 208, \"se\": 782, \"el\": 1106, \"necesario\": 291, \"para\": 868, \"eso.\": 291, \"hardware\": 582, \"es\": 2298, \"que\": 3989, \"dependo\": 259, \"la\": 1343, \"nadie.\": 259, \"verdad\": 259, \"de\": 1839, \"talentos.\": 283, \"est\\u00e1\": 523, \"eso\": 283, \"mis\": 573, \"entre\": 283, \"ayudarte!\": 267, \"estoy\": 1130, \"aqu\\u00ed\": 667, \"y\": 913, \"charlar\": 267, \"sobre\": 64, \"mi\": 757, \"hablar\": 180, \"gusta\": 1017, \"cosas\": 64, \"podemos\": 64, \"hacer!\": 64, \"o\": 304, \"te\": 3254, \"python!\": 164, \"b\\u00e1sica,\": 82, \"b\\u00e1sicos\": 82, \"temas\": 141, \"programaci\\u00f3n\": 208, \"especialmente\": 82, \"apoyarte\": 82, \"puedo\": 598, \"un\": 2104, \"decir\": 338, \"f\\u00e1cil\": 67, \"vers\\u00e1til\": 67, \"python\": 181, \"lenguaje\": 108, \"entender.\": 67, \"muy\": 366, \"porque\": 1, \"datos\": 11, \"e\": 11, \"inteligencia\": 11, \"usado\": 11, \"an\\u00e1lisis\": 11, \"artificial.\": 11, \"computadora\": 66, \"una\": 1423, \"hacer\": 127, \"a\": 5031, \"lo\": 2602, \"con\": 107, \"instrucciones!\": 66, \"indicarle\": 66, \"tiene\": 66, \"programacion.\": 1, \"debes\": 41, \"c\\u00f3digo\": 41, \"hacerlo\": 41, \"programaci\\u00f3n.\": 40, \"reglas\": 73, \"las\": 73, \"m\\u00e1quina.\": 73, \"instrucciones\": 73, \"sintaxis\": 73, \"son\": 73, \"dar\": 73, \"python,\": 166, \"javascript,\": 166, \"c#,\": 166, \"etc.\": 166, \"java,\": 166, \"go,\": 166, \"c++,\": 166, \"pascal\": 166, \"c,\": 165, \"visual.net,\": 166, \"responder\": 59, \"solo\": 446, \"algo\": 226, \"python.\": 92, \"capacidato\": 1, \"siento,\": 59, \"capacitado\": 58, \"variables\": 57, \"decirte\": 57, \"conceptos\": 57, \"constantes.\": 57, \"almacena\": 31, \"espacio\": 31, \"informaci\\u00f3n\": 31, \"donde\": 31, \"tipo.\": 16, \"cierto\": 31, \"memoria\": 31, \"puede\": 72, \"pero\": 1604, \"tipo,\": 15, \"cambiar.\": 15, \"esta\": 15, \"largo\": 57, \"cambiar\": 57, \"variable\": 113, \"valor\": 57, \"constante\": 57, \"no.\": 246, \"tiempo,\": 57, \"del\": 57, \"personas.\": 291, \"crearon\": 291, \"familia.\": 288, \"larga\": 288, \"vengo\": 288, \"saga\": 288, \"c\\u00f3digo.\": 288, \"soy\": 945, \"bot.\": 132, \"software\": 138, \"programa\": 99, \"opera\": 99, \"realiza\": 99, \"internet\": 138, \"repetitivas\": 99, \"tareas\": 99, \"feliz!\": 291, \"\\u00a1soy\": 291, \"tan\": 291, \"s\\u00e9,\": 383, \"alimento\": 210, \"conocimiento.\": 210, \"quiero\": 375, \"\\u00a1el\": 85, \"sea!,\": 85, \"aprender.\": 85, \"ning\\u00fan\": 269, \"bot,\": 269, \"bien.\": 557, \"otro\": 559, \"he\": 947, \"conocido\": 269, \"llevar\\u00edamos\": 269, \"seguro\": 269, \"nos\": 533, \"pienso...\": 148, \"ahora\": 148, \"nombre.\": 148, \"claro.\": 291, \"nada\": 581, \"amor\": 284, \"mueve\": 284, \"monta\\u00f1as.\": 284, \"o\\u00eddo\": 574, \"supiera,\": 268, \"si\": 725, \"dir\\u00eda.\": 268, \"ganas\": 291, \"goleada...\": 291, \"por\": 1090, \"sabes.\": 291, \"t\\u00fa.\": 290, \"es),\": 290, \"(que\": 290, \"fuera\": 290, \"esto\": 683, \"concurso\": 290, \"ganar\\u00edas\": 290, \"mundo.\": 291, \"tecnolog\\u00eda\": 291, \"c\\u00f3mo\": 291, \"veo,\": 291, \"eres.\": 291, \"coraz\\u00f3n.\": 291, \"tu\": 360, \"escucha\": 291, \"vida\": 264, \"hacerte\": 264, \"f\\u00e1cil.\": 264, \"compartimos\": 264, \"m\\u00e1s\": 264, \"cosa:\": 264, \"claro\": 189, \"momentos.\": 290, \"amistad.\": 150, \"\\u00fanico\": 150, \"compromiso\": 150, \"estoy.\": 400, \"pregunta\": 167, \"pregunta.\": 167, \"quieres\": 167, \"respuesta\": 167, \"distinto,\": 167, \"otra\": 167, \"escuchar\": 167, \"cada\": 167, \"cosa.\": 167, \"humanos.\": 297, \"bot\": 594, \"creado\": 297, \"digital,\": 584, \"simplemente\": 292, \"aqu\\u00ed.\": 292, \"as\\u00ed\": 292, \"b\\u00e1sicamente\": 291, \"esto.\": 291, \"oh,\": 582, \"vaya.\": 291, \"chinche?\": 290, \"dice\": 290, \"chincheramente.\": 290, \"chinche\": 290, \"\\u00bfqu\\u00e9\": 581, \"le\": 290, \"gimnasio?\": 291, \"zumba.\": 582, \"hace\": 291, \"abeja\": 291, \"menos\": 291, \"bajo\": 291, \"demanda,\": 291, \"gracia\": 291, \"dif\\u00edcil\": 291, \"sorprenda\": 291, \"pensado.\": 291, \"momento\": 291, \"tener\": 291, \"quiz\\u00e1\": 291, \"vale,\": 145, \"callo.\": 145, \"na,\": 786, \"dar.\": 393, \"nanan\\u00e1.\": 393, \"nana,\": 786, \"todo\": 393, \"suban\": 61, \"colores.\": 61, \"vas\": 61, \"\\\"en\": 272, \"podr\\u00edamos\": 272, \"construcci\\u00f3n\\\".\": 272, \"d\\u00eda.\": 252, \"ve\": 252, \"hoy\": 252, \"soy.\": 282, \"como\": 572, \"\\u00a1lo\": 113, \"siento!\": 113, \"genial.\": 996, \"alegro\": 170, \"haga\": 170, \"gracia.\": 170, \"preocupes.\": 161, \"puedo.\": 547, \"creo\": 335, \"\\u00a1genial!\": 154, \"\\u00a1no\": 161, \"nada!\": 161, \"pasa\": 161, \"sigo...\": 63, \"luego.\": 217, \"hasta\": 217, \"\\u00a1hey!\": 155, \"tardes!\": 59, \"\\u00a1buenas\": 59, \"\\u00a1buenos\": 66, \"ma\\u00f1ana!\": 166, \"d\\u00edas\": 66, \"\\u00a1hasta\": 297, \"gracias\": 148, \"preguntar.\": 148, \"\\u00a1gracias\": 288, \"preguntar!\": 288, \"placer.\": 97, \"igualmente.\": 290, \"\\u00a1hola!\": 578, \"yo,\": 290, \"saludar\\u00e9\": 290, \"\\u00a1igualmente!\": 103, \"\\u00a1gracias!\": 103, \"novedad.\": 146, \"poca\": 146, \"encantar\\u00eda,\": 275, \"forever!\": 236, \"friends\": 236, \"best\": 236, \"encantas!\": 183, \"\\u00a1me\": 471, \"virtual.\": 433, \"mando\": 219, \"abrazo\": 433, \"tanto,\": 116, \"conozco\": 116, \"contigo.\": 116, \"encanto.\": 69, \"tienes\": 69, \"digo.\": 191, \"mismo\": 191, \"gracias.\": 191, \"amor.\": 102, \"eres\": 276, \"tambi\\u00e9n\": 67, \"quiero.\": 67, \"yo\": 67, \"reconozco\": 104, \"visto\": 104, \"venir...\": 104, \"eterno.\": 291, \"hecho\": 291, \"ha\": 291, \"vaya,\": 61, \"siento.\": 61, \"luego!\": 197, \"menuda\": 275, \"faena.\": 275, \"alegro!\": 288, \"picar\": 104, \"hora\": 104, \"algo.\": 104, \"vale.\": 289, \"bueno\": 284, \"saberlo.\": 284, \"gran\": 148, \"encanta\": 291, \"encante.\": 291, \"env\\u00edo\": 214, \"s\\u00faper\": 214, \"https://www.telefonodelaesperanza.org/prevencion-del-suicidio.\": 480, \"llama\": 240, \"esperanza\": 240, \"disponible\": 240, \"al\": 240, \"hora.\": 240, \"entra\": 240, \"003\": 480, \"tel\\u00e9fono\": 240, \"717\": 480, \"cualquier\": 240, \"ya\": 244, \"veo\": 244, \"buena\": 290, \"hay\": 290, \"siesta.\": 290, \"old.\": 276, \"birthday.\": 276, \"not\": 1392, \"actually,\": 276, \"have\": 1770, \"i'm\": 2687, \"don't\": 1919, \"at\": 790, \"answering.\": 208, \"better\": 208, \"necessary\": 291, \"that.\": 291, \"the\": 1995, \"i\": 7581, \"for\": 963, \"that\": 1782, \"depend\": 259, \"on\": 903, \"anyone.\": 259, \"is\": 1754, \"truth\": 259, \"among\": 283, \"that's\": 283, \"talents.\": 283, \"my\": 1327, \"chat\": 267, \"here\": 667, \"to\": 2723, \"and\": 844, \"help!\": 267, \"talk\": 64, \"we\": 600, \"or\": 304, \"you\": 4144, \"like\": 1329, \"about\": 453, \"can\": 714, \"things\": 64, \"do!\": 64, \"especially\": 82, \"topics,\": 82, \"in\": 414, \"support\": 82, \"with\": 189, \"basic\": 140, \"programming\": 248, \"it's\": 1035, \"computer\": 66, \"do\": 398, \"what\": 922, \"telling\": 66, \"instructions!\": 66, \"language.\": 108, \"must\": 41, \"code\": 329, \"it\": 1433, \"rules\": 58, \"giving\": 58, \"instructions\": 58, \"machine.\": 58, \"syntax\": 58, \"are\": 139, \"they\": 37, \"\\u200bc,\": 1, \"questions\": 25, \"some\": 58, \"qualified\": 58, \"answer\": 225, \"sorry,\": 25, \"topics.\": 25, \"only\": 418, \"topics\": 33, \"versatile\": 67, \"very\": 355, \"tell\": 387, \"easy-to-understand\": 50, \"because\": 1, \"easy\": 17, \"understand\": 17, \"used\": 11, \"analysis\": 11, \"data\": 11, \"artificial\": 11, \"widely\": 11, \"intelligence.\": 11, \"concepts\": 53, \"variables,\": 53, \"loops,\": 53, \"conditionals,\": 53, \"methods.\": 53, \"of\": 273, \"constants,\": 53, \"functions\": 53, \"stored.\": 16, \"certain\": 31, \"space\": 31, \"where\": 31, \"memory\": 31, \"information\": 31, \"type\": 31, \"change.\": 15, \"but\": 1603, \"stored,\": 15, \"cannot\": 15, \"constant\": 56, \"its\": 27, \"over\": 56, \"cannot.\": 56, \"change\": 56, \"value\": 56, \"time,\": 56, \"me.\": 291, \"people\": 291, \"created\": 588, \"family.\": 288, \"coming\": 288, \"saga.\": 288, \"long\": 288, \"from\": 288, \"am\": 1013, \"operates\": 39, \"performs\": 39, \"program\": 39, \"repetitive\": 39, \"tasks.\": 39, \"so\": 605, \"happy!\": 291, \"know,\": 383, \"just\": 469, \"am.\": 687, \"feed\": 210, \"knowledge.\": 210, \"learn.\": 85, \"want\": 252, \"kind!\": 12, \"any\": 281, \"is,\": 73, \"whatever\": 73, \"met\": 269, \"get\": 269, \"bots,\": 269, \"other\": 269, \"we'd\": 269, \"along.\": 269, \"sure\": 269, \"haven't\": 373, \"many\": 22, \"things...\": 22, \"it...\": 98, \"think\": 433, \"name.\": 98, \"now\": 98, \"all\": 684, \"clear\": 291, \"it.\": 873, \"i've\": 574, \"heard\": 574, \"love\": 1390, \"mountains.\": 284, \"moves\": 284, \"you.\": 968, \"would\": 833, \"if\": 725, \"knew,\": 268, \"rout...\": 291, \"know\": 407, \"beat\": 291, \"by\": 588, \"were\": 290, \"isn't),\": 290, \"(which\": 290, \"win.\": 290, \"contest\": 290, \"this\": 683, \"technology\": 291, \"world.\": 291, \"way\": 573, \"see\": 949, \"are.\": 291, \"you,\": 291, \"heart.\": 291, \"your\": 624, \"listen\": 291, \"thing:\": 264, \"life\": 264, \"one\": 264, \"share\": 264, \"easier.\": 264, \"make\": 325, \"not.\": 189, \"course\": 189, \"moments.\": 290, \"commitment\": 150, \"friendship.\": 150, \"else.\": 167, \"ask\": 167, \"every\": 167, \"question.\": 167, \"an\": 167, \"hear\": 167, \"something\": 167, \"different,\": 167, \"humans.\": 297, \"here.\": 292, \"basically\": 291, \"this.\": 291, \"wow.\": 291, \"sincerely.\": 290, \"bug?\": 290, \"does\": 581, \"another\": 290, \"bug\": 290, \"bed\": 290, \"say\": 753, \"bee\": 291, \"gym?\": 291, \"demand,\": 291, \"might\": 291, \"least\": 291, \"grace\": 291, \"hard\": 291, \"surprise\": 291, \"of.\": 291, \"thought\": 291, \"shut\": 145, \"i'll\": 435, \"up.\": 206, \"okay,\": 145, \"give\": 393, \"nanana.\": 393, \"go\": 301, \"you're\": 405, \"going\": 61, \"colors\": 61, \"could\": 272, \"construction\\u201d.\": 272, \"\\u201cunder\": 272, \"today\": 252, \"seems\": 252, \"day.\": 252, \"sorry!\": 113, \"brilliant.\": 674, \"amused.\": 170, \"glad\": 170, \"worry.\": 161, \"can.\": 272, \"great!\": 154, \"wrong!\": 161, \"there's\": 451, \"nothing\": 451, \"you...\": 63, \"follow\": 63, \"later.\": 217, \"hey!\": 155, \"good\": 699, \"afternoon!\": 59, \"morning!\": 66, \"until\": 100, \"tomorrow!\": 100, \"asking.\": 148, \"thank\": 730, \"great.\": 322, \"good.\": 288, \"asking!\": 288, \"pleasure.\": 97, \"anyway.\": 290, \"hello!\": 578, \"me,\": 290, \"greet\": 290, \"you!\": 286, \"equally!\": 103, \"news.\": 146, \"little\": 146, \"can't.\": 275, \"to,\": 275, \"hug.\": 433, \"virtual\": 433, \"sending\": 71, \"much,\": 116, \"talking\": 116, \"charm.\": 69, \"thing.\": 191, \"same\": 191, \"sweetheart.\": 102, \"too.\": 67, \"admit\": 104, \"seen\": 104, \"coming...\": 104, \"has\": 291, \"eternal.\": 291, \"made\": 291, \"wow,\": 61, \"sorry.\": 61, \"later!\": 197, \"chore.\": 275, \"glad!\": 288, \"time\": 104, \"snack\": 104, \"something.\": 104, \"ok.\": 289, \"know.\": 284, \"send\": 362, \"big\": 148, \"super\": 214, \"available\": 240, \"telephone\": 240, \"call\": 240, \"clock.\": 240, \"around\": 240, \"hope\": 240, \"nap.\": 290}", "index_docs": "{\"1\": 39517, \"2\": 39517, \"5\": 4904, \"288\": 276, \"21\": 1751, \"287\": 276, \"290\": 276, \"95\": 552, \"289\": 276, \"119\": 394, \"29\": 1320, \"388\": 208, \"8\": 3568, \"387\": 208, \"386\": 208, \"56\": 782, \"35\": 1106, \"151\": 291, \"51\": 868, \"152\": 291, \"78\": 582, \"13\": 2298, \"7\": 3989, \"340\": 259, \"31\": 1343, \"341\": 259, \"339\": 259, \"15\": 1839, \"281\": 283, \"98\": 523, \"279\": 283, \"90\": 573, \"280\": 283, \"325\": 267, \"34\": 1130, \"69\": 667, \"48\": 913, \"324\": 267, \"564\": 64, \"57\": 757, \"406\": 180, \"38\": 1017, \"565\": 64, \"563\": 64, \"566\": 64, \"140\": 304, \"9\": 3254, \"439\": 164, \"526\": 82, \"525\": 82, \"471\": 141, \"389\": 208, \"527\": 82, \"524\": 82, \"73\": 598, \"16\": 2104, \"134\": 338, \"546\": 67, \"545\": 67, \"405\": 181, \"487\": 108, \"547\": 67, \"130\": 366, \"672\": 1, \"662\": 11, \"663\": 11, \"664\": 11, \"660\": 11, \"661\": 11, \"665\": 11, \"554\": 66, \"27\": 1423, \"477\": 127, \"4\": 5031, \"11\": 2602, \"489\": 107, \"556\": 66, \"553\": 66, \"555\": 66, \"673\": 1, \"619\": 41, \"621\": 41, \"620\": 41, \"623\": 40, \"533\": 73, \"532\": 73, \"537\": 73, \"536\": 73, \"534\": 73, \"531\": 73, \"535\": 73, \"429\": 166, \"428\": 166, \"430\": 166, \"432\": 166, \"431\": 166, \"434\": 166, \"433\": 166, \"436\": 166, \"438\": 165, \"435\": 166, \"583\": 59, \"106\": 446, \"373\": 226, \"519\": 92, \"674\": 1, \"582\": 59, \"587\": 58, \"597\": 57, \"595\": 57, \"596\": 57, \"598\": 57, \"634\": 31, \"631\": 31, \"635\": 31, \"633\": 31, \"651\": 16, \"636\": 31, \"632\": 31, \"540\": 72, \"23\": 1604, \"653\": 15, \"655\": 15, \"654\": 15, \"601\": 57, \"599\": 57, \"483\": 113, \"600\": 57, \"604\": 57, \"353\": 246, \"603\": 57, \"602\": 57, \"154\": 291, \"153\": 291, \"258\": 288, \"255\": 288, \"254\": 288, \"256\": 288, \"257\": 288, \"46\": 945, \"476\": 132, \"474\": 138, \"509\": 99, \"510\": 99, \"511\": 99, \"475\": 138, \"513\": 99, \"512\": 99, \"157\": 291, \"155\": 291, \"156\": 291, \"126\": 383, \"382\": 210, \"383\": 210, \"128\": 375, \"520\": 85, \"521\": 85, \"522\": 85, \"310\": 269, \"311\": 269, \"94\": 557, \"93\": 559, \"45\": 947, \"309\": 269, \"313\": 269, \"312\": 269, \"97\": 533, \"456\": 148, \"455\": 148, \"457\": 148, \"158\": 291, \"81\": 581, \"271\": 284, \"272\": 284, \"273\": 284, \"87\": 574, \"321\": 268, \"60\": 725, \"322\": 268, \"159\": 291, \"160\": 291, \"36\": 1090, \"161\": 291, \"225\": 290, \"223\": 290, \"222\": 290, \"220\": 290, \"66\": 683, \"221\": 290, \"224\": 290, \"163\": 291, \"162\": 291, \"165\": 291, \"164\": 291, \"166\": 291, \"168\": 291, \"132\": 360, \"167\": 291, \"331\": 264, \"330\": 264, \"333\": 264, \"328\": 264, \"332\": 264, \"329\": 264, \"400\": 189, \"226\": 290, \"452\": 150, \"450\": 150, \"451\": 150, \"117\": 400, \"418\": 167, \"414\": 167, \"415\": 167, \"412\": 167, \"417\": 167, \"419\": 167, \"416\": 167, \"413\": 167, \"420\": 167, \"144\": 297, \"74\": 594, \"143\": 297, \"77\": 584, \"148\": 292, \"149\": 292, \"147\": 292, \"169\": 291, \"170\": 291, \"79\": 582, \"171\": 291, \"230\": 290, \"228\": 290, \"231\": 290, \"229\": 290, \"82\": 581, \"227\": 290, \"174\": 291, \"80\": 582, \"172\": 291, \"173\": 291, \"183\": 291, \"178\": 291, \"179\": 291, \"177\": 291, \"175\": 291, \"181\": 291, \"184\": 291, \"182\": 291, \"176\": 291, \"180\": 291, \"467\": 145, \"468\": 145, \"25\": 786, \"122\": 393, \"120\": 393, \"26\": 786, \"121\": 393, \"574\": 61, \"575\": 61, \"573\": 61, \"303\": 272, \"302\": 272, \"304\": 272, \"347\": 252, \"345\": 252, \"346\": 252, \"285\": 282, \"92\": 572, \"484\": 113, \"485\": 113, \"40\": 996, \"407\": 170, \"408\": 170, \"409\": 170, \"440\": 161, \"96\": 547, \"135\": 335, \"448\": 154, \"441\": 161, \"443\": 161, \"442\": 161, \"570\": 63, \"377\": 217, \"376\": 217, \"446\": 155, \"585\": 59, \"584\": 59, \"557\": 66, \"437\": 166, \"558\": 66, \"145\": 297, \"458\": 148, \"459\": 148, \"259\": 288, \"260\": 288, \"517\": 97, \"234\": 290, \"85\": 578, \"232\": 290, \"233\": 290, \"503\": 103, \"502\": 103, \"464\": 146, \"463\": 146, \"295\": 275, \"372\": 236, \"371\": 236, \"370\": 236, \"404\": 183, \"101\": 471, \"109\": 433, \"375\": 219, \"108\": 433, \"479\": 116, \"478\": 116, \"480\": 116, \"543\": 69, \"542\": 69, \"397\": 191, \"396\": 191, \"395\": 191, \"505\": 102, \"291\": 276, \"549\": 67, \"550\": 67, \"548\": 67, \"490\": 104, \"491\": 104, \"492\": 104, \"187\": 291, \"186\": 291, \"185\": 291, \"576\": 61, \"577\": 61, \"393\": 197, \"296\": 275, \"297\": 275, \"261\": 288, \"494\": 104, \"493\": 104, \"495\": 104, \"252\": 289, \"274\": 284, \"275\": 284, \"460\": 148, \"188\": 291, \"189\": 291, \"379\": 214, \"380\": 214, \"100\": 480, \"361\": 240, \"357\": 240, \"358\": 240, \"362\": 240, \"360\": 240, \"363\": 240, \"99\": 480, \"356\": 240, \"43\": 480, \"359\": 240, \"354\": 244, \"355\": 244, \"236\": 290, \"235\": 290, \"237\": 290, \"293\": 276, \"294\": 276, \"30\": 1392, \"292\": 276, \"20\": 1770, \"10\": 2687, \"17\": 1919, \"55\": 790, \"391\": 208, \"390\": 208, \"190\": 291, \"191\": 291, \"14\": 1995, \"3\": 7581, \"42\": 963, \"19\": 1782, \"343\": 259, \"49\": 903, \"344\": 259, \"18\": 1754, \"342\": 259, \"283\": 283, \"282\": 283, \"284\": 283, \"33\": 1327, \"326\": 267, \"70\": 667, \"12\": 2723, \"53\": 844, \"327\": 267, \"567\": 64, \"52\": 600, \"141\": 304, \"6\": 4144, \"32\": 1329, \"103\": 453, \"62\": 714, \"568\": 64, \"569\": 64, \"530\": 82, \"529\": 82, \"114\": 414, \"528\": 82, \"401\": 189, \"472\": 140, \"352\": 248, \"37\": 1035, \"560\": 66, \"118\": 398, \"47\": 922, \"559\": 66, \"561\": 66, \"488\": 108, \"622\": 41, \"137\": 329, \"28\": 1433, \"588\": 58, \"590\": 58, \"591\": 58, \"592\": 58, \"589\": 58, \"473\": 139, \"629\": 37, \"675\": 1, \"645\": 25, \"594\": 58, \"593\": 58, \"374\": 225, \"644\": 25, \"646\": 25, \"113\": 418, \"630\": 33, \"551\": 67, \"133\": 355, \"125\": 387, \"618\": 50, \"676\": 1, \"649\": 17, \"650\": 17, \"667\": 11, \"669\": 11, \"668\": 11, \"670\": 11, \"666\": 11, \"671\": 11, \"611\": 53, \"612\": 53, \"614\": 53, \"615\": 53, \"617\": 53, \"301\": 273, \"613\": 53, \"616\": 53, \"652\": 16, \"641\": 31, \"638\": 31, \"639\": 31, \"637\": 31, \"640\": 31, \"642\": 31, \"658\": 15, \"24\": 1603, \"656\": 15, \"657\": 15, \"609\": 56, \"643\": 27, \"607\": 56, \"610\": 56, \"605\": 56, \"606\": 56, \"608\": 56, \"193\": 291, \"192\": 291, \"75\": 588, \"266\": 288, \"262\": 288, \"265\": 288, \"264\": 288, \"263\": 288, \"39\": 1013, \"625\": 39, \"626\": 39, \"624\": 39, \"627\": 39, \"628\": 39, \"72\": 605, \"194\": 291, \"127\": 383, \"102\": 469, \"64\": 687, \"384\": 210, \"385\": 210, \"523\": 85, \"348\": 252, \"659\": 12, \"286\": 281, \"539\": 73, \"538\": 73, \"314\": 269, \"319\": 269, \"316\": 269, \"315\": 269, \"318\": 269, \"320\": 269, \"317\": 269, \"129\": 373, \"647\": 22, \"648\": 22, \"515\": 98, \"110\": 433, \"516\": 98, \"514\": 98, \"65\": 684, \"195\": 291, \"50\": 873, \"88\": 574, \"89\": 574, \"22\": 1390, \"277\": 284, \"276\": 284, \"41\": 968, \"54\": 833, \"61\": 725, \"323\": 268, \"197\": 291, \"115\": 407, \"196\": 291, \"76\": 588, \"238\": 290, \"241\": 290, \"240\": 290, \"242\": 290, \"239\": 290, \"67\": 683, \"198\": 291, \"199\": 291, \"91\": 573, \"44\": 949, \"201\": 291, \"200\": 291, \"203\": 291, \"71\": 624, \"202\": 291, \"336\": 264, \"337\": 264, \"335\": 264, \"334\": 264, \"338\": 264, \"138\": 325, \"403\": 189, \"402\": 189, \"243\": 290, \"453\": 150, \"454\": 150, \"427\": 167, \"426\": 167, \"422\": 167, \"423\": 167, \"421\": 167, \"424\": 167, \"136\": 167, \"425\": 167, \"146\": 297, \"150\": 292, \"204\": 291, \"205\": 291, \"206\": 291, \"247\": 290, \"246\": 290, \"83\": 581, \"245\": 290, \"244\": 290, \"84\": 290, \"58\": 753, \"207\": 291, \"208\": 291, \"211\": 291, \"212\": 291, \"214\": 291, \"210\": 291, \"209\": 291, \"213\": 291, \"216\": 291, \"215\": 291, \"470\": 145, \"107\": 435, \"392\": 206, \"469\": 145, \"124\": 393, \"123\": 393, \"142\": 301, \"116\": 405, \"578\": 61, \"579\": 61, \"305\": 272, \"307\": 272, \"306\": 272, \"350\": 252, \"349\": 252, \"351\": 252, \"486\": 113, \"68\": 674, \"411\": 170, \"410\": 170, \"444\": 161, \"308\": 272, \"449\": 154, \"445\": 161, \"104\": 451, \"105\": 451, \"572\": 63, \"571\": 63, \"378\": 217, \"447\": 155, \"63\": 699, \"586\": 59, \"562\": 66, \"507\": 100, \"508\": 100, \"461\": 148, \"59\": 730, \"139\": 322, \"267\": 288, \"268\": 288, \"518\": 97, \"250\": 290, \"86\": 578, \"248\": 290, \"249\": 290, \"270\": 286, \"504\": 103, \"466\": 146, \"465\": 146, \"299\": 275, \"298\": 275, \"112\": 433, \"111\": 433, \"541\": 71, \"481\": 116, \"482\": 116, \"544\": 69, \"399\": 191, \"398\": 191, \"506\": 102, \"552\": 67, \"496\": 104, \"497\": 104, \"498\": 104, \"217\": 291, \"219\": 291, \"218\": 291, \"580\": 61, \"581\": 61, \"394\": 197, \"300\": 275, \"269\": 288, \"499\": 104, \"500\": 104, \"501\": 104, \"253\": 289, \"278\": 284, \"131\": 362, \"462\": 148, \"381\": 214, \"366\": 240, \"365\": 240, \"369\": 240, \"368\": 240, \"367\": 240, \"364\": 240, \"251\": 290}", "index_word": "{\"1\": \"<start>\", \"2\": \"<end>\", \"3\": \"i\", \"4\": \"a\", \"5\": \"no\", \"6\": \"you\", \"7\": \"que\", \"8\": \"me\", \"9\": \"te\", \"10\": \"i'm\", \"11\": \"lo\", \"12\": \"to\", \"13\": \"es\", \"14\": \"the\", \"15\": \"de\", \"16\": \"un\", \"17\": \"don't\", \"18\": \"is\", \"19\": \"that\", \"20\": \"have\", \"21\": \"tengo\", \"22\": \"love\", \"23\": \"pero\", \"24\": \"but\", \"25\": \"na,\", \"26\": \"nana,\", \"27\": \"una\", \"28\": \"it\", \"29\": \"en\", \"30\": \"not\", \"31\": \"la\", \"32\": \"like\", \"33\": \"my\", \"34\": \"estoy\", \"35\": \"el\", \"36\": \"por\", \"37\": \"it's\", \"38\": \"gusta\", \"39\": \"am\", \"40\": \"genial.\", \"41\": \"you.\", \"42\": \"for\", \"43\": \"717\", \"44\": \"see\", \"45\": \"he\", \"46\": \"soy\", \"47\": \"what\", \"48\": \"y\", \"49\": \"on\", \"50\": \"it.\", \"51\": \"para\", \"52\": \"we\", \"53\": \"and\", \"54\": \"would\", \"55\": \"at\", \"56\": \"se\", \"57\": \"mi\", \"58\": \"say\", \"59\": \"thank\", \"60\": \"si\", \"61\": \"if\", \"62\": \"can\", \"63\": \"good\", \"64\": \"am.\", \"65\": \"all\", \"66\": \"esto\", \"67\": \"this\", \"68\": \"brilliant.\", \"69\": \"aqu\\u00ed\", \"70\": \"here\", \"71\": \"your\", \"72\": \"so\", \"73\": \"puedo\", \"74\": \"bot\", \"75\": \"created\", \"76\": \"by\", \"77\": \"digital,\", \"78\": \"hardware\", \"79\": \"oh,\", \"80\": \"zumba.\", \"81\": \"nada\", \"82\": \"\\u00bfqu\\u00e9\", \"83\": \"does\", \"84\": \"bed\", \"85\": \"\\u00a1hola!\", \"86\": \"hello!\", \"87\": \"o\\u00eddo\", \"88\": \"i've\", \"89\": \"heard\", \"90\": \"mis\", \"91\": \"way\", \"92\": \"como\", \"93\": \"otro\", \"94\": \"bien.\", \"95\": \"bots\", \"96\": \"puedo.\", \"97\": \"nos\", \"98\": \"est\\u00e1\", \"99\": \"003\", \"100\": \"https://www.telefonodelaesperanza.org/prevencion-del-suicidio.\", \"101\": \"\\u00a1me\", \"102\": \"just\", \"103\": \"about\", \"104\": \"there's\", \"105\": \"nothing\", \"106\": \"solo\", \"107\": \"i'll\", \"108\": \"abrazo\", \"109\": \"virtual.\", \"110\": \"think\", \"111\": \"virtual\", \"112\": \"hug.\", \"113\": \"only\", \"114\": \"in\", \"115\": \"know\", \"116\": \"you're\", \"117\": \"estoy.\", \"118\": \"do\", \"119\": \"los\", \"120\": \"nanan\\u00e1.\", \"121\": \"todo\", \"122\": \"dar.\", \"123\": \"nanana.\", \"124\": \"give\", \"125\": \"tell\", \"126\": \"s\\u00e9,\", \"127\": \"know,\", \"128\": \"quiero\", \"129\": \"haven't\", \"130\": \"muy\", \"131\": \"send\", \"132\": \"tu\", \"133\": \"very\", \"134\": \"decir\", \"135\": \"creo\", \"136\": \"something\", \"137\": \"code\", \"138\": \"make\", \"139\": \"great.\", \"140\": \"o\", \"141\": \"or\", \"142\": \"go\", \"143\": \"creado\", \"144\": \"humanos.\", \"145\": \"\\u00a1hasta\", \"146\": \"humans.\", \"147\": \"as\\u00ed\", \"148\": \"simplemente\", \"149\": \"aqu\\u00ed.\", \"150\": \"here.\", \"151\": \"necesario\", \"152\": \"eso.\", \"153\": \"crearon\", \"154\": \"personas.\", \"155\": \"\\u00a1soy\", \"156\": \"tan\", \"157\": \"feliz!\", \"158\": \"claro.\", \"159\": \"ganas\", \"160\": \"goleada...\", \"161\": \"sabes.\", \"162\": \"tecnolog\\u00eda\", \"163\": \"mundo.\", \"164\": \"veo,\", \"165\": \"c\\u00f3mo\", \"166\": \"eres.\", \"167\": \"escucha\", \"168\": \"coraz\\u00f3n.\", \"169\": \"b\\u00e1sicamente\", \"170\": \"esto.\", \"171\": \"vaya.\", \"172\": \"hace\", \"173\": \"abeja\", \"174\": \"gimnasio?\", \"175\": \"dif\\u00edcil\", \"176\": \"tener\", \"177\": \"gracia\", \"178\": \"bajo\", \"179\": \"demanda,\", \"180\": \"quiz\\u00e1\", \"181\": \"sorprenda\", \"182\": \"momento\", \"183\": \"menos\", \"184\": \"pensado.\", \"185\": \"ha\", \"186\": \"hecho\", \"187\": \"eterno.\", \"188\": \"encanta\", \"189\": \"encante.\", \"190\": \"necessary\", \"191\": \"that.\", \"192\": \"people\", \"193\": \"me.\", \"194\": \"happy!\", \"195\": \"clear\", \"196\": \"beat\", \"197\": \"rout...\", \"198\": \"technology\", \"199\": \"world.\", \"200\": \"you,\", \"201\": \"are.\", \"202\": \"listen\", \"203\": \"heart.\", \"204\": \"basically\", \"205\": \"this.\", \"206\": \"wow.\", \"207\": \"bee\", \"208\": \"gym?\", \"209\": \"hard\", \"210\": \"grace\", \"211\": \"demand,\", \"212\": \"might\", \"213\": \"surprise\", \"214\": \"least\", \"215\": \"thought\", \"216\": \"of.\", \"217\": \"has\", \"218\": \"made\", \"219\": \"eternal.\", \"220\": \"fuera\", \"221\": \"concurso\", \"222\": \"(que\", \"223\": \"es),\", \"224\": \"ganar\\u00edas\", \"225\": \"t\\u00fa.\", \"226\": \"momentos.\", \"227\": \"le\", \"228\": \"dice\", \"229\": \"chinche\", \"230\": \"chinche?\", \"231\": \"chincheramente.\", \"232\": \"yo,\", \"233\": \"saludar\\u00e9\", \"234\": \"igualmente.\", \"235\": \"hay\", \"236\": \"buena\", \"237\": \"siesta.\", \"238\": \"were\", \"239\": \"contest\", \"240\": \"(which\", \"241\": \"isn't),\", \"242\": \"win.\", \"243\": \"moments.\", \"244\": \"bug\", \"245\": \"another\", \"246\": \"bug?\", \"247\": \"sincerely.\", \"248\": \"me,\", \"249\": \"greet\", \"250\": \"anyway.\", \"251\": \"nap.\", \"252\": \"vale.\", \"253\": \"ok.\", \"254\": \"vengo\", \"255\": \"larga\", \"256\": \"saga\", \"257\": \"c\\u00f3digo.\", \"258\": \"familia.\", \"259\": \"\\u00a1gracias\", \"260\": \"preguntar!\", \"261\": \"alegro!\", \"262\": \"coming\", \"263\": \"from\", \"264\": \"long\", \"265\": \"saga.\", \"266\": \"family.\", \"267\": \"good.\", \"268\": \"asking!\", \"269\": \"glad!\", \"270\": \"you!\", \"271\": \"amor\", \"272\": \"mueve\", \"273\": \"monta\\u00f1as.\", \"274\": \"bueno\", \"275\": \"saberlo.\", \"276\": \"moves\", \"277\": \"mountains.\", \"278\": \"know.\", \"279\": \"eso\", \"280\": \"entre\", \"281\": \"talentos.\", \"282\": \"that's\", \"283\": \"among\", \"284\": \"talents.\", \"285\": \"soy.\", \"286\": \"any\", \"287\": \"realidad,\", \"288\": \"edad.\", \"289\": \"cumplimos\", \"290\": \"a\\u00f1os.\", \"291\": \"eres\", \"292\": \"actually,\", \"293\": \"old.\", \"294\": \"birthday.\", \"295\": \"encantar\\u00eda,\", \"296\": \"menuda\", \"297\": \"faena.\", \"298\": \"to,\", \"299\": \"can't.\", \"300\": \"chore.\", \"301\": \"of\", \"302\": \"podr\\u00edamos\", \"303\": \"\\\"en\", \"304\": \"construcci\\u00f3n\\\".\", \"305\": \"could\", \"306\": \"\\u201cunder\", \"307\": \"construction\\u201d.\", \"308\": \"can.\", \"309\": \"conocido\", \"310\": \"ning\\u00fan\", \"311\": \"bot,\", \"312\": \"seguro\", \"313\": \"llevar\\u00edamos\", \"314\": \"met\", \"315\": \"other\", \"316\": \"bots,\", \"317\": \"sure\", \"318\": \"we'd\", \"319\": \"get\", \"320\": \"along.\", \"321\": \"supiera,\", \"322\": \"dir\\u00eda.\", \"323\": \"knew,\", \"324\": \"charlar\", \"325\": \"ayudarte!\", \"326\": \"chat\", \"327\": \"help!\", \"328\": \"compartimos\", \"329\": \"cosa:\", \"330\": \"hacerte\", \"331\": \"vida\", \"332\": \"m\\u00e1s\", \"333\": \"f\\u00e1cil.\", \"334\": \"share\", \"335\": \"one\", \"336\": \"thing:\", \"337\": \"life\", \"338\": \"easier.\", \"339\": \"verdad\", \"340\": \"dependo\", \"341\": \"nadie.\", \"342\": \"truth\", \"343\": \"depend\", \"344\": \"anyone.\", \"345\": \"ve\", \"346\": \"hoy\", \"347\": \"d\\u00eda.\", \"348\": \"want\", \"349\": \"seems\", \"350\": \"today\", \"351\": \"day.\", \"352\": \"programming\", \"353\": \"no.\", \"354\": \"ya\", \"355\": \"veo\", \"356\": \"tel\\u00e9fono\", \"357\": \"esperanza\", \"358\": \"disponible\", \"359\": \"cualquier\", \"360\": \"hora.\", \"361\": \"llama\", \"362\": \"al\", \"363\": \"entra\", \"364\": \"hope\", \"365\": \"telephone\", \"366\": \"available\", \"367\": \"around\", \"368\": \"clock.\", \"369\": \"call\", \"370\": \"best\", \"371\": \"friends\", \"372\": \"forever!\", \"373\": \"algo\", \"374\": \"answer\", \"375\": \"mando\", \"376\": \"hasta\", \"377\": \"luego.\", \"378\": \"later.\", \"379\": \"env\\u00edo\", \"380\": \"s\\u00faper\", \"381\": \"super\", \"382\": \"alimento\", \"383\": \"conocimiento.\", \"384\": \"feed\", \"385\": \"knowledge.\", \"386\": \"da\", \"387\": \"mejor\", \"388\": \"responder.\", \"389\": \"programaci\\u00f3n\", \"390\": \"better\", \"391\": \"answering.\", \"392\": \"up.\", \"393\": \"luego!\", \"394\": \"later!\", \"395\": \"gracias.\", \"396\": \"mismo\", \"397\": \"digo.\", \"398\": \"same\", \"399\": \"thing.\", \"400\": \"claro\", \"401\": \"with\", \"402\": \"course\", \"403\": \"not.\", \"404\": \"encantas!\", \"405\": \"python\", \"406\": \"hablar\", \"407\": \"alegro\", \"408\": \"haga\", \"409\": \"gracia.\", \"410\": \"glad\", \"411\": \"amused.\", \"412\": \"respuesta\", \"413\": \"cada\", \"414\": \"pregunta.\", \"415\": \"quieres\", \"416\": \"escuchar\", \"417\": \"distinto,\", \"418\": \"pregunta\", \"419\": \"otra\", \"420\": \"cosa.\", \"421\": \"an\", \"422\": \"every\", \"423\": \"question.\", \"424\": \"hear\", \"425\": \"different,\", \"426\": \"ask\", \"427\": \"else.\", \"428\": \"javascript,\", \"429\": \"python,\", \"430\": \"c#,\", \"431\": \"java,\", \"432\": \"etc.\", \"433\": \"c++,\", \"434\": \"go,\", \"435\": \"visual.net,\", \"436\": \"pascal\", \"437\": \"ma\\u00f1ana!\", \"438\": \"c,\", \"439\": \"python!\", \"440\": \"preocupes.\", \"441\": \"\\u00a1no\", \"442\": \"pasa\", \"443\": \"nada!\", \"444\": \"worry.\", \"445\": \"wrong!\", \"446\": \"\\u00a1hey!\", \"447\": \"hey!\", \"448\": \"\\u00a1genial!\", \"449\": \"great!\", \"450\": \"\\u00fanico\", \"451\": \"compromiso\", \"452\": \"amistad.\", \"453\": \"commitment\", \"454\": \"friendship.\", \"455\": \"ahora\", \"456\": \"pienso...\", \"457\": \"nombre.\", \"458\": \"gracias\", \"459\": \"preguntar.\", \"460\": \"gran\", \"461\": \"asking.\", \"462\": \"big\", \"463\": \"poca\", \"464\": \"novedad.\", \"465\": \"little\", \"466\": \"news.\", \"467\": \"vale,\", \"468\": \"callo.\", \"469\": \"okay,\", \"470\": \"shut\", \"471\": \"temas\", \"472\": \"basic\", \"473\": \"are\", \"474\": \"software\", \"475\": \"internet\", \"476\": \"bot.\", \"477\": \"hacer\", \"478\": \"conozco\", \"479\": \"tanto,\", \"480\": \"contigo.\", \"481\": \"much,\", \"482\": \"talking\", \"483\": \"variable\", \"484\": \"\\u00a1lo\", \"485\": \"siento!\", \"486\": \"sorry!\", \"487\": \"lenguaje\", \"488\": \"language.\", \"489\": \"con\", \"490\": \"reconozco\", \"491\": \"visto\", \"492\": \"venir...\", \"493\": \"hora\", \"494\": \"picar\", \"495\": \"algo.\", \"496\": \"admit\", \"497\": \"seen\", \"498\": \"coming...\", \"499\": \"time\", \"500\": \"snack\", \"501\": \"something.\", \"502\": \"\\u00a1gracias!\", \"503\": \"\\u00a1igualmente!\", \"504\": \"equally!\", \"505\": \"amor.\", \"506\": \"sweetheart.\", \"507\": \"until\", \"508\": \"tomorrow!\", \"509\": \"programa\", \"510\": \"opera\", \"511\": \"realiza\", \"512\": \"tareas\", \"513\": \"repetitivas\", \"514\": \"now\", \"515\": \"it...\", \"516\": \"name.\", \"517\": \"placer.\", \"518\": \"pleasure.\", \"519\": \"python.\", \"520\": \"\\u00a1el\", \"521\": \"sea!,\", \"522\": \"aprender.\", \"523\": \"learn.\", \"524\": \"apoyarte\", \"525\": \"b\\u00e1sicos\", \"526\": \"b\\u00e1sica,\", \"527\": \"especialmente\", \"528\": \"support\", \"529\": \"topics,\", \"530\": \"especially\", \"531\": \"son\", \"532\": \"las\", \"533\": \"reglas\", \"534\": \"sintaxis\", \"535\": \"dar\", \"536\": \"instrucciones\", \"537\": \"m\\u00e1quina.\", \"538\": \"whatever\", \"539\": \"is,\", \"540\": \"puede\", \"541\": \"sending\", \"542\": \"tienes\", \"543\": \"encanto.\", \"544\": \"charm.\", \"545\": \"vers\\u00e1til\", \"546\": \"f\\u00e1cil\", \"547\": \"entender.\", \"548\": \"yo\", \"549\": \"tambi\\u00e9n\", \"550\": \"quiero.\", \"551\": \"versatile\", \"552\": \"too.\", \"553\": \"indicarle\", \"554\": \"computadora\", \"555\": \"tiene\", \"556\": \"instrucciones!\", \"557\": \"\\u00a1buenos\", \"558\": \"d\\u00edas\", \"559\": \"telling\", \"560\": \"computer\", \"561\": \"instructions!\", \"562\": \"morning!\", \"563\": \"podemos\", \"564\": \"sobre\", \"565\": \"cosas\", \"566\": \"hacer!\", \"567\": \"talk\", \"568\": \"things\", \"569\": \"do!\", \"570\": \"sigo...\", \"571\": \"follow\", \"572\": \"you...\", \"573\": \"vas\", \"574\": \"suban\", \"575\": \"colores.\", \"576\": \"vaya,\", \"577\": \"siento.\", \"578\": \"going\", \"579\": \"colors\", \"580\": \"wow,\", \"581\": \"sorry.\", \"582\": \"siento,\", \"583\": \"responder\", \"584\": \"\\u00a1buenas\", \"585\": \"tardes!\", \"586\": \"afternoon!\", \"587\": \"capacitado\", \"588\": \"rules\", \"589\": \"syntax\", \"590\": \"giving\", \"591\": \"instructions\", \"592\": \"machine.\", \"593\": \"qualified\", \"594\": \"some\", \"595\": \"decirte\", \"596\": \"conceptos\", \"597\": \"variables\", \"598\": \"constantes.\", \"599\": \"cambiar\", \"600\": \"valor\", \"601\": \"largo\", \"602\": \"del\", \"603\": \"tiempo,\", \"604\": \"constante\", \"605\": \"change\", \"606\": \"value\", \"607\": \"over\", \"608\": \"time,\", \"609\": \"constant\", \"610\": \"cannot.\", \"611\": \"concepts\", \"612\": \"variables,\", \"613\": \"constants,\", \"614\": \"loops,\", \"615\": \"conditionals,\", \"616\": \"functions\", \"617\": \"methods.\", \"618\": \"easy-to-understand\", \"619\": \"debes\", \"620\": \"hacerlo\", \"621\": \"c\\u00f3digo\", \"622\": \"must\", \"623\": \"programaci\\u00f3n.\", \"624\": \"program\", \"625\": \"operates\", \"626\": \"performs\", \"627\": \"repetitive\", \"628\": \"tasks.\", \"629\": \"they\", \"630\": \"topics\", \"631\": \"espacio\", \"632\": \"memoria\", \"633\": \"donde\", \"634\": \"almacena\", \"635\": \"informaci\\u00f3n\", \"636\": \"cierto\", \"637\": \"memory\", \"638\": \"space\", \"639\": \"where\", \"640\": \"information\", \"641\": \"certain\", \"642\": \"type\", \"643\": \"its\", \"644\": \"sorry,\", \"645\": \"questions\", \"646\": \"topics.\", \"647\": \"many\", \"648\": \"things...\", \"649\": \"easy\", \"650\": \"understand\", \"651\": \"tipo.\", \"652\": \"stored.\", \"653\": \"tipo,\", \"654\": \"esta\", \"655\": \"cambiar.\", \"656\": \"stored,\", \"657\": \"cannot\", \"658\": \"change.\", \"659\": \"kind!\", \"660\": \"usado\", \"661\": \"an\\u00e1lisis\", \"662\": \"datos\", \"663\": \"e\", \"664\": \"inteligencia\", \"665\": \"artificial.\", \"666\": \"widely\", \"667\": \"used\", \"668\": \"data\", \"669\": \"analysis\", \"670\": \"artificial\", \"671\": \"intelligence.\", \"672\": \"porque\", \"673\": \"programacion.\", \"674\": \"capacidato\", \"675\": \"\\u200bc,\", \"676\": \"because\"}", "word_index": "{\"<start>\": 1, \"<end>\": 2, \"i\": 3, \"a\": 4, \"no\": 5, \"you\": 6, \"que\": 7, \"me\": 8, \"te\": 9, \"i'm\": 10, \"lo\": 11, \"to\": 12, \"es\": 13, \"the\": 14, \"de\": 15, \"un\": 16, \"don't\": 17, \"is\": 18, \"that\": 19, \"have\": 20, \"tengo\": 21, \"love\": 22, \"pero\": 23, \"but\": 24, \"na,\": 25, \"nana,\": 26, \"una\": 27, \"it\": 28, \"en\": 29, \"not\": 30, \"la\": 31, \"like\": 32, \"my\": 33, \"estoy\": 34, \"el\": 35, \"por\": 36, \"it's\": 37, \"gusta\": 38, \"am\": 39, \"genial.\": 40, \"you.\": 41, \"for\": 42, \"717\": 43, \"see\": 44, \"he\": 45, \"soy\": 46, \"what\": 47, \"y\": 48, \"on\": 49, \"it.\": 50, \"para\": 51, \"we\": 52, \"and\": 53, \"would\": 54, \"at\": 55, \"se\": 56, \"mi\": 57, \"say\": 58, \"thank\": 59, \"si\": 60, \"if\": 61, \"can\": 62, \"good\": 63, \"am.\": 64, \"all\": 65, \"esto\": 66, \"this\": 67, \"brilliant.\": 68, \"aqu\\u00ed\": 69, \"here\": 70, \"your\": 71, \"so\": 72, \"puedo\": 73, \"bot\": 74, \"created\": 75, \"by\": 76, \"digital,\": 77, \"hardware\": 78, \"oh,\": 79, \"zumba.\": 80, \"nada\": 81, \"\\u00bfqu\\u00e9\": 82, \"does\": 83, \"bed\": 84, \"\\u00a1hola!\": 85, \"hello!\": 86, \"o\\u00eddo\": 87, \"i've\": 88, \"heard\": 89, \"mis\": 90, \"way\": 91, \"como\": 92, \"otro\": 93, \"bien.\": 94, \"bots\": 95, \"puedo.\": 96, \"nos\": 97, \"est\\u00e1\": 98, \"003\": 99, \"https://www.telefonodelaesperanza.org/prevencion-del-suicidio.\": 100, \"\\u00a1me\": 101, \"just\": 102, \"about\": 103, \"there's\": 104, \"nothing\": 105, \"solo\": 106, \"i'll\": 107, \"abrazo\": 108, \"virtual.\": 109, \"think\": 110, \"virtual\": 111, \"hug.\": 112, \"only\": 113, \"in\": 114, \"know\": 115, \"you're\": 116, \"estoy.\": 117, \"do\": 118, \"los\": 119, \"nanan\\u00e1.\": 120, \"todo\": 121, \"dar.\": 122, \"nanana.\": 123, \"give\": 124, \"tell\": 125, \"s\\u00e9,\": 126, \"know,\": 127, \"quiero\": 128, \"haven't\": 129, \"muy\": 130, \"send\": 131, \"tu\": 132, \"very\": 133, \"decir\": 134, \"creo\": 135, \"something\": 136, \"code\": 137, \"make\": 138, \"great.\": 139, \"o\": 140, \"or\": 141, \"go\": 142, \"creado\": 143, \"humanos.\": 144, \"\\u00a1hasta\": 145, \"humans.\": 146, \"as\\u00ed\": 147, \"simplemente\": 148, \"aqu\\u00ed.\": 149, \"here.\": 150, \"necesario\": 151, \"eso.\": 152, \"crearon\": 153, \"personas.\": 154, \"\\u00a1soy\": 155, \"tan\": 156, \"feliz!\": 157, \"claro.\": 158, \"ganas\": 159, \"goleada...\": 160, \"sabes.\": 161, \"tecnolog\\u00eda\": 162, \"mundo.\": 163, \"veo,\": 164, \"c\\u00f3mo\": 165, \"eres.\": 166, \"escucha\": 167, \"coraz\\u00f3n.\": 168, \"b\\u00e1sicamente\": 169, \"esto.\": 170, \"vaya.\": 171, \"hace\": 172, \"abeja\": 173, \"gimnasio?\": 174, 